id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2798,Can you provide the emails of those living at 189 Jopson Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0","[Location] = 189 Jopson Street
Can you provide the emails of those living at 189 Jopson Street?",Can you provide the emails of those living at [x2.Location.address:189 Jopson Street]?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,408,entity_set,2
106,How many Ford vehicles were part of criminal activities on 23/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Ford"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Ford
[Crime] = 23/08/2017
How many Ford vehicles were part of criminal activities on 23/08/2017?",How many [x0.Vehicle.make:Ford] vehicles were part of criminal activities on [x1.Crime.date:23/08/2017]?,"x0.Vehicle.make:Ford = Ford
x1.Crime.date:23/08/2017 = 23/08/2017",2,12,count,1
3511,What are the postcodes for the residences of the friends of the person whose NHS number is 554-93-4466?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""554-93-4466"")
RETURN x0.postcode","[Person] = 554-93-4466
What are the postcodes for the residences of the friends of the person whose NHS number is 554-93-4466?",What are the postcodes for the residences of the friends of the person whose NHS number is [x2.Person.nhs_no:554-93-4466]?,x2.Person.nhs_no:554-93-4466 = 554-93-4466,3,104,attribute_set,5
3352,Which email addresses correspond to people living in the OL2 5RB zip code?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL2 5RB"")
RETURN x0.email_address","[Location] = OL2 5RB
Which email addresses correspond to people living in the OL2 5RB zip code?",Which email addresses correspond to people living in the [x2.Location.postcode:OL2 5RB] zip code?,x2.Location.postcode:OL2 5RB = OL2 5RB,3,45,attribute_set,1
492,How many crimes under investigation have a suspect or person with last name Powell?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Person] = Powell
How many crimes under investigation have a suspect or person with last name Powell?",How many crimes [x0.Crime.last_outcome:Under investigation] have a suspect or person with last name [x1.Person.surname:Powell]?,"x0.Crime.last_outcome:Under investigation = under investigation
x1.Person.surname:Powell = Powell",2,64,count,1
158,What crimes occurred on 19/08/2017 that Officer Leroy is investigating?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Leroy"")
RETURN x0","[Crime] = 19/08/2017
[Officer] = Leroy
What crimes occurred on 19/08/2017 that Officer Leroy is investigating?",What crimes occurred on [x0.Crime.date:19/08/2017] that Officer [x1.Officer.name:Leroy] is investigating?,"x0.Crime.date:19/08/2017 = 19/08/2017
x1.Officer.name:Leroy = Leroy",2,18,entity_set,2
3095,How many offenses include a person with surname Bailey who is friends with Raymond?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Bailey"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Raymond"")
RETURN COUNT(DISTINCT x0)","[Person] = Bailey
[Person] = Raymond
How many offenses include a person with surname Bailey who is friends with Raymond?",How many offenses include a person with surname [x1.Person.surname:Bailey] who is friends with [x2.Person.name:Raymond]?,"x1.Person.surname:Bailey = Bailey
x2.Person.name:Raymond = Raymond",3,7,count,1
2070,How often were Acuras involved in vehicle crimes?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Acura"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Acura
How often were Acuras involved in vehicle crimes?",How often were [x1.Vehicle.make:Acura]s involved in [x0.Crime.type:Vehicle crime]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Acura = Acura",2,278,count,1
3611,"What locations in the OL12 area had crimes with the status ""Unable to prosecute suspect""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Unable to prosecute suspect"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL12"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Area] = OL12
What locations in the OL12 area had crimes with the status ""Unable to prosecute suspect""?","What locations in the [x1.Area.areaCode:OL12] area had crimes with the status ""[x2.Crime.last_outcome:Unable to prosecute suspect]""?","x1.Area.areaCode:OL12 = OL12
x2.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",3,144,entity_set,111
2268,What is the number of people living with a person called Anne?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Anne"")
RETURN COUNT(DISTINCT x0)","[Person] = Anne
What is the number of people living with a person called Anne?",What is the number of people living with a person called [x1.Person.name:Anne]?,x1.Person.name:Anne = Anne,2,306,count,1
4453,What email addresses belong to a person residing with Brian?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0.email_address","[Person] = Brian
What email addresses belong to a person residing with Brian?",What email addresses belong to a person residing with [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,29,attribute_set,4
860,What is the count of people named Donald connected to crimes on 24th August 2017?,"MATCH (x0:Person WHERE x0.name = ""Donald"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Donald
[Crime] = 24/08/2017
What is the count of people named Donald connected to crimes on 24th August 2017?",What is the count of people named [x0.Person.name:Donald] connected to crimes on [x1.Crime.date:24/08/2017]?,"x0.Person.name:Donald = Donald
x1.Crime.date:24/08/2017 = 24th August 2017",2,113,count,1
3323,What are the home addresses of individuals known by someone named Heather?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Heather"")
RETURN x0.address","[Person] = Heather
What are the home addresses of individuals known by someone named Heather?",What are the home addresses of individuals known by someone named [x2.Person.name:Heather]?,x2.Person.name:Heather = Heather,3,42,attribute_set,5
1647,Can you show the calls to 5-(210)690-9847 that lasted 45 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""45"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(210)690-9847"")
RETURN x0","[PhoneCall] = 45
[Phone] = 5-(210)690-9847
Can you show the calls to 5-(210)690-9847 that lasted 45 seconds?",Can you show the calls to [x1.Phone.phoneNo:5-(210)690-9847] that lasted [x0.PhoneCall.call_duration:45] seconds?,"x0.PhoneCall.call_duration:45 = 45
x1.Phone.phoneNo:5-(210)690-9847 = 5-(210)690-9847",2,217,entity_set,2
2962,Can you provide the emails of people who are family members of the Phillips?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Phillips"")
RETURN x0","[Person] = Phillips
Can you provide the emails of people who are family members of the Phillips?",Can you provide the emails of people who are family members of the [x2.Person.surname:Phillips]?,x2.Person.surname:Phillips = Phillips,3,430,entity_set,3
4577,Who was the officer that looked into the crime involving the individual with NHS number 250-75-5238?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""250-75-5238"")
RETURN x0","[Person] = 250-75-5238
Who was the officer that looked into the crime involving the individual with NHS number 250-75-5238?",Who was the officer that looked into the crime involving the individual with NHS number [x2.Person.nhs_no:250-75-5238]?,x2.Person.nhs_no:250-75-5238 = 250-75-5238,3,67,entity_set,3
3668,What are the NHS numbers of individuals linked to someone living in the BL4 7BN postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""BL4 7BN"")
RETURN x0.nhs_no","[Location] = BL4 7BN
What are the NHS numbers of individuals linked to someone living in the BL4 7BN postcode?",What are the NHS numbers of individuals linked to someone living in the [x2.Location.postcode:BL4 7BN] postcode?,x2.Location.postcode:BL4 7BN = BL4 7BN,3,172,attribute_set,2
249,Can you show the phones that had calls on 28/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""28/08/2017"")
RETURN x0","[PhoneCall] = 28/08/2017
Can you show the phones that had calls on 28/08/2017?",Can you show the phones that had calls on [x1.PhoneCall.call_date:28/08/2017]?,x1.PhoneCall.call_date:28/08/2017 = 28/08/2017,2,30,entity_set,19
536,What is the number of crimes with Honda vehicles involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Honda"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Honda
What is the number of crimes with Honda vehicles involved?",What is the number of crimes with [x1.Vehicle.make:Honda] vehicles involved?,x1.Vehicle.make:Honda = Honda,2,70,count,1
1117,When did the first crime happen at 34 Toxhead Close?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""34 Toxhead Close"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 34 Toxhead Close
When did the first crime happen at 34 Toxhead Close?",When did the first crime happen at [x1.Location.address:34 Toxhead Close]?,x1.Location.address:34 Toxhead Close = 34 Toxhead Close,2,149,argmin,1
1154,How many individuals called Antonio are familiar with someone named Carolyn?,"MATCH (x0:Person WHERE x0.name = ""Antonio"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Carolyn"")
RETURN COUNT(DISTINCT x0)","[Person] = Antonio
[Person] = Carolyn
How many individuals called Antonio are familiar with someone named Carolyn?",How many individuals called [x0.Person.name:Antonio] are familiar with someone named [x1.Person.name:Carolyn]?,"x0.Person.name:Antonio = Antonio
x1.Person.name:Carolyn = Carolyn",2,153,count,1
1999,Can you identify the crimes from 7/08/2017 being probed by Sergeants?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN x0","[Crime] = 7/08/2017
[Officer] = Sergeant
Can you identify the crimes from 7/08/2017 being probed by Sergeants?",Can you identify the crimes from [x0.Crime.date:7/08/2017] being probed by [x1.Officer.rank:Sergeant]?,"x0.Crime.date:7/08/2017 = 7/08/2017
x1.Officer.rank:Sergeant = Sergeants",2,268,entity_set,309
338,Can you name everyone living at 162 Lowther Road?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""162 Lowther Road"")
RETURN x0","[Location] = 162 Lowther Road
Can you name everyone living at 162 Lowther Road?",Can you name everyone living at [x1.Location.address:162 Lowther Road]?,x1.Location.address:162 Lowther Road = 162 Lowther Road,2,42,entity_set,2
2618,Who owns a phone?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN x0",Who owns a phone?,Who owns a phone?,,2,376,entity_set,328
1936,What are the dates of crimes involving people whose phone numbers are known by Petersons?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Peterson"")
RETURN x0.date","[Person] = Peterson
What are the dates of crimes involving people whose phone numbers are known by Petersons?",What are the dates of crimes involving people whose phone numbers are known by [x2.Person.surname:Peterson]?,x2.Person.surname:Peterson = Petersons,3,258,attribute_set,4
862,How many individuals does someone with last name Hamilton know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Hamilton"")
RETURN COUNT(DISTINCT x0)","[Person] = Hamilton
How many individuals does someone with last name Hamilton know?",How many individuals does someone with last name [x1.Person.surname:Hamilton] know?,x1.Person.surname:Hamilton = Hamilton,2,114,count,1
851,Can you provide a list of crimes with Suzuki vehicles involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Suzuki"")
RETURN x0","[Vehicle] = Suzuki
Can you provide a list of crimes with Suzuki vehicles involved?",Can you provide a list of crimes with [x1.Vehicle.make:Suzuki] vehicles involved?,x1.Vehicle.make:Suzuki = Suzuki,2,112,entity_set,15
2017,"How many incidents labeled ""Investigation complete; no suspect identified"" involved vehicles of the Protege model?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Protege"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = Protege
How many incidents labeled ""Investigation complete; no suspect identified"" involved vehicles of the Protege model?","How many incidents labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involved vehicles of the [x1.Vehicle.model:Protege] model?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:Protege = Protege",2,270,count,1
2867,How many investigations involving a Williamson are conducted by Sergeants?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Person] = Williamson
How many investigations involving a Williamson are conducted by Sergeants?",How many investigations involving a [x1.Person.surname:Williamson] are conducted by [x2.Officer.rank:Sergeant]?,"x1.Person.surname:Williamson = Williamson
x2.Officer.rank:Sergeant = Sergeants",3,416,count,1
1288,How many incidents of 'Other theft' happened anywhere?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:OCCURRED_AT]-(x1:Location)
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
How many incidents of 'Other theft' happened anywhere?",How many incidents of '[x0.Crime.type:Other theft]' happened anywhere?,x0.Crime.type:Other theft = Other theft,2,171,count,1
2097,Can you show the 43-second calls made to 9-(721)729-4724?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""43"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(721)729-4724"")
RETURN x0","[PhoneCall] = 43
[Phone] = 9-(721)729-4724
Can you show the 43-second calls made to 9-(721)729-4724?",Can you show the [x0.PhoneCall.call_duration:43]-second calls made to [x1.Phone.phoneNo:9-(721)729-4724]?,"x0.PhoneCall.call_duration:43 = 43
x1.Phone.phoneNo:9-(721)729-4724 = 9-(721)729-4724",2,283,entity_set,2
1534,How many crimes on 7/08/2017 involved vehicles of the Pathfinder model?,"MATCH (x0:Vehicle WHERE x0.model = ""Pathfinder"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Pathfinder
[Crime] = 7/08/2017
How many crimes on 7/08/2017 involved vehicles of the Pathfinder model?",How many crimes on [x1.Crime.date:7/08/2017] involved vehicles of the [x0.Vehicle.model:Pathfinder] model?,"x0.Vehicle.model:Pathfinder = Pathfinder
x1.Crime.date:7/08/2017 = 7/08/2017",2,203,count,1
651,Who is the senior family member connected to someone familiar with a Ruiz's phone number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Ruiz"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Ruiz
Who is the senior family member connected to someone familiar with a Ruiz's phone number?",Who is the senior family member connected to someone familiar with a [x2.Person.surname:Ruiz]'s phone number?,x2.Person.surname:Ruiz = Ruiz,3,86,max,1
1141,Which phones placed a call at 20:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""20:26"")
RETURN x0","[PhoneCall] = 20:26
Which phones placed a call at 20:26?",Which phones placed a call at [x1.PhoneCall.call_time:20:26]?,x1.PhoneCall.call_time:20:26 = 20:26,2,151,entity_set,1
1814,How many drug-related crimes involve individuals with last name Powell?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Powell
How many drug-related crimes involve individuals with last name Powell?",How many [x0.Crime.type:Drugs] involve individuals with last name [x1.Person.surname:Powell]?,"x0.Crime.type:Drugs = drug-related crimes 
x1.Person.surname:Powell = Powell",2,241,count,1
1321,How many regions have places with the postcode M4 7FN?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M4 7FN"")
RETURN COUNT(DISTINCT x0)","[Location] = M4 7FN
How many regions have places with the postcode M4 7FN?",How many regions have places with the postcode [x1.Location.postcode:M4 7FN]?,x1.Location.postcode:M4 7FN = M4 7FN,2,175,count,1
1074,How many phones are owned by individuals named Richard?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Richard"")
RETURN COUNT(DISTINCT x0)","[Person] = Richard
How many phones are owned by individuals named Richard?",How many phones are owned by individuals named [x1.Person.name:Richard]?,x1.Person.name:Richard = Richard,2,142,count,1
1750,How many locations are the residence of anyone whose last name is Porter?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Porter"")
RETURN COUNT(DISTINCT x0)","[Person] = Porter
How many locations are the residence of anyone whose last name is Porter?",How many locations are the residence of anyone whose last name is [x1.Person.surname:Porter]?,x1.Person.surname:Porter = Porter,2,232,count,1
2212,How many cases labeled Under investigation are being looked into by Police Constables?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = Police Constable
How many cases labeled Under investigation are being looked into by Police Constables?",How many cases labeled [x0.Crime.last_outcome:Under investigation] are being looked into by [x1.Officer.rank:Police Constable]?,"x0.Crime.last_outcome:Under investigation = Under investigation
x1.Officer.rank:Police Constable = Police Constables",2,298,count,1
2913,What was the initial crime at 169 Thynne Street involving a Firebird vehicle?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""169 Thynne Street"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Firebird"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 169 Thynne Street
[Vehicle] = Firebird
What was the initial crime at 169 Thynne Street involving a Firebird vehicle?",What was the initial crime at [x2.Location.address:169 Thynne Street] involving a [x1.Vehicle.model:Firebird] vehicle?,"x1.Vehicle.model:Firebird = Firebird
x2.Location.address:169 Thynne Street = 169 Thynne Street",3,422,min,1
660,What number of crimes happened at locations with postcode BL4 7DZ?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""BL4 7DZ"")
RETURN COUNT(DISTINCT x0)","[Location] = BL4 7DZ
What number of crimes happened at locations with postcode BL4 7DZ?",What number of crimes happened at locations with postcode [x1.Location.postcode:BL4 7DZ]?,x1.Location.postcode:BL4 7DZ = BL4 7DZ,2,87,count,1
1729,"On 6/08/2017, how many vehicles were used in crimes?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""6/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 6/08/2017
On 6/08/2017, how many vehicles were used in crimes?","On [x1.Crime.date:6/08/2017], how many vehicles were used in crimes?",x1.Crime.date:6/08/2017 = 6/08/2017,2,228,count,1
1125,On what date did the first incident occur at the Petrol Station?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = Petrol Station
On what date did the first incident occur at the Petrol Station?",On what date did the first incident occur at the [x1.Location.address:Petrol Station]?,x1.Location.address:Petrol Station = Petrol Station,2,149,argmin,1
1620,Which crime involving Quest vehicles happened first?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Quest"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Quest
Which crime involving Quest vehicles happened first?",Which crime involving [x1.Vehicle.model:Quest] vehicles happened first?,x1.Vehicle.model:Quest = Quest,2,214,min,1
704,Can you show the calls from 3-(391)773-5694 at 14:46?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""14:46"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(391)773-5694"")
RETURN x0","[PhoneCall] = 14:46
[Phone] = 3-(391)773-5694
Can you show the calls from 3-(391)773-5694 at 14:46?",Can you show the calls from [x1.Phone.phoneNo:3-(391)773-5694] at [x0.PhoneCall.call_time:14:46]?,"x0.PhoneCall.call_time:14:46 = 14:46
x1.Phone.phoneNo:3-(391)773-5694 = 3-(391)773-5694",2,93,entity_set,1
2611,How many investigations are conducted by officers whose last name is Gurry?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Gurry"")
RETURN COUNT(DISTINCT x0)","[Officer] = Gurry
How many investigations are conducted by officers whose last name is Gurry?",How many investigations are conducted by officers whose last name is [x1.Officer.surname:Gurry]?,x1.Officer.surname:Gurry = Gurry,2,372,count,1
931,"How many crimes on August 14, 2017, involved a vehicle?","MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
How many crimes on August 14, 2017, involved a vehicle?","How many crimes on [x0.Crime.date:14/08/2017], involved a vehicle?","x0.Crime.date:14/08/2017 = August 14, 2017",2,121,count,1
673,What is the crime count for 130 Crompton Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""130 Crompton Street"")
RETURN COUNT(DISTINCT x0)","[Location] = 130 Crompton Street
What is the crime count for 130 Crompton Street?",What is the crime count for [x1.Location.address:130 Crompton Street]?,x1.Location.address:130 Crompton Street = 130 Crompton Street,2,89,count,1
13,How many offenses with the status Unable to prosecute suspect are overseen by officers whose last name is Tennick?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tennick"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Officer] = Tennick
How many offenses with the status Unable to prosecute suspect are overseen by officers whose last name is Tennick?",How many offenses with the status [x0.Crime.last_outcome:Unable to prosecute suspect] are overseen by officers whose last name is [x1.Officer.surname:Tennick]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Officer.surname:Tennick = Tennick",2,2,count,1
17,How many places with the postcode OL4 1AH experienced crimes?,"MATCH (x0:Location WHERE x0.postcode = ""OL4 1AH"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = OL4 1AH
How many places with the postcode OL4 1AH experienced crimes?",How many places with the postcode [x0.Location.postcode:OL4 1AH] experienced crimes?,x0.Location.postcode:OL4 1AH = OL4 1AH,2,3,count,1
3081,What vehicles are linked to crimes involving individuals with NHS number 247-72-6304?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
What vehicles are linked to crimes involving individuals with NHS number 247-72-6304?",What vehicles are linked to crimes involving individuals with NHS number [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,6,entity_set,1
2561,Which is the earliest crime involving a Rondo model and someone with last name Moore?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Moore"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Rondo"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Moore
[Vehicle] = Rondo
Which is the earliest crime involving a Rondo model and someone with last name Moore?",Which is the earliest crime involving a [x1.Vehicle.model:Rondo] model and someone with last name [x2.Person.surname:Moore]?,"x1.Vehicle.model:Rondo = Rondo
x2.Person.surname:Moore = Moore",3,358,min,1
1819,How often do vehicle crimes include suspects or victims with the last name Moore?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Moore"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Moore
How often do vehicle crimes include suspects or victims with the last name Moore?",How often do [x0.Crime.type:Vehicle crime] include suspects or victims with the last name [x1.Person.surname:Moore]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Person.surname:Moore = Moore",2,241,count,1
1704,What are the residences at 98 Tatton Road North for individuals with surname Fernandez?,"MATCH (x0:Location WHERE x0.address = ""98 Tatton Road North"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Location] = 98 Tatton Road North
[Person] = Fernandez
What are the residences at 98 Tatton Road North for individuals with surname Fernandez?",What are the residences at [x0.Location.address:98 Tatton Road North] for individuals with surname [x1.Person.surname:Fernandez]?,"x0.Location.address:98 Tatton Road North = 98 Tatton Road North
x1.Person.surname:Fernandez = Fernandez",2,224,entity_set,1
1382,What is the total number of calls to 2-(362)925-2397?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""2-(362)925-2397"")
RETURN COUNT(DISTINCT x0)","[Phone] = 2-(362)925-2397
What is the total number of calls to 2-(362)925-2397?",What is the total number of calls to [x1.Phone.phoneNo:2-(362)925-2397]?,x1.Phone.phoneNo:2-(362)925-2397 = 2-(362)925-2397,2,181,count,1
2805,What are the emails of those living at 73 Grindrod Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""73 Grindrod Street"")
RETURN x0","[Location] = 73 Grindrod Street
What are the emails of those living at 73 Grindrod Street?",What are the emails of those living at [x2.Location.address:73 Grindrod Street]?,x2.Location.address:73 Grindrod Street = 73 Grindrod Street,3,408,entity_set,1
2124,How many Sergeants probed incidents on 3rd August 2017?,"MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""3/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Crime] = 3/08/2017
How many Sergeants probed incidents on 3rd August 2017?",How many [x0.Officer.rank:Sergeant] probed incidents on [x1.Crime.date:3/08/2017]?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.date:3/08/2017 = 3rd August 2017",2,286,count,1
1726,"On August 13, 2017, how many vehicles were connected to crimes?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
On August 13, 2017, how many vehicles were connected to crimes?","On [x1.Crime.date:13/08/2017], how many vehicles were connected to crimes?","x1.Crime.date:13/08/2017 = August 13, 2017",2,228,count,1
1795,Who is the oldest member living with those with surname Hernandez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Hernandez
Who is the oldest member living with those with surname Hernandez?",Who is the oldest member living with those with surname [x1.Person.surname:Hernandez]?,x1.Person.surname:Hernandez = Hernandez,2,237,max,1
4618,Can you identify the shortest call received on the phone that received a call on 18/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 18/08/2017
Can you identify the shortest call received on the phone that received a call on 18/08/2017?",Can you identify the shortest call received on the phone that received a call on [x2.PhoneCall.call_date:18/08/2017]?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,76,min,1
4615,What's the least lengthy call received on the phone that had a call on 08/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""08/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 08/08/2017
What's the least lengthy call received on the phone that had a call on 08/08/2017?",What's the least lengthy call received on the phone that had a call on [x2.PhoneCall.call_date:08/08/2017]?,x2.PhoneCall.call_date:08/08/2017 = 08/08/2017,3,76,min,1
2968,Can you provide the emails of those connected to the Woods by family?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
Can you provide the emails of those connected to the Woods by family?",Can you provide the emails of those connected to the [x2.Person.surname:Woods] by family?,x2.Person.surname:Woods = Woods,3,430,entity_set,2
539,In how many crimes were Kia vehicles involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Kia"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Kia
In how many crimes were Kia vehicles involved?",In how many crimes were [x1.Vehicle.make:Kia] vehicles involved?,x1.Vehicle.make:Kia = Kia,2,70,count,1
4526,How many officers looked into crimes involving a person?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many officers looked into crimes involving a person?,How many officers looked into crimes involving a person?,,3,50,count,1
1081,How many crimes on 2/08/2017 involved Suzuki vehicles?,"MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Suzuki"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Suzuki
How many crimes on 2/08/2017 involved Suzuki vehicles?",How many crimes on [x0.Crime.date:2/08/2017] involved [x1.Vehicle.make:Suzuki] vehicles?,"x0.Crime.date:2/08/2017 = 2/08/2017
x1.Vehicle.make:Suzuki = Suzuki",2,143,count,1
3137,How many can provide the phone number of a person surnamed Lee with the email address rlee56@ifeng.com?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Lee"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""rlee56@ifeng.com"")
RETURN COUNT(DISTINCT x0)","[Person] = Lee
[Email] = rlee56@ifeng.com
How many can provide the phone number of a person surnamed Lee with the email address rlee56@ifeng.com?",How many can provide the phone number of a person surnamed [x1.Person.surname:Lee] with the email address [x2.Email.email_address:rlee56@ifeng.com]?,"x1.Person.surname:Lee = Lee
x2.Email.email_address:rlee56@ifeng.com = rlee56@ifeng.com",3,12,count,1
1577,What crimes happened at locations with the postcode M4 6EW?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M4 6EW"")
RETURN x0","[Location] = M4 6EW
What crimes happened at locations with the postcode M4 6EW?",What crimes happened at locations with the postcode [x1.Location.postcode:M4 6EW]?,x1.Location.postcode:M4 6EW = M4 6EW,2,209,entity_set,2
