id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2513,What locations are within the OL1 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL1"")
RETURN x0","[Area] = OL1
What locations are within the OL1 area code?",What locations are within the [x1.Area.areaCode:OL1] area code?,x1.Area.areaCode:OL1 = OL1,2,351,entity_set,182
25,How many locations with the postcode M9 7EB saw criminal activity?,"MATCH (x0:Location WHERE x0.postcode = ""M9 7EB"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = M9 7EB
How many locations with the postcode M9 7EB saw criminal activity?",How many locations with the postcode [x0.Location.postcode:M9 7EB] saw criminal activity?,x0.Location.postcode:M9 7EB = M9 7EB,2,3,count,1
847,What crimes have involved Kia vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Kia"")
RETURN x0","[Vehicle] = Kia
What crimes have involved Kia vehicles?",What crimes have involved [x1.Vehicle.make:Kia] vehicles?,x1.Vehicle.make:Kia = Kia,2,112,entity_set,17
2601,What is the first date a crime was investigated by an officer with the surname Slavin?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Slavin"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Slavin
What is the first date a crime was investigated by an officer with the surname Slavin?",What is the first date a crime was investigated by an officer with the surname [x1.Officer.surname:Slavin]?,x1.Officer.surname:Slavin = Slavin,2,367,argmin,1
3086,Can you identify the vehicles tied to crimes involving persons with NHS number 879-22-8665?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""879-22-8665"")
RETURN x0","[Person] = 879-22-8665
Can you identify the vehicles tied to crimes involving persons with NHS number 879-22-8665?",Can you identify the vehicles tied to crimes involving persons with NHS number [x2.Person.nhs_no:879-22-8665]?,x2.Person.nhs_no:879-22-8665 = 879-22-8665,3,6,entity_set,1
2143,"On 11/08/2017, how many phones were contacted?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""11/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11/08/2017
On 11/08/2017, how many phones were contacted?","On [x1.PhoneCall.call_date:11/08/2017], how many phones were contacted?",x1.PhoneCall.call_date:11/08/2017 = 11/08/2017,2,289,count,1
3671,What are the NHS numbers of individuals linked to someone living in the OL12 6TA postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL12 6TA"")
RETURN x0.nhs_no","[Location] = OL12 6TA
What are the NHS numbers of individuals linked to someone living in the OL12 6TA postcode?",What are the NHS numbers of individuals linked to someone living in the [x2.Location.postcode:OL12 6TA] postcode?,x2.Location.postcode:OL12 6TA = OL12 6TA,3,172,attribute_set,2
901,"What crimes occurred at 194 Beresford Street on August 24, 2017?","MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""194 Beresford Street"")
RETURN x0","[Crime] = 24/08/2017
[Location] = 194 Beresford Street
What crimes occurred at 194 Beresford Street on August 24, 2017?",What crimes occurred at [x1.Location.address:194 Beresford Street] on [x0.Crime.date:24/08/2017]?,"x0.Crime.date:24/08/2017 = August 24, 2017 
x1.Location.address:194 Beresford Street = 194 Beresford Street",2,118,entity_set,1
2550,Can you name everyone with familial connections?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)
RETURN x0",Can you name everyone with familial connections?,Can you name everyone with familial connections?,,2,356,entity_set,310
3293,Can you identify the most recent vehicle crime at M16 7FH?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M16 7FH"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = M16 7FH
Can you identify the most recent vehicle crime at M16 7FH?",Can you identify the most recent vehicle crime at [x1.Location.postcode:M16 7FH]?,x1.Location.postcode:M16 7FH = M16 7FH,3,37,max,1
2021,What are the post codes in the M41 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M41"")
RETURN x0","[Area] = M41
What are the post codes in the M41 area?",What are the post codes in the [x1.Area.areaCode:M41] area?,x1.Area.areaCode:M41 = M41,2,272,entity_set,154
809,How many individuals participated in crimes on 17th August 2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 17/08/2017
How many individuals participated in crimes on 17th August 2017?",How many individuals participated in crimes on [x1.Crime.date:17/08/2017]?,x1.Crime.date:17/08/2017 = 17th August 2017,2,108,count,1
2226,Can you show the calls to 8-(342)691-8174 from 14/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""14/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(342)691-8174"")
RETURN x0","[PhoneCall] = 14/08/2017
[Phone] = 8-(342)691-8174
Can you show the calls to 8-(342)691-8174 from 14/08/2017?",Can you show the calls to [x1.Phone.phoneNo:8-(342)691-8174] from [x0.PhoneCall.call_date:14/08/2017]?,"x0.PhoneCall.call_date:14/08/2017 = 14/08/2017
x1.Phone.phoneNo:8-(342)691-8174 = 8-(342)691-8174",2,300,entity_set,1
2762,"How many emails does Christopher, related to a Murray, have?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Christopher"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Murray
How many emails does Christopher, related to a Murray, have?","How many emails does [x1.Person.name:Christopher], related to a [x2.Person.surname:Murray], have?","x1.Person.name:Christopher = Christopher
x2.Person.surname:Murray = Murray",3,400,count,1
2444,How many places are in the M12 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M12"")
RETURN COUNT(DISTINCT x0)","[Area] = M12
How many places are in the M12 area code?",How many places are in the [x1.Area.areaCode:M12] area code?,x1.Area.areaCode:M12 = M12,2,337,count,1
550,How many individuals named Louis reside at 161 Eldon Road?,"MATCH (x0:Person WHERE x0.name = ""Louis"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""161 Eldon Road"")
RETURN COUNT(DISTINCT x0)","[Person] = Louis
[Location] = 161 Eldon Road
How many individuals named Louis reside at 161 Eldon Road?",How many individuals named [x0.Person.name:Louis] reside at [x1.Location.address:161 Eldon Road]?,"x0.Person.name:Louis = Louis
x1.Location.address:161 Eldon Road = 161 Eldon Road",2,71,count,1
1633,Can you identify areas with locations that have the post code SK5 7EH?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""SK5 7EH"")
RETURN x0","[Location] = SK5 7EH
Can you identify areas with locations that have the post code SK5 7EH?",Can you identify areas with locations that have the post code [x1.Location.postcode:SK5 7EH]?,x1.Location.postcode:SK5 7EH = SK5 7EH,2,215,entity_set,1
2560,What is the earliest incident involving a Coupe GT and an individual with the last name Black?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Black"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Coupe GT"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Black
[Vehicle] = Coupe GT
What is the earliest incident involving a Coupe GT and an individual with the last name Black?",What is the earliest incident involving a [x1.Vehicle.model:Coupe GT] and an individual with the last name [x2.Person.surname:Black]?,"x1.Vehicle.model:Coupe GT = Coupe GT
x2.Person.surname:Black = Black",3,358,min,1
3178,Which officer ranks were involved in investigating Grand Prix model vehicle crimes?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Grand Prix"")
RETURN x0.rank","[Vehicle] = Grand Prix
Which officer ranks were involved in investigating Grand Prix model vehicle crimes?",Which officer ranks were involved in investigating [x2.Vehicle.model:Grand Prix] model vehicle crimes?,x2.Vehicle.model:Grand Prix = Grand Prix,3,19,attribute_set,7
3372,When did the first crime happen that Officer Fley investigated at 128 Nameplate Close?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Fley"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""128 Nameplate Close"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Fley
[Location] = 128 Nameplate Close
When did the first crime happen that Officer Fley investigated at 128 Nameplate Close?",When did the first crime happen that Officer [x1.Officer.surname:Fley] investigated at [x2.Location.address:128 Nameplate Close]?,"x1.Officer.surname:Fley = Fley
x2.Location.address:128 Nameplate Close = 128 Nameplate Close",3,48,argmin,1
1107,Which areas with the postcode M8 5UU have experienced burglary offenses?,"MATCH (x0:Location WHERE x0.postcode = ""M8 5UU"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Burglary"")
RETURN x0","[Location] = M8 5UU
[Crime] = Burglary
Which areas with the postcode M8 5UU have experienced burglary offenses?",Which areas with the postcode [x0.Location.postcode:M8 5UU] have experienced [x1.Crime.type:Burglary] offenses?,"x0.Location.postcode:M8 5UU = M8 5UU
x1.Crime.type:Burglary = burglary",2,146,entity_set,1
2101,Which calls to 9-(016)868-6919 were exactly 10 seconds long?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""10"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(016)868-6919"")
RETURN x0","[PhoneCall] = 10
[Phone] = 9-(016)868-6919
Which calls to 9-(016)868-6919 were exactly 10 seconds long?",Which calls to [x1.Phone.phoneNo:9-(016)868-6919] were exactly [x0.PhoneCall.call_duration:10] seconds long?,"x0.PhoneCall.call_duration:10 = 10
x1.Phone.phoneNo:9-(016)868-6919 = 9-(016)868-6919",2,283,entity_set,2
1648,Which calls to 5-(210)690-9847 were exactly 45 seconds long?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""45"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(210)690-9847"")
RETURN x0","[PhoneCall] = 45
[Phone] = 5-(210)690-9847
Which calls to 5-(210)690-9847 were exactly 45 seconds long?",Which calls to [x1.Phone.phoneNo:5-(210)690-9847] were exactly [x0.PhoneCall.call_duration:45] seconds long?,"x0.PhoneCall.call_duration:45 = 45
x1.Phone.phoneNo:5-(210)690-9847 = 5-(210)690-9847",2,217,entity_set,2
3237,Who are the individuals residing with others who possess an email?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:HAS_EMAIL]-(x2:Email)
RETURN x0.name",Who are the individuals residing with others who possess an email?,Who are the individuals residing with others who possess an email?,,3,28,attribute_set,153
420,Which residences belong to individuals with the surname Hughes in the SK3 8NA postcode?,"MATCH (x0:Location WHERE x0.postcode = ""SK3 8NA"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN x0","[Location] = SK3 8NA
[Person] = Hughes
Which residences belong to individuals with the surname Hughes in the SK3 8NA postcode?",Which residences belong to individuals with the surname [x1.Person.surname:Hughes] in the [x0.Location.postcode:SK3 8NA] postcode?,"x0.Location.postcode:SK3 8NA = SK3 8NA
x1.Person.surname:Hughes = Hughes",2,55,entity_set,1
3437,How long was the longest call Janice received?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Janice"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Janice
How long was the longest call Janice received?",How long was the longest call [x2.Person.name:Janice] received?,x2.Person.name:Janice = Janice,3,66,argmax,1
810,What was the count of people engaged in criminal activities on 17/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 17/08/2017
What was the count of people engaged in criminal activities on 17/08/2017?",What was the count of people engaged in criminal activities on [x1.Crime.date:17/08/2017]?,x1.Crime.date:17/08/2017 = 17/08/2017,2,108,count,1
2340,How many vehicle-related offenses are handled by officers with surname Micklem?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Micklem"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Officer] = Micklem
How many vehicle-related offenses are handled by officers with surname Micklem?",How many [x0.Crime.type:Vehicle crime] are handled by officers with surname [x1.Officer.surname:Micklem]?,"x0.Crime.type:Vehicle crime = vehicle-related offenses 
x1.Officer.surname:Micklem = Micklem",2,318,count,1
697,Who are the individuals acquainted with anyone with surname Hansen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Hansen"")
RETURN x0.name","[Person] = Hansen
Who are the individuals acquainted with anyone with surname Hansen?",Who are the individuals acquainted with anyone with surname [x1.Person.surname:Hansen]?,x1.Person.surname:Hansen = Hansen,2,92,attribute_set,6
3680,Which Volkswagen car models are linked to crimes investigated by officer with badge 13-4982566?,"MATCH (x0:Vehicle WHERE x0.make = ""Volkswagen"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""13-4982566"")
RETURN x0.model","[Vehicle] = Volkswagen
[Officer] = 13-4982566
Which Volkswagen car models are linked to crimes investigated by officer with badge 13-4982566?",Which [x0.Vehicle.make:Volkswagen] car models are linked to crimes investigated by officer with badge [x2.Officer.badge_no:13-4982566]?,"x0.Vehicle.make:Volkswagen = Volkswagen
x2.Officer.badge_no:13-4982566 = 13-4982566",3,176,attribute_set,1
1848,What is the number of locations with the postcode BL1 3LB that had crimes of violence and sexual offence?,"MATCH (x0:Location WHERE x0.postcode = ""BL1 3LB"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = BL1 3LB
[Crime] = Violence and sexual offences
What is the number of locations with the postcode BL1 3LB that had crimes of violence and sexual offence?",What is the number of locations with the postcode [x0.Location.postcode:BL1 3LB] that had crimes of [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:BL1 3LB = BL1 3LB
x1.Crime.type:Violence and sexual offences = violence and sexual offence",2,246,count,1
4630,What's the earliest offense linked to someone familiar with Melissa's contact number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Melissa"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Melissa
What's the earliest offense linked to someone familiar with Melissa's contact number?",What's the earliest offense linked to someone familiar with [x2.Person.name:Melissa]'s contact number?,x2.Person.name:Melissa = Melissa,3,89,min,1
2857,"How many cases marked as ""Investigation complete; no suspect"" involve relatives of a Martinez?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Martinez
How many cases marked as ""Investigation complete; no suspect"" involve relatives of a Martinez?","How many cases marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involve relatives of a [x2.Person.surname:Martinez]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect 
x2.Person.surname:Martinez = Martinez",3,415,count,1
262,How many crimes on 28/08/2017 involved vehicles of the Esprit model?,"MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Esprit"")
RETURN COUNT(DISTINCT x0)","[Crime] = 28/08/2017
[Vehicle] = Esprit
How many crimes on 28/08/2017 involved vehicles of the Esprit model?",How many crimes on [x0.Crime.date:28/08/2017] involved vehicles of the [x1.Vehicle.model:Esprit] model?,"x0.Crime.date:28/08/2017 = 28/08/2017
x1.Vehicle.model:Esprit = Esprit",2,32,count,1
1441,"How many crimes on August 13, 2017, are being looked into by officers with badge number 81-9146789?","MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""81-9146789"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
[Officer] = 81-9146789
How many crimes on August 13, 2017, are being looked into by officers with badge number 81-9146789?","How many crimes on [x0.Crime.date:13/08/2017], are being looked into by officers with badge number [x1.Officer.badge_no:81-9146789]?","x0.Crime.date:13/08/2017 = August 13, 2017 
x1.Officer.badge_no:81-9146789 = 81-9146789",2,190,count,1
1640,When was the most recent crime at 188 Hathaway Gardens investigated by an officer with last name Gronow?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Gronow"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""188 Hathaway Gardens"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = Gronow
[Location] = 188 Hathaway Gardens
When was the most recent crime at 188 Hathaway Gardens investigated by an officer with last name Gronow?",When was the most recent crime at [x1.Location.address:188 Hathaway Gardens] investigated by an officer with last name [x2.Officer.surname:Gronow]?,"x1.Location.address:188 Hathaway Gardens = 188 Hathaway Gardens
x2.Officer.surname:Gronow = Gronow",3,216,argmax,1
1275,How many people called Harold are friends with a person with surname Hernandez?,"MATCH (x0:Person WHERE x0.name = ""Harold"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN COUNT(DISTINCT x0)","[Person] = Harold
[Person] = Hernandez
How many people called Harold are friends with a person with surname Hernandez?",How many people called [x0.Person.name:Harold] are friends with a person with surname [x1.Person.surname:Hernandez]?,"x0.Person.name:Harold = Harold
x1.Person.surname:Hernandez = Hernandez",2,169,count,1
1895,"What is the count of 1992 vehicles linked to crimes on August 10, 2017?","MATCH (x0:Vehicle WHERE x0.year = ""1992"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1992
[Crime] = 10/08/2017
What is the count of 1992 vehicles linked to crimes on August 10, 2017?",What is the count of [x0.Vehicle.year:1992] vehicles linked to crimes on [x1.Crime.date:10/08/2017]?,"x0.Vehicle.year:1992 = 1992
x1.Crime.date:10/08/2017 = August 10, 2017",2,253,count,1
2160,What is the count of personal theft cases handled by officers with badge ID 74-2393363?,"MATCH (x0:Crime WHERE x0.type = ""Theft from the person"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-2393363"")
RETURN COUNT(DISTINCT x0)","[Crime] = Theft from the person
[Officer] = 74-2393363
What is the count of personal theft cases handled by officers with badge ID 74-2393363?",What is the count of [x0.Crime.type:Theft from the person] handled by officers with badge ID [x1.Officer.badge_no:74-2393363]?,"x0.Crime.type:Theft from the person = personal theft cases 
x1.Officer.badge_no:74-2393363 = 74-2393363",2,292,count,1
3058,How many homes belong to people who are friends with someone else?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many homes belong to people who are friends with someone else?,How many homes belong to people who are friends with someone else?,,3,2,count,1
958,"Who are the officers who investigated crimes on August 16, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Crime] = 16/08/2017
Who are the officers who investigated crimes on August 16, 2017?",Who are the officers who investigated crimes on [x1.Crime.date:16/08/2017]?,"x1.Crime.date:16/08/2017 = August 16, 2017",2,125,entity_set,918
2774,What was the most recent crime involving a resident of 54 Barton Street?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""54 Barton Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 54 Barton Street
What was the most recent crime involving a resident of 54 Barton Street?",What was the most recent crime involving a resident of [x2.Location.address:54 Barton Street]?,x2.Location.address:54 Barton Street = 54 Barton Street,3,402,max,1
929,What number of crimes on 23rd August 2017 included a vehicle?,"MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
What number of crimes on 23rd August 2017 included a vehicle?",What number of crimes on [x0.Crime.date:23/08/2017] included a vehicle?,x0.Crime.date:23/08/2017 = 23rd August 2017,2,121,count,1
1010,Which Chief Inspectors have looked into vehicle-related offenses?,"MATCH (x0:Officer WHERE x0.rank = ""Chief Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Chief Inspector
[Crime] = Vehicle crime
Which Chief Inspectors have looked into vehicle-related offenses?",Which [x0.Officer.rank:Chief Inspector] have looked into [x1.Crime.type:Vehicle crime]?,"x0.Officer.rank:Chief Inspector = Chief Inspectors
x1.Crime.type:Vehicle crime = vehicle-related offenses",2,133,entity_set,227
4420,In which address does the person with the phone number 9-(726)948-9585 live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(726)948-9585"")
RETURN x0.address","[Phone] = 9-(726)948-9585
In which address does the person with the phone number 9-(726)948-9585 live?",In which address does the person with the phone number [x2.Phone.phoneNo:9-(726)948-9585] live?,x2.Phone.phoneNo:9-(726)948-9585 = 9-(726)948-9585,3,16,attribute_set,1
2842,What was the latest offense associated to someone with the number 1-(111)459-3206?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 1-(111)459-3206
What was the latest offense associated to someone with the number 1-(111)459-3206?",What was the latest offense associated to someone with the number [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,414,max,1
1815,How many offenses involving drugs include people with the surname Powell?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Powell
How many offenses involving drugs include people with the surname Powell?",How many offenses involving [x0.Crime.type:Drugs] include people with the surname [x1.Person.surname:Powell]?,"x0.Crime.type:Drugs = drugs
x1.Person.surname:Powell = Powell",2,241,count,1
2063,Who are the individuals acquainted with someone surnamed Moreno?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Moreno"")
RETURN x0","[Person] = Moreno
Who are the individuals acquainted with someone surnamed Moreno?",Who are the individuals acquainted with someone surnamed [x1.Person.surname:Moreno]?,x1.Person.surname:Moreno = Moreno,2,277,entity_set,13
154,Can you identify the crimes from 3/08/2017 being looked into by Officer Porty?,"MATCH (x0:Crime WHERE x0.date = ""3/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Porty"")
RETURN x0","[Crime] = 3/08/2017
[Officer] = Porty
Can you identify the crimes from 3/08/2017 being looked into by Officer Porty?",Can you identify the crimes from [x0.Crime.date:3/08/2017] being looked into by Officer [x1.Officer.name:Porty]?,"x0.Crime.date:3/08/2017 = 3/08/2017
x1.Officer.name:Porty = Porty",2,18,entity_set,4
2702,What was the initial crime involving a person at 183 Oakleigh Avenue?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Oakleigh Avenue"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 183 Oakleigh Avenue
What was the initial crime involving a person at 183 Oakleigh Avenue?",What was the initial crime involving a person at [x1.Location.address:183 Oakleigh Avenue]?,x1.Location.address:183 Oakleigh Avenue = 183 Oakleigh Avenue,3,391,min,1
3154,Can you provide the NHS numbers for people named Rose who have friends with roommates?,"MATCH (x0:Person WHERE x0.name = ""Rose"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Rose
Can you provide the NHS numbers for people named Rose who have friends with roommates?",Can you provide the NHS numbers for people named [x0.Person.name:Rose] who have friends with roommates?,x0.Person.name:Rose = Rose,3,15,attribute_set,1
1016,"On 02/08/2017, how many phones were used to make calls?","MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""02/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 02/08/2017
On 02/08/2017, how many phones were used to make calls?","On [x1.PhoneCall.call_date:02/08/2017], how many phones were used to make calls?",x1.PhoneCall.call_date:02/08/2017 = 02/08/2017,2,134,count,1
787,What is the oldest vehicle linked to a crime with the status 'Investigation complete; no suspect identified' involving someone with last name Williamson?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Williamson"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Williamson
What is the oldest vehicle linked to a crime with the status 'Investigation complete; no suspect identified' involving someone with last name Williamson?",What is the oldest vehicle linked to a crime with the status '[x1.Crime.last_outcome:Investigation complete; no suspect identified]' involving someone with last name [x2.Person.surname:Williamson]?,"x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.surname:Williamson = Williamson",3,103,max,1
4614,Which phone call was the quickest received on the device that had a call on 08/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""08/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 08/08/2017
Which phone call was the quickest received on the device that had a call on 08/08/2017?",Which phone call was the quickest received on the device that had a call on [x2.PhoneCall.call_date:08/08/2017]?,x2.PhoneCall.call_date:08/08/2017 = 08/08/2017,3,76,min,1
251,What are the addresses of individuals with the surname Webb?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Webb"")
RETURN x0","[Person] = Webb
What are the addresses of individuals with the surname Webb?",What are the addresses of individuals with the surname [x1.Person.surname:Webb]?,x1.Person.surname:Webb = Webb,2,31,entity_set,1
3128,How long were the calls on 29/08/2017 to phones that made calls on 20/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""20/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 29/08/2017
[PhoneCall] = 20/08/2017
How long were the calls on 29/08/2017 to phones that made calls on 20/08/2017?",How long were the calls on [x0.PhoneCall.call_date:29/08/2017] to phones that made calls on [x2.PhoneCall.call_date:20/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = 29/08/2017
x2.PhoneCall.call_date:20/08/2017 = 20/08/2017",3,11,attribute_set,2
3006,How many Chevrolet cars were linked to crimes on 26/08/2017 in locations with the BL4 9HJ postcode?,"MATCH (x0:Vehicle WHERE x0.make = ""Chevrolet"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL4 9HJ"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Chevrolet
[Crime] = 26/08/2017
[Location] = BL4 9HJ
How many Chevrolet cars were linked to crimes on 26/08/2017 in locations with the BL4 9HJ postcode?",How many [x0.Vehicle.make:Chevrolet] cars were linked to crimes on [x1.Crime.date:26/08/2017] in locations with the [x2.Location.postcode:BL4 9HJ] postcode?,"x0.Vehicle.make:Chevrolet = Chevrolet
x1.Crime.date:26/08/2017 = 26/08/2017
x2.Location.postcode:BL4 9HJ = BL4 9HJ",3,436,count,1
661,Who are the friends of individuals with the last name Martin?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Martin"")
RETURN x0","[Person] = Martin
Who are the friends of individuals with the last name Martin?",Who are the friends of individuals with the last name [x1.Person.surname:Martin]?,x1.Person.surname:Martin = Martin,2,88,entity_set,3
4461,"How is the investigation of the earliest crime going, where the suspect has the phone number of the person with NHS number 383-09-0127?","MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""383-09-0127"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 383-09-0127
How is the investigation of the earliest crime going, where the suspect has the phone number of the person with NHS number 383-09-0127?","How is the investigation of the earliest crime going, where the suspect has the phone number of the person with NHS number [x2.Person.nhs_no:383-09-0127]?",x2.Person.nhs_no:383-09-0127 = 383-09-0127,3,32,argmin,1
1008,Can you name the Inspectors involved in burglary crime investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Burglary"")
RETURN x0","[Officer] = Inspector
[Crime] = Burglary
Can you name the Inspectors involved in burglary crime investigations?",Can you name the [x0.Officer.rank:Inspector] involved in [x1.Crime.type:Burglary] crime investigations?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.type:Burglary = burglary",2,133,entity_set,609
3088,Which vehicles are associated with offenses connected to people holding NHS number 337-28-4424?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""337-28-4424"")
RETURN x0","[Person] = 337-28-4424
Which vehicles are associated with offenses connected to people holding NHS number 337-28-4424?",Which vehicles are associated with offenses connected to people holding NHS number [x2.Person.nhs_no:337-28-4424]?,x2.Person.nhs_no:337-28-4424 = 337-28-4424,3,6,entity_set,5
3666,What are the last names of those who know the phone number of a person living with Harry?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Harry"")
RETURN x0.surname","[Person] = Harry
What are the last names of those who know the phone number of a person living with Harry?",What are the last names of those who know the phone number of a person living with [x2.Person.name:Harry]?,x2.Person.name:Harry = Harry,3,166,attribute_set,4
2184,What is the number of Maserati cars tied to criminal activities?,"MATCH (x0:Vehicle WHERE x0.make = ""Maserati"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Maserati
What is the number of Maserati cars tied to criminal activities?",What is the number of [x0.Vehicle.make:Maserati] cars tied to criminal activities?,x0.Vehicle.make:Maserati = Maserati,2,295,count,1
2069,How many vehicle crimes involved Acura cars?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Acura"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Acura
How many vehicle crimes involved Acura cars?",How many [x0.Crime.type:Vehicle crime] involved [x1.Vehicle.make:Acura] cars?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Acura = Acura",2,278,count,1
