id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2916,What was the initial crime at 103 Bollin Walk involving a Mustang vehicle?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""103 Bollin Walk"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Mustang"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 103 Bollin Walk
[Vehicle] = Mustang
What was the initial crime at 103 Bollin Walk involving a Mustang vehicle?",What was the initial crime at [x2.Location.address:103 Bollin Walk] involving a [x1.Vehicle.model:Mustang] vehicle?,"x1.Vehicle.model:Mustang = Mustang
x2.Location.address:103 Bollin Walk = 103 Bollin Walk",3,422,min,1
3667,Can you provide the surnames of individuals who have the phone number of someone sharing a home with Harry?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Harry"")
RETURN x0.surname","[Person] = Harry
Can you provide the surnames of individuals who have the phone number of someone sharing a home with Harry?",Can you provide the surnames of individuals who have the phone number of someone sharing a home with [x2.Person.name:Harry]?,x2.Person.name:Harry = Harry,3,166,attribute_set,4
1465,What are the phones for people whose last name is Kelly?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0","[Person] = Kelly
What are the phones for people whose last name is Kelly?",What are the phones for people whose last name is [x1.Person.surname:Kelly]?,x1.Person.surname:Kelly = Kelly,2,193,entity_set,3
1352,"On 17/08/2017, how many phones from individuals with the surname Boyd were used to make calls?","MATCH (x0:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""17/08/2017"")
MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 17/08/2017
[Person] = Boyd
On 17/08/2017, how many phones from individuals with the surname Boyd were used to make calls?","On [x2.PhoneCall.call_date:17/08/2017], how many phones from individuals with the surname [x1.Person.surname:Boyd] were used to make calls?","x1.Person.surname:Boyd = Boyd
x2.PhoneCall.call_date:17/08/2017 = 17/08/2017",3,178,count,1
4443,How many people are connected to a crime and know a person with surname Williamson?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Williamson"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Williamson
How many people are connected to a crime and know a person with surname Williamson?",How many people are connected to a crime and know a person with surname [x2.Person.surname:Williamson]?,x2.Person.surname:Williamson = Williamson,3,25,count,1
123,Can you name everyone residing with Lillian?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Lillian"")
RETURN x0","[Person] = Lillian
Can you name everyone residing with Lillian?",Can you name everyone residing with [x1.Person.name:Lillian]?,x1.Person.name:Lillian = Lillian,2,14,entity_set,2
630,What 2007 vehicles were associated with vehicle-related offenses?,"MATCH (x0:Vehicle WHERE x0.year = ""2007"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2007
[Crime] = Vehicle crime
What 2007 vehicles were associated with vehicle-related offenses?",What [x0.Vehicle.year:2007] vehicles were associated with [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2007 = 2007
x1.Crime.type:Vehicle crime = vehicle-related offenses",2,83,entity_set,36
2863,How many investigations by Police Constables involve a person with the surname Peters?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Police Constable"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Person] = Peters
How many investigations by Police Constables involve a person with the surname Peters?",How many investigations by [x2.Officer.rank:Police Constable] involve a person with the surname [x1.Person.surname:Peters]?,"x1.Person.surname:Peters = Peters
x2.Officer.rank:Police Constable = Police Constables",3,416,count,1
2052,What is the count of criminal damage and arson cases at 58 Wellbank Close?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""58 Wellbank Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Location] = 58 Wellbank Close
What is the count of criminal damage and arson cases at 58 Wellbank Close?",What is the count of [x0.Crime.type:Criminal damage and arson] cases at [x1.Location.address:58 Wellbank Close]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Location.address:58 Wellbank Close = 58 Wellbank Close",2,276,count,1
1293,How often did violence and sexual offences occur at any site?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
How often did violence and sexual offences occur at any site?",How often did [x0.Crime.type:Violence and sexual offences] occur at any site?,x0.Crime.type:Violence and sexual offences = violence and sexual offences,2,171,count,1
392,Which Inspectors were involved in crime investigations on 2/08/2017?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""2/08/2017"")
RETURN x0","[Officer] = Inspector
[Crime] = 2/08/2017
Which Inspectors were involved in crime investigations on 2/08/2017?",Which [x0.Officer.rank:Inspector] were involved in crime investigations on [x1.Crime.date:2/08/2017]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.date:2/08/2017 = 2/08/2017",2,52,entity_set,185
1952,How many Accent cars are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.model = ""Accent"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Accent
How many Accent cars are linked to crimes?",How many [x0.Vehicle.model:Accent] cars are linked to crimes?,x0.Vehicle.model:Accent = Accent,2,260,count,1
275,Can you provide a list of crimes at 29 Scoltock Way?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""29 Scoltock Way"")
RETURN x0","[Location] = 29 Scoltock Way
Can you provide a list of crimes at 29 Scoltock Way?",Can you provide a list of crimes at [x1.Location.address:29 Scoltock Way]?,x1.Location.address:29 Scoltock Way = 29 Scoltock Way,2,33,entity_set,4
1160,How many individuals called Harry are familiar with anyone named Irene?,"MATCH (x0:Person WHERE x0.name = ""Harry"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Harry
[Person] = Irene
How many individuals called Harry are familiar with anyone named Irene?",How many individuals called [x0.Person.name:Harry] are familiar with anyone named [x1.Person.name:Irene]?,"x0.Person.name:Harry = Harry
x1.Person.name:Irene = Irene",2,153,count,1
2980,What is the most recent crime linked to friends of those with the last name Weaver?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Weaver"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Weaver
What is the most recent crime linked to friends of those with the last name Weaver?",What is the most recent crime linked to friends of those with the last name [x2.Person.surname:Weaver]?,x2.Person.surname:Weaver = Weaver,3,432,max,1
3633,Can you identify those living with someone who knows a person with the last name Washington?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Washington"")
RETURN x0","[Person] = Washington
Can you identify those living with someone who knows a person with the last name Washington?",Can you identify those living with someone who knows a person with the last name [x2.Person.surname:Washington]?,x2.Person.surname:Washington = Washington,3,151,entity_set,2
148,Which phone call happened first to any phone that made calls on 04/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""04/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 04/08/2017
Which phone call happened first to any phone that made calls on 04/08/2017?",Which phone call happened first to any phone that made calls on [x2.PhoneCall.call_date:04/08/2017]?,x2.PhoneCall.call_date:04/08/2017 = 04/08/2017,3,17,min,1
551,What is the number of people called Louis living at 161 Eldon Road?,"MATCH (x0:Person WHERE x0.name = ""Louis"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""161 Eldon Road"")
RETURN COUNT(DISTINCT x0)","[Person] = Louis
[Location] = 161 Eldon Road
What is the number of people called Louis living at 161 Eldon Road?",What is the number of people called [x0.Person.name:Louis] living at [x1.Location.address:161 Eldon Road]?,"x0.Person.name:Louis = Louis
x1.Location.address:161 Eldon Road = 161 Eldon Road",2,71,count,1
470,Can you provide a list of offenses linked to people with last name Walker?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Walker"")
RETURN x0","[Person] = Walker
Can you provide a list of offenses linked to people with last name Walker?",Can you provide a list of offenses linked to people with last name [x1.Person.surname:Walker]?,x1.Person.surname:Walker = Walker,2,61,entity_set,2
1756,What number of crimes involved vehicles from 2011?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2011"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2011
What number of crimes involved vehicles from 2011?",What number of crimes involved vehicles from [x1.Vehicle.year:2011]?,x1.Vehicle.year:2011 = 2011,2,233,count,1
2688,Can you list the areas where individuals with the surname Gray reside?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
Can you list the areas where individuals with the surname Gray reside?",Can you list the areas where individuals with the surname [x2.Person.surname:Gray] reside?,x2.Person.surname:Gray = Gray,3,389,entity_set,2
1039,How many Stephanies share a home with someone named Mary?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Mary"")
RETURN COUNT(DISTINCT x0)","[Person] = Stephanie
[Person] = Mary
How many Stephanies share a home with someone named Mary?",How many [x0.Person.name:Stephanie] share a home with someone named [x1.Person.name:Mary]?,"x0.Person.name:Stephanie = Stephanies
x1.Person.name:Mary = Mary",2,138,count,1
774,How many devices placed a call at 09:28?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""09:28"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 09:28
How many devices placed a call at 09:28?",How many devices placed a call at [x1.PhoneCall.call_time:09:28]?,x1.PhoneCall.call_time:09:28 = 09:28,2,102,count,1
3669,Can you provide the NHS numbers for people related to a resident of the BL4 7BN postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""BL4 7BN"")
RETURN x0.nhs_no","[Location] = BL4 7BN
Can you provide the NHS numbers for people related to a resident of the BL4 7BN postcode?",Can you provide the NHS numbers for people related to a resident of the [x2.Location.postcode:BL4 7BN] postcode?,x2.Location.postcode:BL4 7BN = BL4 7BN,3,172,attribute_set,2
469,What crimes involve individuals with the surname Walker?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Walker"")
RETURN x0","[Person] = Walker
What crimes involve individuals with the surname Walker?",What crimes involve individuals with the surname [x1.Person.surname:Walker]?,x1.Person.surname:Walker = Walker,2,61,entity_set,2
201,Can you name everyone related to someone called Carl?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Carl"")
RETURN x0","[Person] = Carl
Can you name everyone related to someone called Carl?",Can you name everyone related to someone called [x1.Person.name:Carl]?,x1.Person.name:Carl = Carl,2,24,entity_set,4
451,Which officers investigated crimes marked as Unable to prosecute suspect?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Crime] = Unable to prosecute suspect
Which officers investigated crimes marked as Unable to prosecute suspect?",Which officers investigated crimes marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,59,entity_set,5125
3473,What are the last names of those who have the phone numbers of people connected to someone with NHS number 219-06-7487?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""219-06-7487"")
RETURN x0.surname","[Person] = 219-06-7487
What are the last names of those who have the phone numbers of people connected to someone with NHS number 219-06-7487?",What are the last names of those who have the phone numbers of people connected to someone with NHS number [x2.Person.nhs_no:219-06-7487]?,x2.Person.nhs_no:219-06-7487 = 219-06-7487,3,83,attribute_set,1
4602,Can you provide the phones of people who are friends with Brandon?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brandon"")
RETURN x0","[Person] = Brandon
Can you provide the phones of people who are friends with Brandon?",Can you provide the phones of people who are friends with [x2.Person.name:Brandon]?,x2.Person.name:Brandon = Brandon,3,71,entity_set,7
1099,What is the total number of calls to 7-(434)993-0161?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""7-(434)993-0161"")
RETURN COUNT(DISTINCT x0)","[Phone] = 7-(434)993-0161
What is the total number of calls to 7-(434)993-0161?",What is the total number of calls to [x1.Phone.phoneNo:7-(434)993-0161]?,x1.Phone.phoneNo:7-(434)993-0161 = 7-(434)993-0161,2,145,count,1
3647,How many crimes happened at people's homes?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many crimes happened at people's homes?,How many crimes happened at people's homes?,,3,158,count,1
2418,"What phones placed calls on August 9, 2017?","MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""09/08/2017"")
RETURN x0","[PhoneCall] = 09/08/2017
What phones placed calls on August 9, 2017?",What phones placed calls on [x1.PhoneCall.call_date:09/08/2017]?,"x1.PhoneCall.call_date:09/08/2017 = August 9, 2017",2,333,entity_set,21
1408,How many 88-second calls did the number 0-(521)287-3218 get?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""88"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(521)287-3218"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 88
[Phone] = 0-(521)287-3218
How many 88-second calls did the number 0-(521)287-3218 get?",How many [x0.PhoneCall.call_duration:88]-second calls did the number [x1.Phone.phoneNo:0-(521)287-3218] get?,"x0.PhoneCall.call_duration:88 = 88
x1.Phone.phoneNo:0-(521)287-3218 = 0-(521)287-3218",2,184,count,1
2354,What is the number of vehicles linked to crimes?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",What is the number of vehicles linked to crimes?,What is the number of vehicles linked to crimes?,,2,320,count,1
3453,"What time did someone with last name Edwards get a phone call on August 8, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Edwards"")
RETURN x0.call_time","[PhoneCall] = 08/08/2017
[Person] = Edwards
What time did someone with last name Edwards get a phone call on August 8, 2017?",What time did someone with last name [x2.Person.surname:Edwards] get a phone call on [x0.PhoneCall.call_date:08/08/2017]?,"x0.PhoneCall.call_date:08/08/2017 = August 8, 2017 
x2.Person.surname:Edwards = Edwards",3,77,attribute_set,1
3153,What are the NHS numbers of Roses who have friends living with someone else?,"MATCH (x0:Person WHERE x0.name = ""Rose"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Rose
What are the NHS numbers of Roses who have friends living with someone else?",What are the NHS numbers of [x0.Person.name:Rose] who have friends living with someone else?,x0.Person.name:Rose = Roses,3,15,attribute_set,1
945,What is the total number of calls any phone got on 18/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18/08/2017
What is the total number of calls any phone got on 18/08/2017?",What is the total number of calls any phone got on [x0.PhoneCall.call_date:18/08/2017]?,x0.PhoneCall.call_date:18/08/2017 = 18/08/2017,2,124,count,1
2204,How many crimes marked as Awaiting court outcome are being investigated by Sergeants?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Awaiting court outcome"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN COUNT(DISTINCT x0)","[Crime] = Awaiting court outcome
[Officer] = Sergeant
How many crimes marked as Awaiting court outcome are being investigated by Sergeants?",How many crimes marked as [x0.Crime.last_outcome:Awaiting court outcome] are being investigated by [x1.Officer.rank:Sergeant]?,"x0.Crime.last_outcome:Awaiting court outcome = Awaiting court outcome
x1.Officer.rank:Sergeant = Sergeants",2,298,count,1
2751,Can you provide the emails of individuals familiar with a person whose NHS number is 247-72-6304?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
Can you provide the emails of individuals familiar with a person whose NHS number is 247-72-6304?",Can you provide the emails of individuals familiar with a person whose NHS number is [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,398,entity_set,4
3375,When did the first crime happen that Officer Dumingo investigated at 192 Thelwall Road?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Dumingo"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""192 Thelwall Road"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Dumingo
[Location] = 192 Thelwall Road
When did the first crime happen that Officer Dumingo investigated at 192 Thelwall Road?",When did the first crime happen that Officer [x1.Officer.surname:Dumingo] investigated at [x2.Location.address:192 Thelwall Road]?,"x1.Officer.surname:Dumingo = Dumingo
x2.Location.address:192 Thelwall Road = 192 Thelwall Road",3,48,argmin,1
1656,What's the count of people connected by family to a Perry?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Perry"")
RETURN COUNT(DISTINCT x0)","[Person] = Perry
What's the count of people connected by family to a Perry?",What's the count of people connected by family to a [x1.Person.surname:Perry]?,x1.Person.surname:Perry = Perry,2,218,count,1
2956,What is the most recent date officer 47-5316983 looked into a Safari vehicle crime?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""47-5316983"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Safari"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 47-5316983
[Vehicle] = Safari
What is the most recent date officer 47-5316983 looked into a Safari vehicle crime?",What is the most recent date officer [x2.Officer.badge_no:47-5316983] looked into a [x1.Vehicle.model:Safari] vehicle crime?,"x1.Vehicle.model:Safari = Safari
x2.Officer.badge_no:47-5316983 = 47-5316983",3,429,argmax,1
2886,Which is the oldest vehicle linked to a vehicle crime case handled by a Sergeant?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Vehicle crime
[Officer] = Sergeant
Which is the oldest vehicle linked to a vehicle crime case handled by a Sergeant?",Which is the oldest vehicle linked to a [x1.Crime.type:Vehicle crime] case handled by a [x2.Officer.rank:Sergeant]?,"x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.rank:Sergeant = Sergeant",3,419,max,1
4410,What is the newest car linked to a crime at 35 Back St George's Road North?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""35 Back St George'S Road North"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 35 Back St George'S Road North
What is the newest car linked to a crime at 35 Back St George's Road North?",What is the newest car linked to a crime at [x2.Location.address:35 Back St George'S Road North]?,x2.Location.address:35 Back St George'S Road North = 35 Back St George's Road North,3,12,max,1
1752,How many crimes involved 2002 vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2002"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2002
How many crimes involved 2002 vehicles?",How many crimes involved [x1.Vehicle.year:2002] vehicles?,x1.Vehicle.year:2002 = 2002,2,233,count,1
2134,What is the earliest call for a phone call received by someone with surname Gilbert?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gilbert"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Gilbert
What is the earliest call for a phone call received by someone with surname Gilbert?",What is the earliest call for a phone call received by someone with surname [x2.Person.surname:Gilbert]?,x2.Person.surname:Gilbert = Gilbert,3,288,min,1
1011,Can you name the Chief Inspectors involved in vehicle crime investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Chief Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Chief Inspector
[Crime] = Vehicle crime
Can you name the Chief Inspectors involved in vehicle crime investigations?",Can you name the [x0.Officer.rank:Chief Inspector] involved in [x1.Crime.type:Vehicle crime] investigations?,"x0.Officer.rank:Chief Inspector = Chief Inspectors
x1.Crime.type:Vehicle crime = vehicle crime",2,133,entity_set,227
1529,How many Suburban 2500 vehicles were linked to crimes on 15/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""Suburban 2500"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""15/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Suburban 2500
[Crime] = 15/08/2017
How many Suburban 2500 vehicles were linked to crimes on 15/08/2017?",How many [x0.Vehicle.model:Suburban 2500] vehicles were linked to crimes on [x1.Crime.date:15/08/2017]?,"x0.Vehicle.model:Suburban 2500 = Suburban 2500
x1.Crime.date:15/08/2017 = 15/08/2017",2,203,count,1
4528,How many officers examined crimes that included a person?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many officers examined crimes that included a person?,How many officers examined crimes that included a person?,,3,50,count,1
458,Can you provide the emails of those residing with a Gray family member?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
Can you provide the emails of those residing with a Gray family member?",Can you provide the emails of those residing with a [x2.Person.surname:Gray] family member?,x2.Person.surname:Gray = Gray,3,60,entity_set,2
3287,Can you identify the most recent call to a phone linked to NHS number 456-41-9569?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""456-41-9569"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 456-41-9569
Can you identify the most recent call to a phone linked to NHS number 456-41-9569?",Can you identify the most recent call to a phone linked to NHS number [x2.Person.nhs_no:456-41-9569]?,x2.Person.nhs_no:456-41-9569 = 456-41-9569,3,36,max,1
3123,What are the durations of calls received on 04/08/2017 by phones that also made calls on 30/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""04/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""30/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 04/08/2017
[PhoneCall] = 30/08/2017
What are the durations of calls received on 04/08/2017 by phones that also made calls on 30/08/2017?",What are the durations of calls received on [x0.PhoneCall.call_date:04/08/2017] by phones that also made calls on [x2.PhoneCall.call_date:30/08/2017]?,"x0.PhoneCall.call_date:04/08/2017 = 04/08/2017
x2.PhoneCall.call_date:30/08/2017 = 30/08/2017",3,11,attribute_set,4
4460,What's the status of the first crime involving someone with the phone number of the person whose NHS number is 383-09-0127?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""383-09-0127"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 383-09-0127
What's the status of the first crime involving someone with the phone number of the person whose NHS number is 383-09-0127?",What's the status of the first crime involving someone with the phone number of the person whose NHS number is [x2.Person.nhs_no:383-09-0127]?,x2.Person.nhs_no:383-09-0127 = 383-09-0127,3,32,argmin,1
1677,What is the count of 11-second phone calls to 9-(879)321-8806?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(879)321-8806"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
[Phone] = 9-(879)321-8806
What is the count of 11-second phone calls to 9-(879)321-8806?",What is the count of [x0.PhoneCall.call_duration:11]-second phone calls to [x1.Phone.phoneNo:9-(879)321-8806]?,"x0.PhoneCall.call_duration:11 = 11
x1.Phone.phoneNo:9-(879)321-8806 = 9-(879)321-8806",2,220,count,1
2502,How many postal codes exist within the WN2 region?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""WN2"")
RETURN COUNT(DISTINCT x0)","[Area] = WN2
How many postal codes exist within the WN2 region?",How many postal codes exist within the [x1.Area.areaCode:WN2] region?,x1.Area.areaCode:WN2 = WN2,2,348,count,1
441,How many emails belong to people whose last name is Nguyen?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN COUNT(DISTINCT x0)","[Person] = Nguyen
How many emails belong to people whose last name is Nguyen?",How many emails belong to people whose last name is [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,58,count,1
2089,How many Inspectors probed crimes classified under Local resolution?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Local resolution"")
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
[Crime] = Local resolution
How many Inspectors probed crimes classified under Local resolution?",How many [x0.Officer.rank:Inspector] probed crimes classified under [x1.Crime.last_outcome:Local resolution]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.last_outcome:Local resolution = Local resolution",2,281,count,1
1826,Who is the youngest person living with someone who knows a Hansen's phone number?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Hansen"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Hansen
Who is the youngest person living with someone who knows a Hansen's phone number?",Who is the youngest person living with someone who knows a [x2.Person.surname:Hansen]'s phone number?,x2.Person.surname:Hansen = Hansen,3,243,min,1
1908,What is the count of individuals named Amanda sharing a home with someone having the NHS number 260-95-0836?,"MATCH (x0:Person WHERE x0.name = ""Amanda"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""260-95-0836"")
RETURN COUNT(DISTINCT x0)","[Person] = Amanda
[Person] = 260-95-0836
What is the count of individuals named Amanda sharing a home with someone having the NHS number 260-95-0836?",What is the count of individuals named [x0.Person.name:Amanda] sharing a home with someone having the NHS number [x1.Person.nhs_no:260-95-0836]?,"x0.Person.name:Amanda = Amanda
x1.Person.nhs_no:260-95-0836 = 260-95-0836",2,254,count,1
4611,Which is the shortest call received on the phone that received a call on 09/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""09/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 09/08/2017
Which is the shortest call received on the phone that received a call on 09/08/2017?",Which is the shortest call received on the phone that received a call on [x2.PhoneCall.call_date:09/08/2017]?,x2.PhoneCall.call_date:09/08/2017 = 09/08/2017,3,76,min,1
864,How many acquaintances does anyone with the last name Hamilton have?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Hamilton"")
RETURN COUNT(DISTINCT x0)","[Person] = Hamilton
How many acquaintances does anyone with the last name Hamilton have?",How many acquaintances does anyone with the last name [x1.Person.surname:Hamilton] have?,x1.Person.surname:Hamilton = Hamilton,2,114,count,1
1418,What is the count of emails linked to individuals named Virginia?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Virginia"")
RETURN COUNT(DISTINCT x0)","[Person] = Virginia
What is the count of emails linked to individuals named Virginia?",What is the count of emails linked to individuals named [x1.Person.name:Virginia]?,x1.Person.name:Virginia = Virginia,2,187,count,1
188,How many 11-second calls were made to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
How many 11-second calls were made to any phone?",How many [x0.PhoneCall.call_duration:11]-second calls were made to any phone?,x0.PhoneCall.call_duration:11 = 11,2,23,count,1
1608,How many devices had a call that lasted 24 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""24"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 24
How many devices had a call that lasted 24 seconds?",How many devices had a call that lasted [x1.PhoneCall.call_duration:24] seconds?,x1.PhoneCall.call_duration:24 = 24,2,212,count,1
2323,Which people named Diana were implicated in crimes on 25th August 2017?,"MATCH (x0:Person WHERE x0.name = ""Diana"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""25/08/2017"")
RETURN x0","[Person] = Diana
[Crime] = 25/08/2017
Which people named Diana were implicated in crimes on 25th August 2017?",Which people named [x0.Person.name:Diana] were implicated in crimes on [x1.Crime.date:25/08/2017]?,"x0.Person.name:Diana = Diana
x1.Crime.date:25/08/2017 = 25th August 2017",2,313,entity_set,1
1347,"What Mazda vehicles were involved in crimes on August 3, 2017?","MATCH (x0:Vehicle WHERE x0.make = ""Mazda"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""3/08/2017"")
RETURN x0","[Vehicle] = Mazda
[Crime] = 3/08/2017
What Mazda vehicles were involved in crimes on August 3, 2017?",What [x0.Vehicle.make:Mazda] vehicles were involved in crimes on [x1.Crime.date:3/08/2017]?,"x0.Vehicle.make:Mazda = Mazda
x1.Crime.date:3/08/2017 = August 3, 2017",2,177,entity_set,1
456,Could you list the emails of individuals who share a home with a Baker?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Baker"")
RETURN x0","[Person] = Baker
Could you list the emails of individuals who share a home with a Baker?",Could you list the emails of individuals who share a home with a [x2.Person.surname:Baker]?,x2.Person.surname:Baker = Baker,3,60,entity_set,3
129,What is the count of emails linked to NHS number 274-72-8781?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""274-72-8781"")
RETURN COUNT(DISTINCT x0)","[Person] = 274-72-8781
What is the count of emails linked to NHS number 274-72-8781?",What is the count of emails linked to NHS number [x1.Person.nhs_no:274-72-8781]?,x1.Person.nhs_no:274-72-8781 = 274-72-8781,2,15,count,1
