id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2232,How many offenses on 14th August 2017 included someone with NHS number 311-75-6483?,"MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""311-75-6483"")
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
[Person] = 311-75-6483
How many offenses on 14th August 2017 included someone with NHS number 311-75-6483?",How many offenses on [x0.Crime.date:14/08/2017] included someone with NHS number [x1.Person.nhs_no:311-75-6483]?,"x0.Crime.date:14/08/2017 = 14th August 2017 
x1.Person.nhs_no:311-75-6483 = 311-75-6483",2,301,count,1
2179,What count of Mazda vehicles are associated with crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Mazda"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Mazda
What count of Mazda vehicles are associated with crimes?",What count of [x0.Vehicle.make:Mazda] vehicles are associated with crimes?,x0.Vehicle.make:Mazda = Mazda,2,295,count,1
3094,How often do crimes involve a Bailey who is friend with Raymond?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Bailey"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Raymond"")
RETURN COUNT(DISTINCT x0)","[Person] = Bailey
[Person] = Raymond
How often do crimes involve a Bailey who is friend with Raymond?",How often do crimes involve a [x1.Person.surname:Bailey] who is friend with [x2.Person.name:Raymond]?,"x1.Person.surname:Bailey = Bailey
x2.Person.name:Raymond = Raymond",3,7,count,1
2233,What is the count of crimes on 14/08/2017 that involved a person with NHS number 311-75-6483?,"MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""311-75-6483"")
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
[Person] = 311-75-6483
What is the count of crimes on 14/08/2017 that involved a person with NHS number 311-75-6483?",What is the count of crimes on [x0.Crime.date:14/08/2017] that involved a person with NHS number [x1.Person.nhs_no:311-75-6483]?,"x0.Crime.date:14/08/2017 = 14/08/2017
x1.Person.nhs_no:311-75-6483 = 311-75-6483",2,301,count,1
3385,What is the newest crime linked to a person who knows the individual with NHS number 329-25-8167?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""329-25-8167"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 329-25-8167
What is the newest crime linked to a person who knows the individual with NHS number 329-25-8167?",What is the newest crime linked to a person who knows the individual with NHS number [x2.Person.nhs_no:329-25-8167]?,x2.Person.nhs_no:329-25-8167 = 329-25-8167,3,49,max,1
1525,How many places with the postcode M9 0RF had crimes on 13/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""M9 0RF"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Location] = M9 0RF
[Crime] = 13/08/2017
How many places with the postcode M9 0RF had crimes on 13/08/2017?",How many places with the postcode [x0.Location.postcode:M9 0RF] had crimes on [x1.Crime.date:13/08/2017]?,"x0.Location.postcode:M9 0RF = M9 0RF
x1.Crime.date:13/08/2017 = 13/08/2017",2,202,count,1
169,Which people have their phone numbers known by anyone with NHS number 780-64-7865?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""780-64-7865"")
RETURN x0","[Person] = 780-64-7865
Which people have their phone numbers known by anyone with NHS number 780-64-7865?",Which people have their phone numbers known by anyone with NHS number [x1.Person.nhs_no:780-64-7865]?,x1.Person.nhs_no:780-64-7865 = 780-64-7865,2,19,entity_set,1
2804,Can you provide the emails of those living at 73 Grindrod Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""73 Grindrod Street"")
RETURN x0","[Location] = 73 Grindrod Street
Can you provide the emails of those living at 73 Grindrod Street?",Can you provide the emails of those living at [x2.Location.address:73 Grindrod Street]?,x2.Location.address:73 Grindrod Street = 73 Grindrod Street,3,408,entity_set,1
3202,What is the count of emails associated with people connected to crimes?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",What is the count of emails associated with people connected to crimes?,What is the count of emails associated with people connected to crimes?,,3,22,count,1
1632,Which areas have locations with the post code SK5 7EH?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""SK5 7EH"")
RETURN x0","[Location] = SK5 7EH
Which areas have locations with the post code SK5 7EH?",Which areas have locations with the post code [x1.Location.postcode:SK5 7EH]?,x1.Location.postcode:SK5 7EH = SK5 7EH,2,215,entity_set,1
2368,Can you identify the areas where crimes occurred on 30th August 2017?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""30/08/2017"")
RETURN x0","[Crime] = 30/08/2017
Can you identify the areas where crimes occurred on 30th August 2017?",Can you identify the areas where crimes occurred on [x2.Crime.date:30/08/2017]?,x2.Crime.date:30/08/2017 = 30th August 2017,3,323,entity_set,871
1992,Can you provide emails of those who know a Mason's phone number?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Mason"")
RETURN x0","[Person] = Mason
Can you provide emails of those who know a Mason's phone number?",Can you provide emails of those who know a [x2.Person.surname:Mason]'s phone number?,x2.Person.surname:Mason = Mason,3,267,entity_set,3
3502,What was the last crime reported at M6 7RB?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M6 7RB"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M6 7RB
What was the last crime reported at M6 7RB?",What was the last crime reported at [x2.PostCode.code:M6 7RB]?,x2.PostCode.code:M6 7RB = M6 7RB,3,103,max,1
2945,Which crimes involving Escalade vehicles occurred at 129 George Street?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Escalade"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 129 George Street
[Vehicle] = Escalade
Which crimes involving Escalade vehicles occurred at 129 George Street?",Which crimes involving [x1.Vehicle.model:Escalade] [x0.Crime.type:Vehicle crime] occurred at [x2.Location.address:129 George Street]?,"x0.Crime.type:Vehicle crime = vehicles
x1.Vehicle.model:Escalade = Escalade
x2.Location.address:129 George Street = 129 George Street",3,428,entity_set,1
3082,Which vehicles are associated with offenses connected to the person holding NHS number 247-72-6304?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
Which vehicles are associated with offenses connected to the person holding NHS number 247-72-6304?",Which vehicles are associated with offenses connected to the person holding NHS number [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,6,entity_set,1
3366,How many drug-related crime spots involved individuals named Jack?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Drugs"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Jack"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Jack
How many drug-related crime spots involved individuals named Jack?",How many [x1.Crime.type:Drugs] spots involved individuals named [x2.Person.name:Jack]?,"x1.Crime.type:Drugs = drug-related crime 
x2.Person.name:Jack = Jack",3,47,count,1
1827,Who is the youngest individual residing with someone familiar with a Hansen's contact number?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Hansen"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Hansen
Who is the youngest individual residing with someone familiar with a Hansen's contact number?",Who is the youngest individual residing with someone familiar with a [x2.Person.surname:Hansen]'s contact number?,x2.Person.surname:Hansen = Hansen,3,243,min,1
904,"What crimes occurred at 36 High Street on August 23, 2017?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""36 High Street"")
RETURN x0","[Crime] = 23/08/2017
[Location] = 36 High Street
What crimes occurred at 36 High Street on August 23, 2017?",What crimes occurred at [x1.Location.address:36 High Street] on [x0.Crime.date:23/08/2017]?,"x0.Crime.date:23/08/2017 = August 23, 2017 
x1.Location.address:36 High Street = 36 High Street",2,118,entity_set,1
593,What's the age of the oldest individual acquainted with the Murphys?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Murphy"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Murphy
What's the age of the oldest individual acquainted with the Murphys?",What's the age of the oldest individual acquainted with the [x1.Person.surname:Murphy]?,x1.Person.surname:Murphy = Murphys,2,78,argmin,1
1474,Which is the oldest vehicle involved in crimes where someone with last name Ward was also involved?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Ward"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Person] = Ward
Which is the oldest vehicle involved in crimes where someone with last name Ward was also involved?",Which is the oldest vehicle involved in crimes where someone with last name [x2.Person.surname:Ward] was also involved?,x2.Person.surname:Ward = Ward,3,196,max,1
1040,What is the count of Stephanies residing with a Mary?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Mary"")
RETURN COUNT(DISTINCT x0)","[Person] = Stephanie
[Person] = Mary
What is the count of Stephanies residing with a Mary?",What is the count of [x0.Person.name:Stephanie] residing with a [x1.Person.name:Mary]?,"x0.Person.name:Stephanie = Stephanies
x1.Person.name:Mary = Mary",2,138,count,1
185,How many Normas have the phone number of someone with the last name Matthews?,"MATCH (x0:Person WHERE x0.name = ""Norma"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Matthews"")
RETURN COUNT(DISTINCT x0)","[Person] = Norma
[Person] = Matthews
How many Normas have the phone number of someone with the last name Matthews?",How many [x0.Person.name:Norma] have the phone number of someone with the last name [x1.Person.surname:Matthews]?,"x0.Person.name:Norma = Normas
x1.Person.surname:Matthews = Matthews",2,22,count,1
1044,How many individuals named Christopher cohabit with those named Amy?,"MATCH (x0:Person WHERE x0.name = ""Christopher"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Amy
How many individuals named Christopher cohabit with those named Amy?",How many individuals named [x0.Person.name:Christopher] cohabit with those named [x1.Person.name:Amy]?,"x0.Person.name:Christopher = Christopher
x1.Person.name:Amy = Amy",2,138,count,1
1820,How many vehicle crimes involve individuals with surname Williamson?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Williamson
How many vehicle crimes involve individuals with surname Williamson?",How many [x0.Crime.type:Vehicle crime] involve individuals with surname [x1.Person.surname:Williamson]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Person.surname:Williamson = Williamson",2,241,count,1
2218,What E-Class models were implicated in crimes on 7/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""E-Class"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN x0","[Vehicle] = E-Class
[Crime] = 7/08/2017
What E-Class models were implicated in crimes on 7/08/2017?",What [x0.Vehicle.model:E-Class] models were implicated in crimes on [x1.Crime.date:7/08/2017]?,"x0.Vehicle.model:E-Class = E-Class
x1.Crime.date:7/08/2017 = 7/08/2017",2,299,entity_set,1
4415,Which is the newest vehicle linked to a crime at 80 Longhurst Road?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""80 Longhurst Road"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 80 Longhurst Road
Which is the newest vehicle linked to a crime at 80 Longhurst Road?",Which is the newest vehicle linked to a crime at [x2.Location.address:80 Longhurst Road]?,x2.Location.address:80 Longhurst Road = 80 Longhurst Road,3,12,max,1
208,How many crimes occurring on 4/08/2017 were looked into by officers?,"MATCH (x0:Crime WHERE x0.date = ""4/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 4/08/2017
How many crimes occurring on 4/08/2017 were looked into by officers?",How many crimes occurring on [x0.Crime.date:4/08/2017] were looked into by officers?,x0.Crime.date:4/08/2017 = 4/08/2017,2,25,count,1
53,Who are all the people known by someone named Judith?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Judith"")
RETURN x0","[Person] = Judith
Who are all the people known by someone named Judith?",Who are all the people known by someone named [x1.Person.name:Judith]?,x1.Person.name:Judith = Judith,2,7,entity_set,7
905,"Can you provide a list of crimes from August 23, 2017, at 36 High Street?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""36 High Street"")
RETURN x0","[Crime] = 23/08/2017
[Location] = 36 High Street
Can you provide a list of crimes from August 23, 2017, at 36 High Street?","Can you provide a list of crimes from [x0.Crime.date:23/08/2017], at [x1.Location.address:36 High Street]?","x0.Crime.date:23/08/2017 = August 23, 2017 
x1.Location.address:36 High Street = 36 High Street",2,118,entity_set,1
944,"On 18/08/2017, how many phone calls did any phone receive?","MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18/08/2017
On 18/08/2017, how many phone calls did any phone receive?","On [x0.PhoneCall.call_date:18/08/2017], how many phone calls did any phone receive?",x0.PhoneCall.call_date:18/08/2017 = 18/08/2017,2,124,count,1
1487,Could you gather emails of people whose surname is Fernandez?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Person] = Fernandez
Could you gather emails of people whose surname is Fernandez?",Could you gather emails of people whose surname is [x1.Person.surname:Fernandez]?,x1.Person.surname:Fernandez = Fernandez,2,198,entity_set,3
3421,What crimes were committed at the residence of Phyllis?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Phyllis"")
RETURN x0","[Person] = Phyllis
What crimes were committed at the residence of Phyllis?",What crimes were committed at the residence of [x2.Person.name:Phyllis]?,x2.Person.name:Phyllis = Phyllis,3,63,entity_set,1
3060,What are the NHS numbers of individuals related to someone named Harry who also shares a residence with another person?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Harry"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Harry
What are the NHS numbers of individuals related to someone named Harry who also shares a residence with another person?",What are the NHS numbers of individuals related to someone named [x1.Person.name:Harry] who also shares a residence with another person?,x1.Person.name:Harry = Harry,3,3,attribute_set,8
1914,Can you identify phones with a 38-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""38"")
RETURN x0","[PhoneCall] = 38
Can you identify phones with a 38-second call?",Can you identify phones with a [x1.PhoneCall.call_duration:38]-second call?,x1.PhoneCall.call_duration:38 = 38,2,255,entity_set,8
2280,"How many crimes with the status ""Investigation complete; no suspect found"" are linked to officer 63-3360135?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""63-3360135"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = 63-3360135
How many crimes with the status ""Investigation complete; no suspect found"" are linked to officer 63-3360135?","How many crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are linked to officer [x1.Officer.badge_no:63-3360135]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect found 
x1.Officer.badge_no:63-3360135 = 63-3360135",2,307,count,1
1998,Which offenses from 7/08/2017 are under investigation by Sergeants?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN x0","[Crime] = 7/08/2017
[Officer] = Sergeant
Which offenses from 7/08/2017 are under investigation by Sergeants?",Which offenses from [x0.Crime.date:7/08/2017] are under investigation by [x1.Officer.rank:Sergeant]?,"x0.Crime.date:7/08/2017 = 7/08/2017
x1.Officer.rank:Sergeant = Sergeants",2,268,entity_set,309
1134,What is the total number of calls received by 3-(687)257-9759 on 23rd August 2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""3-(687)257-9759"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(687)257-9759
What is the total number of calls received by 3-(687)257-9759 on 23rd August 2017?",What is the total number of calls received by [x1.Phone.phoneNo:3-(687)257-9759] on [x0.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:23/08/2017 = 23rd August 2017 
x1.Phone.phoneNo:3-(687)257-9759 = 3-(687)257-9759",2,150,count,1
1589,How many regions include the postcode WA14 1ND?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WA14 1ND"")
RETURN COUNT(DISTINCT x0)","[PostCode] = WA14 1ND
How many regions include the postcode WA14 1ND?",How many regions include the postcode [x1.PostCode.code:WA14 1ND]?,x1.PostCode.code:WA14 1ND = WA14 1ND,2,210,count,1
356,What is the count of crimes associated with people whose surname is Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Murray
What is the count of crimes associated with people whose surname is Murray?",What is the count of crimes associated with people whose surname is [x1.Person.surname:Murray]?,x1.Person.surname:Murray = Murray,2,44,count,1
111,How many individuals named Steven are familiar with anyone with last name Edwards?,"MATCH (x0:Person WHERE x0.name = ""Steven"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Edwards"")
RETURN COUNT(DISTINCT x0)","[Person] = Steven
[Person] = Edwards
How many individuals named Steven are familiar with anyone with last name Edwards?",How many individuals named [x0.Person.name:Steven] are familiar with anyone with last name [x1.Person.surname:Edwards]?,"x0.Person.name:Steven = Steven
x1.Person.surname:Edwards = Edwards",2,13,count,1
1612,What are the crime categories reported at 174 Mill Lane?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""174 Mill Lane"")
RETURN x0.type","[Location] = 174 Mill Lane
What are the crime categories reported at 174 Mill Lane?",What are the crime categories reported at [x1.Location.address:174 Mill Lane]?,x1.Location.address:174 Mill Lane = 174 Mill Lane,2,213,attribute_set,6
3610,"Can you identify the locations in OL11 where crimes occurred and were marked as ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL11"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = OL11
Can you identify the locations in OL11 where crimes occurred and were marked as ""Investigation complete; no suspect identified""?","Can you identify the locations in [x1.Area.areaCode:OL11] where crimes occurred and were marked as ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:OL11 = OL11
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,256
388,What is the most recent crime involving Kizashi model vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Kizashi"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Kizashi
What is the most recent crime involving Kizashi model vehicles?",What is the most recent crime involving [x1.Vehicle.model:Kizashi] model vehicles?,x1.Vehicle.model:Kizashi = Kizashi,2,51,max,1
721,"What are the crime locations with the postcode M9 4NL from August 20, 2017?","MATCH (x0:Location WHERE x0.postcode = ""M9 4NL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Location] = M9 4NL
[Crime] = 20/08/2017
What are the crime locations with the postcode M9 4NL from August 20, 2017?",What are the crime locations with the postcode [x0.Location.postcode:M9 4NL] from [x1.Crime.date:20/08/2017]?,"x0.Location.postcode:M9 4NL = M9 4NL
x1.Crime.date:20/08/2017 = August 20, 2017",2,96,entity_set,1
1105,What are the locations with postcode M8 5UU where burglary crimes have occurred?,"MATCH (x0:Location WHERE x0.postcode = ""M8 5UU"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Burglary"")
RETURN x0","[Location] = M8 5UU
[Crime] = Burglary
What are the locations with postcode M8 5UU where burglary crimes have occurred?",What are the locations with postcode [x0.Location.postcode:M8 5UU] where [x1.Crime.type:Burglary] crimes have occurred?,"x0.Location.postcode:M8 5UU = M8 5UU
x1.Crime.type:Burglary = burglary",2,146,entity_set,1
3684,Which models of Cadillac are connected to cases handled by the officer with badge number 23-4315807?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""23-4315807"")
RETURN x0.model","[Vehicle] = Cadillac
[Officer] = 23-4315807
Which models of Cadillac are connected to cases handled by the officer with badge number 23-4315807?",Which models of [x0.Vehicle.make:Cadillac] are connected to cases handled by the officer with badge number [x2.Officer.badge_no:23-4315807]?,"x0.Vehicle.make:Cadillac = Cadillac
x2.Officer.badge_no:23-4315807 = 23-4315807",3,176,attribute_set,1
680,How many homes belong to a person named Christine?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Christine"")
RETURN COUNT(DISTINCT x0)","[Person] = Christine
How many homes belong to a person named Christine?",How many homes belong to a person named [x1.Person.name:Christine]?,x1.Person.name:Christine = Christine,2,90,count,1
94,What are the ages of people sharing a home with anyone surnamed Jordan?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Jordan"")
RETURN x0.age","[Person] = Jordan
What are the ages of people sharing a home with anyone surnamed Jordan?",What are the ages of people sharing a home with anyone surnamed [x1.Person.surname:Jordan]?,x1.Person.surname:Jordan = Jordan,2,11,attribute_set,1
1128,What is the total number of calls received by 1-(651)511-7559 on 08/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(651)511-7559"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 08/08/2017
[Phone] = 1-(651)511-7559
What is the total number of calls received by 1-(651)511-7559 on 08/08/2017?",What is the total number of calls received by [x1.Phone.phoneNo:1-(651)511-7559] on [x0.PhoneCall.call_date:08/08/2017]?,"x0.PhoneCall.call_date:08/08/2017 = 08/08/2017
x1.Phone.phoneNo:1-(651)511-7559 = 1-(651)511-7559",2,150,count,1
538,How many crimes included Kia vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Kia"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Kia
How many crimes included Kia vehicles?",How many crimes included [x1.Vehicle.make:Kia] vehicles?,x1.Vehicle.make:Kia = Kia,2,70,count,1
1182,Can you identify locations with the postcode M7 1WG linked to crimes still awaiting court results?,"MATCH (x0:Location WHERE x0.postcode = ""M7 1WG"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Awaiting court outcome"")
RETURN x0","[Location] = M7 1WG
[Crime] = Awaiting court outcome
Can you identify locations with the postcode M7 1WG linked to crimes still awaiting court results?",Can you identify locations with the postcode [x0.Location.postcode:M7 1WG] linked to crimes still [x1.Crime.last_outcome:Awaiting court outcome]?,"x0.Location.postcode:M7 1WG = M7 1WG
x1.Crime.last_outcome:Awaiting court outcome = awaiting court results",2,158,entity_set,2
4635,What is the initial crime with a person familiar with Ann's phone number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Ann"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Ann
What is the initial crime with a person familiar with Ann's phone number?",What is the initial crime with a person familiar with [x2.Person.name:Ann]'s phone number?,x2.Person.name:Ann = Ann,3,89,min,1
4422,Can you provide the address for the individual with the phone number 7-(727)924-9245?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""7-(727)924-9245"")
RETURN x0.address","[Phone] = 7-(727)924-9245
Can you provide the address for the individual with the phone number 7-(727)924-9245?",Can you provide the address for the individual with the phone number [x2.Phone.phoneNo:7-(727)924-9245]?,x2.Phone.phoneNo:7-(727)924-9245 = 7-(727)924-9245,3,16,attribute_set,1
1829,Who is the youngest individual living with someone who knows the phone number of a person with last name Edwards?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Edwards"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Edwards
Who is the youngest individual living with someone who knows the phone number of a person with last name Edwards?",Who is the youngest individual living with someone who knows the phone number of a person with last name [x2.Person.surname:Edwards]?,x2.Person.surname:Edwards = Edwards,3,243,min,1
2126,Who are the individuals residing with others?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)
RETURN x0",Who are the individuals residing with others?,Who are the individuals residing with others?,,2,287,entity_set,160
3561,Can you provide the addresses of locations where a crime took place with a person named Annie involved?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Annie"")
RETURN x0.address","[Person] = Annie
Can you provide the addresses of locations where a crime took place with a person named Annie involved?",Can you provide the addresses of locations where a crime took place with a person named [x2.Person.name:Annie] involved?,x2.Person.name:Annie = Annie,3,115,attribute_set,1
4524,What is the date of the first crime at 60 Victoria Avenue investigated by Officer Cawkwell?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Victoria Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cawkwell"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Victoria Avenue
[Officer] = Cawkwell
What is the date of the first crime at 60 Victoria Avenue investigated by Officer Cawkwell?",What is the date of the first crime at [x1.Location.address:60 Victoria Avenue] investigated by Officer [x2.Officer.surname:Cawkwell]?,"x1.Location.address:60 Victoria Avenue = 60 Victoria Avenue
x2.Officer.surname:Cawkwell = Cawkwell",3,48,argmin,1
3365,How many crime scenes involving drugs had people named Jack?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Drugs"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Jack"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Jack
How many crime scenes involving drugs had people named Jack?",How many crime scenes involving [x1.Crime.type:Drugs] had people named [x2.Person.name:Jack]?,"x1.Crime.type:Drugs = drugs
x2.Person.name:Jack = Jack",3,47,count,1
2462,Which is the earliest crime involving an G37 model that was investigated by an officer with last name Thornber?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Thornber"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""G37"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Thornber
[Vehicle] = G37
Which is the earliest crime involving an G37 model that was investigated by an officer with last name Thornber?",Which is the earliest crime involving an [x1.Vehicle.model:G37] model that was investigated by an officer with last name [x2.Officer.surname:Thornber]?,"x1.Vehicle.model:G37 = G37
x2.Officer.surname:Thornber = Thornber",3,341,min,1
2508,How many Inspectors looked into crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
How many Inspectors looked into crimes?",How many [x0.Officer.rank:Inspector] looked into crimes?,x0.Officer.rank:Inspector = Inspectors,2,350,count,1
4569,What is the count of drug offenses linked to the person at 1-(179)787-6778?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(179)787-6778"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Phone] = 1-(179)787-6778
What is the count of drug offenses linked to the person at 1-(179)787-6778?",What is the count of [x0.Crime.type:Drugs] linked to the person at [x2.Phone.phoneNo:1-(179)787-6778]?,"x0.Crime.type:Drugs = drug offenses 
x2.Phone.phoneNo:1-(179)787-6778 = 1-(179)787-6778",3,66,count,1
2455,How many people share a home with someone who has the surname Martinez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Person] = Martinez
How many people share a home with someone who has the surname Martinez?",How many people share a home with someone who has the surname [x1.Person.surname:Martinez]?,x1.Person.surname:Martinez = Martinez,2,338,count,1
1887,Can you identify phones that had a call lasting 34 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""34"")
RETURN x0","[PhoneCall] = 34
Can you identify phones that had a call lasting 34 seconds?",Can you identify phones that had a call lasting [x1.PhoneCall.call_duration:34] seconds?,x1.PhoneCall.call_duration:34 = 34,2,252,entity_set,10
1601,How many phones got a 27-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""27"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 27
How many phones got a 27-second call?",How many phones got a [x1.PhoneCall.call_duration:27]-second call?,x1.PhoneCall.call_duration:27 = 27,2,212,count,1
1894,What phones completed a call of 14 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""14"")
RETURN x0","[PhoneCall] = 14
What phones completed a call of 14 seconds?",What phones completed a call of [x1.PhoneCall.call_duration:14] seconds?,x1.PhoneCall.call_duration:14 = 14,2,252,entity_set,2
586,What are the call times for calls made to the number 1-(060)256-9720?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(060)256-9720"")
RETURN x0.call_time","[Phone] = 1-(060)256-9720
What are the call times for calls made to the number 1-(060)256-9720?",What are the call times for calls made to the number [x1.Phone.phoneNo:1-(060)256-9720]?,x1.Phone.phoneNo:1-(060)256-9720 = 1-(060)256-9720,2,77,attribute_set,2
