id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
447,"Can you name the officers involved in investigations labeled ""Investigation complete; no suspect identified""?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
Can you name the officers involved in investigations labeled ""Investigation complete; no suspect identified""?","Can you name the officers involved in investigations labeled ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?",x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified,2,59,entity_set,17087
1985,Who has emails of people who know someone with last name Woods' phone number?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
Who has emails of people who know someone with last name Woods' phone number?",Who has emails of people who know someone with last name [x2.Person.surname:Woods]' phone number?,x2.Person.surname:Woods = Woods,3,267,entity_set,2
1031,What is the number of residences with the postcode M22 5EZ?,"MATCH (x0:Location WHERE x0.postcode = ""M22 5EZ"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = M22 5EZ
What is the number of residences with the postcode M22 5EZ?",What is the number of residences with the postcode [x0.Location.postcode:M22 5EZ]?,x0.Location.postcode:M22 5EZ = M22 5EZ,2,136,count,1
112,How many people called Steven have connections with someone surnamed Edwards?,"MATCH (x0:Person WHERE x0.name = ""Steven"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Edwards"")
RETURN COUNT(DISTINCT x0)","[Person] = Steven
[Person] = Edwards
How many people called Steven have connections with someone surnamed Edwards?",How many people called [x0.Person.name:Steven] have connections with someone surnamed [x1.Person.surname:Edwards]?,"x0.Person.name:Steven = Steven
x1.Person.surname:Edwards = Edwards",2,13,count,1
1439,How many offenses on 22/08/2017 were looked into by the officer with badge number 74-9647050?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-9647050"")
RETURN COUNT(DISTINCT x0)","[Crime] = 22/08/2017
[Officer] = 74-9647050
How many offenses on 22/08/2017 were looked into by the officer with badge number 74-9647050?",How many offenses on [x0.Crime.date:22/08/2017] were looked into by the officer with badge number [x1.Officer.badge_no:74-9647050]?,"x0.Crime.date:22/08/2017 = 22/08/2017
x1.Officer.badge_no:74-9647050 = 74-9647050",2,190,count,1
2231,"On August 14, 2017, how many crimes involved individuals with NHS number 311-75-6483?","MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""311-75-6483"")
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
[Person] = 311-75-6483
On August 14, 2017, how many crimes involved individuals with NHS number 311-75-6483?","On [x0.Crime.date:14/08/2017], how many crimes involved individuals with NHS number [x1.Person.nhs_no:311-75-6483]?","x0.Crime.date:14/08/2017 = August 14, 2017 
x1.Person.nhs_no:311-75-6483 = 311-75-6483",2,301,count,1
1673,How many 45-second calls were made to 9-(184)752-7135?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""45"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(184)752-7135"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 45
[Phone] = 9-(184)752-7135
How many 45-second calls were made to 9-(184)752-7135?",How many [x0.PhoneCall.call_duration:45]-second calls were made to [x1.Phone.phoneNo:9-(184)752-7135]?,"x0.PhoneCall.call_duration:45 = 45
x1.Phone.phoneNo:9-(184)752-7135 = 9-(184)752-7135",2,220,count,1
1845,What is the count of locations with postcode SK8 2LN that had violent and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""SK8 2LN"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = SK8 2LN
[Crime] = Violence and sexual offences
What is the count of locations with postcode SK8 2LN that had violent and sexual offences?",What is the count of locations with postcode [x0.Location.postcode:SK8 2LN] that had [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:SK8 2LN = SK8 2LN
x1.Crime.type:Violence and sexual offences = violent and sexual offences",2,246,count,1
2202,How many individuals are aware of an Armstrong's phone number?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Armstrong"")
RETURN COUNT(DISTINCT x0)","[Person] = Armstrong
How many individuals are aware of an Armstrong's phone number?",How many individuals are aware of an [x1.Person.surname:Armstrong]'s phone number?,x1.Person.surname:Armstrong = Armstrong,2,297,count,1
3091,How many offenses include a Robertson who is friends with Howard?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robertson"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Howard"")
RETURN COUNT(DISTINCT x0)","[Person] = Robertson
[Person] = Howard
How many offenses include a Robertson who is friends with Howard?",How many offenses include a [x1.Person.surname:Robertson] who is friends with [x2.Person.name:Howard]?,"x1.Person.surname:Robertson = Robertson
x2.Person.name:Howard = Howard",3,7,count,1
2237,"How many offenses on August 23, 2017, involve individuals with NHS number 397-28-4474?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""397-28-4474"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
[Person] = 397-28-4474
How many offenses on August 23, 2017, involve individuals with NHS number 397-28-4474?","How many offenses on [x0.Crime.date:23/08/2017], involve individuals with NHS number [x1.Person.nhs_no:397-28-4474]?","x0.Crime.date:23/08/2017 = August 23, 2017 
x1.Person.nhs_no:397-28-4474 = 397-28-4474",2,301,count,1
21,What is the number of locations with crime incidents with the postcode M7 2GE?,"MATCH (x0:Location WHERE x0.postcode = ""M7 2GE"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = M7 2GE
What is the number of locations with crime incidents with the postcode M7 2GE?",What is the number of locations with crime incidents with the postcode [x0.Location.postcode:M7 2GE]?,x0.Location.postcode:M7 2GE = M7 2GE,2,3,count,1
2343,How many investigations into violence and sexual offences are conducted by officers with the surname Guyonneau?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Guyonneau"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Officer] = Guyonneau
How many investigations into violence and sexual offences are conducted by officers with the surname Guyonneau?",How many investigations into [x0.Crime.type:Violence and sexual offences] are conducted by officers with the surname [x1.Officer.surname:Guyonneau]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Officer.surname:Guyonneau = Guyonneau",2,318,count,1
3454,"On 08/08/2017, when did a call come in for someone with the surname Edwards?","MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Edwards"")
RETURN x0.call_time","[PhoneCall] = 08/08/2017
[Person] = Edwards
On 08/08/2017, when did a call come in for someone with the surname Edwards?","On [x0.PhoneCall.call_date:08/08/2017], when did a call come in for someone with the surname [x2.Person.surname:Edwards]?","x0.PhoneCall.call_date:08/08/2017 = 08/08/2017
x2.Person.surname:Edwards = Edwards",3,77,attribute_set,1
735,How many incidents on 13/08/2017 involve someone named Carlos?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Carlos"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
[Person] = Carlos
How many incidents on 13/08/2017 involve someone named Carlos?",How many incidents on [x0.Crime.date:13/08/2017] involve someone named [x1.Person.name:Carlos]?,"x0.Crime.date:13/08/2017 = 13/08/2017
x1.Person.name:Carlos = Carlos",2,97,count,1
1047,How many individuals named Amy cohabit with a person named Louis?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Louis"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Louis
How many individuals named Amy cohabit with a person named Louis?",How many individuals named [x0.Person.name:Amy] cohabit with a person named [x1.Person.name:Louis]?,"x0.Person.name:Amy = Amy
x1.Person.name:Louis = Louis",2,138,count,1
947,"On August 30, 2017, how many phone calls did any phone receive?","MATCH (x0:PhoneCall WHERE x0.call_date = ""30/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 30/08/2017
On August 30, 2017, how many phone calls did any phone receive?","On [x0.PhoneCall.call_date:30/08/2017], how many phone calls did any phone receive?","x0.PhoneCall.call_date:30/08/2017 = August 30, 2017",2,124,count,1
2961,What are the email addresses of individuals related to those with the last name Phillips?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Phillips"")
RETURN x0","[Person] = Phillips
What are the email addresses of individuals related to those with the last name Phillips?",What are the email addresses of individuals related to those with the last name [x2.Person.surname:Phillips]?,x2.Person.surname:Phillips = Phillips,3,430,entity_set,3
1758,How many crimes involved 2001 vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2001"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
How many crimes involved 2001 vehicles?",How many crimes involved [x1.Vehicle.year:2001] vehicles?,x1.Vehicle.year:2001 = 2001,2,233,count,1
2036,How long was the longest call made on 18/08/2017 to phones that also made calls?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 18/08/2017
How long was the longest call made on 18/08/2017 to phones that also made calls?",How long was the longest call made on [x2.PhoneCall.call_date:18/08/2017] to phones that also made calls?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,273,argmax,1
2497,How many folks possess a phone?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN COUNT(DISTINCT x0)",How many folks possess a phone?,How many folks possess a phone?,,2,346,count,1
376,Who are the officers named Even who investigated crimes on 30/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Even"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN x0","[Officer] = Even
[Crime] = 30/08/2017
Who are the officers named Even who investigated crimes on 30/08/2017?",Who are the officers named [x0.Officer.name:Even] who investigated crimes on [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Even = Even
x1.Crime.date:30/08/2017 = 30/08/2017",2,49,entity_set,2
4438,How many know a Wheeler and have a criminal involvement?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Wheeler"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Wheeler
How many know a Wheeler and have a criminal involvement?",How many know a [x2.Person.surname:Wheeler] and have a criminal involvement?,x2.Person.surname:Wheeler = Wheeler,3,25,count,1
612,How many officers were involved in investigating crimes on 26/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 26/08/2017
How many officers were involved in investigating crimes on 26/08/2017?",How many officers were involved in investigating crimes on [x1.Crime.date:26/08/2017]?,x1.Crime.date:26/08/2017 = 26/08/2017,2,80,count,1
3219,What are the NHS numbers of individuals called at 09:27?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""09:27"")
RETURN x0.nhs_no","[PhoneCall] = 09:27
What are the NHS numbers of individuals called at 09:27?",What are the NHS numbers of individuals called at [x2.PhoneCall.call_time:09:27]?,x2.PhoneCall.call_time:09:27 = 09:27,3,26,attribute_set,1
772,How many phones called at 09:28?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""09:28"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 09:28
How many phones called at 09:28?",How many phones called at [x1.PhoneCall.call_time:09:28]?,x1.PhoneCall.call_time:09:28 = 09:28,2,102,count,1
2924,At what times did 189 Jopson Street inhabitants engage in criminal acts?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0.date","[Location] = 189 Jopson Street
At what times did 189 Jopson Street inhabitants engage in criminal acts?",At what times did [x2.Location.address:189 Jopson Street] inhabitants engage in criminal acts?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,424,attribute_set,6
3362,How many places with violent or sexual crimes that involved individuals named Andrea?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Andrea"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Person] = Andrea
How many places with violent or sexual crimes that involved individuals named Andrea?",How many places with [x1.Crime.type:Violence and sexual offences] that involved individuals named [x2.Person.name:Andrea]?,"x1.Crime.type:Violence and sexual offences = violent or sexual crimes 
x2.Person.name:Andrea = Andrea",3,47,count,1
3439,How many minutes did Janice's longest call last?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Janice"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Janice
How many minutes did Janice's longest call last?",How many minutes did [x2.Person.name:Janice]'s longest call last?,x2.Person.name:Janice = Janice,3,66,argmax,1
2322,Can you identify all Dianas connected to offenses on 08/25/2017?,"MATCH (x0:Person WHERE x0.name = ""Diana"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""25/08/2017"")
RETURN x0","[Person] = Diana
[Crime] = 25/08/2017
Can you identify all Dianas connected to offenses on 08/25/2017?",Can you identify all [x0.Person.name:Diana] connected to offenses on [x1.Crime.date:25/08/2017]?,"x0.Person.name:Diana = Dianas
x1.Crime.date:25/08/2017 = 08/25/2017",2,313,entity_set,1
892,Who are the relatives of individuals with the last name Hanson?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Hanson"")
RETURN x0","[Person] = Hanson
Who are the relatives of individuals with the last name Hanson?",Who are the relatives of individuals with the last name [x1.Person.surname:Hanson]?,x1.Person.surname:Hanson = Hanson,2,117,entity_set,6
6,"What crimes occurred on August 17, 2017, involving individuals with surname Williamson?","MATCH (x0:Crime WHERE x0.date = ""17/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0","[Crime] = 17/08/2017
[Person] = Williamson
What crimes occurred on August 17, 2017, involving individuals with surname Williamson?","What crimes occurred on [x0.Crime.date:17/08/2017], involving individuals with surname [x1.Person.surname:Williamson]?","x0.Crime.date:17/08/2017 = August 17, 2017 
x1.Person.surname:Williamson = Williamson",2,1,entity_set,1
1064,Which offenses at 124 Wapping Street can't be prosecuted?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""124 Wapping Street"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Location] = 124 Wapping Street
Which offenses at 124 Wapping Street can't be prosecuted?",Which offenses at [x1.Location.address:124 Wapping Street] [x0.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Crime.last_outcome:Unable to prosecute suspect = can't be prosecuted 
x1.Location.address:124 Wapping Street = 124 Wapping Street",2,140,entity_set,2
1731,How many cars were part of criminal activities on 21st August 2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""21/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
How many cars were part of criminal activities on 21st August 2017?",How many cars were part of criminal activities on [x1.Crime.date:21/08/2017]?,x1.Crime.date:21/08/2017 = 21st August 2017,2,228,count,1
273,Which offenses took place at Pedestrian Subway?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Pedestrian Subway"")
RETURN x0","[Location] = Pedestrian Subway
Which offenses took place at Pedestrian Subway?",Which offenses took place at [x1.Location.address:Pedestrian Subway]?,x1.Location.address:Pedestrian Subway = Pedestrian Subway,2,33,entity_set,115
429,Can you name the Inspectors involved in cases marked as under investigation?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Inspector
[Crime] = Under investigation
Can you name the Inspectors involved in cases marked as under investigation?",Can you name the [x0.Officer.rank:Inspector] involved in cases marked as [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.last_outcome:Under investigation = under investigation",2,57,entity_set,673
3562,At which address did crimes occur that involved someone named Annie?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Annie"")
RETURN x0.address","[Person] = Annie
At which address did crimes occur that involved someone named Annie?",At which address did crimes occur that involved someone named [x2.Person.name:Annie]?,x2.Person.name:Annie = Annie,3,115,attribute_set,1
2966,Could you list the emails of people who have familial ties to anyone with last name Crawford?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Crawford"")
RETURN x0","[Person] = Crawford
Could you list the emails of people who have familial ties to anyone with last name Crawford?",Could you list the emails of people who have familial ties to anyone with last name [x2.Person.surname:Crawford]?,x2.Person.surname:Crawford = Crawford,3,430,entity_set,2
2416,Can you identify phones that called on 26/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""26/08/2017"")
RETURN x0","[PhoneCall] = 26/08/2017
Can you identify phones that called on 26/08/2017?",Can you identify phones that called on [x1.PhoneCall.call_date:26/08/2017]?,x1.PhoneCall.call_date:26/08/2017 = 26/08/2017,2,333,entity_set,26
1669,Which are the names of people that are family members of those with the surname Fuller?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Fuller"")
RETURN x0.name","[Person] = Fuller
Which are the names of people that are family members of those with the surname Fuller?",Which are the names of people that are family members of those with the surname [x1.Person.surname:Fuller]?,x1.Person.surname:Fuller = Fuller,2,219,attribute_set,6
691,Who knows someone with the last name Russell?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Russell"")
RETURN x0.name","[Person] = Russell
Who knows someone with the last name Russell?",Who knows someone with the last name [x1.Person.surname:Russell]?,x1.Person.surname:Russell = Russell,2,92,attribute_set,5
1320,How many times was 7-(492)933-2044 called at 20:36?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""20:36"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(492)933-2044"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20:36
[Phone] = 7-(492)933-2044
How many times was 7-(492)933-2044 called at 20:36?",How many times was [x1.Phone.phoneNo:7-(492)933-2044] called at [x0.PhoneCall.call_time:20:36]?,"x0.PhoneCall.call_time:20:36 = 20:36
x1.Phone.phoneNo:7-(492)933-2044 = 7-(492)933-2044",2,174,count,1
2771,What was the most recent crime involving a resident of 184 Sparrow Close?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""184 Sparrow Close"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 184 Sparrow Close
What was the most recent crime involving a resident of 184 Sparrow Close?",What was the most recent crime involving a resident of [x2.Location.address:184 Sparrow Close]?,x2.Location.address:184 Sparrow Close = 184 Sparrow Close,3,402,max,1
231,Can you identify the phones that contacted 7-(727)924-9245?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""7-(727)924-9245"")
RETURN x0","[Phone] = 7-(727)924-9245
Can you identify the phones that contacted 7-(727)924-9245?",Can you identify the phones that contacted [x2.Phone.phoneNo:7-(727)924-9245]?,x2.Phone.phoneNo:7-(727)924-9245 = 7-(727)924-9245,3,28,entity_set,2
2033,How long was the longest call made to phones that dialed out on 03/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""03/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 03/08/2017
How long was the longest call made to phones that dialed out on 03/08/2017?",How long was the longest call made to phones that dialed out on [x2.PhoneCall.call_date:03/08/2017]?,x2.PhoneCall.call_date:03/08/2017 = 03/08/2017,3,273,argmax,1
3176,Which officer ranks were part of the investigations into crimes involving Vanquish S models?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Vanquish S"")
RETURN x0.rank","[Vehicle] = Vanquish S
Which officer ranks were part of the investigations into crimes involving Vanquish S models?",Which officer ranks were part of the investigations into crimes involving [x2.Vehicle.model:Vanquish S] models?,x2.Vehicle.model:Vanquish S = Vanquish S,3,19,attribute_set,1
3045,What is the most recent crime linked to individuals who offended on 17/08/2017?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""17/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 17/08/2017
What is the most recent crime linked to individuals who offended on 17/08/2017?",What is the most recent crime linked to individuals who offended on [x2.Crime.date:17/08/2017]?,x2.Crime.date:17/08/2017 = 17/08/2017,3,444,max,1
2066,How many vehicle crimes involved Nissan cars?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Nissan"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Nissan
How many vehicle crimes involved Nissan cars?",How many [x0.Crime.type:Vehicle crime] involved [x1.Vehicle.make:Nissan] cars?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Nissan = Nissan",2,278,count,1
866,How many people does a person with the surname George know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""George"")
RETURN COUNT(DISTINCT x0)","[Person] = George
How many people does a person with the surname George know?",How many people does a person with the surname [x1.Person.surname:George] know?,x1.Person.surname:George = George,2,114,count,1
1511,Which crime happened first with people whose last name is Williamson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Williamson
Which crime happened first with people whose last name is Williamson?",Which crime happened first with people whose last name is [x1.Person.surname:Williamson]?,x1.Person.surname:Williamson = Williamson,2,200,min,1
1076,What is the count of crimes involving Nissan cars on 11/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""11/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Nissan"")
RETURN COUNT(DISTINCT x0)","[Crime] = 11/08/2017
[Vehicle] = Nissan
What is the count of crimes involving Nissan cars on 11/08/2017?",What is the count of crimes involving [x1.Vehicle.make:Nissan] cars on [x0.Crime.date:11/08/2017]?,"x0.Crime.date:11/08/2017 = 11/08/2017
x1.Vehicle.make:Nissan = Nissan",2,143,count,1
2250,"What are the locations of crimes from August 29, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""29/08/2017"")
RETURN x0","[Crime] = 29/08/2017
What are the locations of crimes from August 29, 2017?",What are the locations of crimes from [x1.Crime.date:29/08/2017]?,"x1.Crime.date:29/08/2017 = August 29, 2017",2,304,entity_set,958
1964,What is the number of phones owned by the individual with NHS number 358-70-5810?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""358-70-5810"")
RETURN COUNT(DISTINCT x0)","[Person] = 358-70-5810
What is the number of phones owned by the individual with NHS number 358-70-5810?",What is the number of phones owned by the individual with NHS number [x1.Person.nhs_no:358-70-5810]?,x1.Person.nhs_no:358-70-5810 = 358-70-5810,2,263,count,1
731,"On 25/08/2017, how many crimes involve people named Diana?","MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Diana"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Diana
On 25/08/2017, how many crimes involve people named Diana?","On [x0.Crime.date:25/08/2017], how many crimes involve people named [x1.Person.name:Diana]?","x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.name:Diana = Diana",2,97,count,1
33,How many burglaries are investigated by officers called Catherin?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Catherin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = Catherin
How many burglaries are investigated by officers called Catherin?",How many [x0.Crime.type:Burglary] are investigated by officers called [x1.Officer.name:Catherin]?,"x0.Crime.type:Burglary = burglaries 
x1.Officer.name:Catherin = Catherin",2,4,count,1
1986,Can you provide emails of those who have the phone number of a Woods?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
Can you provide emails of those who have the phone number of a Woods?",Can you provide emails of those who have the phone number of a [x2.Person.surname:Woods]?,x2.Person.surname:Woods = Woods,3,267,entity_set,2
1197,How many criminal acts on 25/08/2017 include an individual whose last name is Ward?,"MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Ward"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Ward
How many criminal acts on 25/08/2017 include an individual whose last name is Ward?",How many criminal acts on [x0.Crime.date:25/08/2017] include an individual whose last name is [x1.Person.surname:Ward]?,"x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.surname:Ward = Ward",2,159,count,1
4527,How many officers probed crimes with a person involved?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many officers probed crimes with a person involved?,How many officers probed crimes with a person involved?,,3,50,count,1
1560,What is the number of 2001 vehicles connected to crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2001"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
What is the number of 2001 vehicles connected to crimes?",What is the number of [x0.Vehicle.year:2001] vehicles connected to crimes?,x0.Vehicle.year:2001 = 2001,2,207,count,1
2942,How many cases where offenders received penalty notices involve people with last name Morales and are investigated by officers with the surname Death?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given penalty notice"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Morales"")
MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given penalty notice"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Death"")
RETURN COUNT(DISTINCT x0)","[Crime] = Offender given penalty notice
[Person] = Morales
[Officer] = Death
How many cases where offenders received penalty notices involve people with last name Morales and are investigated by officers with the surname Death?",How many cases where [x0.Crime.last_outcome:Offender given penalty notice] involve people with last name [x2.Person.surname:Morales] and are investigated by officers with the surname [x1.Officer.surname:Death]?,"x0.Crime.last_outcome:Offender given penalty notice = offenders received penalty notices 
x1.Officer.surname:Death = Death
x2.Person.surname:Morales = Morales",3,426,count,1
953,Which officers looked into crimes occurring on 24th August 2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN x0","[Crime] = 24/08/2017
Which officers looked into crimes occurring on 24th August 2017?",Which officers looked into crimes occurring on [x1.Crime.date:24/08/2017]?,x1.Crime.date:24/08/2017 = 24th August 2017,2,125,entity_set,957
614,What was the number of officers who probed crimes on 5/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""5/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 5/08/2017
What was the number of officers who probed crimes on 5/08/2017?",What was the number of officers who probed crimes on [x1.Crime.date:5/08/2017]?,x1.Crime.date:5/08/2017 = 5/08/2017,2,80,count,1
1920,Can you show me the phones with a 66-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""66"")
RETURN x0","[PhoneCall] = 66
Can you show me the phones with a 66-second call?",Can you show me the phones with a [x1.PhoneCall.call_duration:66]-second call?,x1.PhoneCall.call_duration:66 = 66,2,255,entity_set,16
2299,Which calls were placed with the phone number 1-(452)691-3232?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(452)691-3232"")
RETURN x0","[Phone] = 1-(452)691-3232
Which calls were placed with the phone number 1-(452)691-3232?",Which calls were placed with the phone number [x1.Phone.phoneNo:1-(452)691-3232]?,x1.Phone.phoneNo:1-(452)691-3232 = 1-(452)691-3232,2,310,entity_set,2
2887,What is the most ancient vehicle tied to a vehicle crime investigated by a Sergeant?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Vehicle crime
[Officer] = Sergeant
What is the most ancient vehicle tied to a vehicle crime investigated by a Sergeant?",What is the most ancient vehicle tied to a [x1.Crime.type:Vehicle crime] investigated by a [x2.Officer.rank:Sergeant]?,"x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.rank:Sergeant = Sergeant",3,419,max,1
2363,What are the areas with crime scenes from 6/08/2017?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""6/08/2017"")
RETURN x0","[Crime] = 6/08/2017
What are the areas with crime scenes from 6/08/2017?",What are the areas with crime scenes from [x2.Crime.date:6/08/2017]?,x2.Crime.date:6/08/2017 = 6/08/2017,3,323,entity_set,897
971,"On 23/08/2017, in how many spots did crimes occur?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
On 23/08/2017, in how many spots did crimes occur?","On [x1.Crime.date:23/08/2017], in how many spots did crimes occur?",x1.Crime.date:23/08/2017 = 23/08/2017,2,127,count,1
