id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
31,How many public order violations are looked into by officers named Gay?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Gay"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = Gay
How many public order violations are looked into by officers named Gay?",How many [x0.Crime.type:Public order] violations are looked into by officers named [x1.Officer.name:Gay]?,"x0.Crime.type:Public order = public order
x1.Officer.name:Gay = Gay",2,4,count,1
2295,Could you show all calls made from the phone number 2-(821)181-6941?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""2-(821)181-6941"")
RETURN x0","[Phone] = 2-(821)181-6941
Could you show all calls made from the phone number 2-(821)181-6941?",Could you show all calls made from the phone number [x1.Phone.phoneNo:2-(821)181-6941]?,x1.Phone.phoneNo:2-(821)181-6941 = 2-(821)181-6941,2,310,entity_set,2
1665,Can you name everyone related to someone with last name Marshall?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Marshall"")
RETURN x0.name","[Person] = Marshall
Can you name everyone related to someone with last name Marshall?",Can you name everyone related to someone with last name [x1.Person.surname:Marshall]?,x1.Person.surname:Marshall = Marshall,2,219,attribute_set,2
3116,Can you show the earliest dated calls to a phone that was called at 00:32?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""00:32"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 00:32
Can you show the earliest dated calls to a phone that was called at 00:32?",Can you show the earliest dated calls to a phone that was called at [x2.PhoneCall.call_time:00:32]?,x2.PhoneCall.call_time:00:32 = 00:32,3,10,min,1
628,Which vehicles from 2007 were involved in vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2007"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2007
[Crime] = Vehicle crime
Which vehicles from 2007 were involved in vehicle crimes?",Which vehicles from [x0.Vehicle.year:2007] were involved in [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2007 = 2007
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,36
71,How many devices got a call at 20:33?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""20:33"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20:33
How many devices got a call at 20:33?",How many devices got a call at [x1.PhoneCall.call_time:20:33]?,x1.PhoneCall.call_time:20:33 = 20:33,2,9,count,1
366,Which locations at 152 Chestnut Avenue have the postcode M43 7SA?,"MATCH (x0:Location WHERE x0.address = ""152 Chestnut Avenue"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M43 7SA"")
RETURN x0","[Location] = 152 Chestnut Avenue
[PostCode] = M43 7SA
Which locations at 152 Chestnut Avenue have the postcode M43 7SA?",Which locations at [x0.Location.address:152 Chestnut Avenue] have the postcode [x1.PostCode.code:M43 7SA]?,"x0.Location.address:152 Chestnut Avenue = 152 Chestnut Avenue
x1.PostCode.code:M43 7SA = M43 7SA",2,47,entity_set,1
688,What is the number of officers who looked into crimes?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",What is the number of officers who looked into crimes?,What is the number of officers who looked into crimes?,,2,91,count,1
1080,How many incidents on 2/08/2017 involved a Ford vehicle?,"MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Ford"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Ford
How many incidents on 2/08/2017 involved a Ford vehicle?",How many incidents on [x0.Crime.date:2/08/2017] involved a [x1.Vehicle.make:Ford] vehicle?,"x0.Crime.date:2/08/2017 = 2/08/2017
x1.Vehicle.make:Ford = Ford",2,143,count,1
2067,How many Nissan vehicles were involved in vehicle crimes?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Nissan"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Nissan
How many Nissan vehicles were involved in vehicle crimes?",How many [x1.Vehicle.make:Nissan] vehicles were involved in [x0.Crime.type:Vehicle crime]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Nissan = Nissan",2,278,count,1
890,Can you identify everyone related to someone with surname Austin?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0","[Person] = Austin
Can you identify everyone related to someone with surname Austin?",Can you identify everyone related to someone with surname [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,117,entity_set,4
3676,Which NHS numbers belong to those related with a person residing in M33 3WE postcode locations?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M33 3WE"")
RETURN x0.nhs_no","[Location] = M33 3WE
Which NHS numbers belong to those related with a person residing in M33 3WE postcode locations?",Which NHS numbers belong to those related with a person residing in [x2.Location.postcode:M33 3WE] postcode locations?,x2.Location.postcode:M33 3WE = M33 3WE,3,172,attribute_set,2
1541,Who are all the people living with someone with last name Hernandez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0","[Person] = Hernandez
Who are all the people living with someone with last name Hernandez?",Who are all the people living with someone with last name [x1.Person.surname:Hernandez]?,x1.Person.surname:Hernandez = Hernandez,2,205,entity_set,3
1434,How many cases with a status of awaiting court outcome involve an individual?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Awaiting court outcome"")-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Crime] = Awaiting court outcome
How many cases with a status of awaiting court outcome involve an individual?",How many cases with a status of [x0.Crime.last_outcome:Awaiting court outcome] involve an individual?,x0.Crime.last_outcome:Awaiting court outcome = awaiting court outcome,2,189,count,1
4436,How many individuals are acquainted with a Wheeler and linked to a crime?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Wheeler"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Wheeler
How many individuals are acquainted with a Wheeler and linked to a crime?",How many individuals are acquainted with a [x2.Person.surname:Wheeler] and linked to a crime?,x2.Person.surname:Wheeler = Wheeler,3,25,count,1
482,Can you provide a list of vehicles linked to crimes since 8/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""8/08/2017"")
RETURN x0","[Crime] = 8/08/2017
Can you provide a list of vehicles linked to crimes since 8/08/2017?",Can you provide a list of vehicles linked to crimes since [x1.Crime.date:8/08/2017]?,x1.Crime.date:8/08/2017 = 8/08/2017,2,63,entity_set,31
2325,What number of phones initiated calls?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)
RETURN COUNT(DISTINCT x0)",What number of phones initiated calls?,What number of phones initiated calls?,,2,314,count,1
4378,When was the latest crime involving a person who shares a home with Phillip?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Phillip
When was the latest crime involving a person who shares a home with Phillip?",When was the latest crime involving a person who shares a home with [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,0,argmax,1
2293,When did the last crime occur at 129 Rock Terrace with a Patterson involved?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Patterson"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""129 Rock Terrace"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Patterson
[Location] = 129 Rock Terrace
When did the last crime occur at 129 Rock Terrace with a Patterson involved?",When did the last crime occur at [x1.Location.address:129 Rock Terrace] with a [x2.Person.surname:Patterson] involved?,"x1.Location.address:129 Rock Terrace = 129 Rock Terrace
x2.Person.surname:Patterson = Patterson",3,309,argmax,1
2970,When did the first crime occur involving someone with the email bmoore1g@rediff.com?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""bmoore1g@rediff.com"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = bmoore1g@rediff.com
When did the first crime occur involving someone with the email bmoore1g@rediff.com?",When did the first crime occur involving someone with the email [x2.Email.email_address:bmoore1g@rediff.com]?,x2.Email.email_address:bmoore1g@rediff.com = bmoore1g@rediff.com,3,431,argmin,1
460,What are the emails of people living with someone with surname George?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""George"")
RETURN x0","[Person] = George
What are the emails of people living with someone with surname George?",What are the emails of people living with someone with surname [x2.Person.surname:George]?,x2.Person.surname:George = George,3,60,entity_set,2
1280,Who is the oldest person that has their phone number known by a Carlos with the number 8-(555)485-3508?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Carlos"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""8-(555)485-3508"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Carlos
[Phone] = 8-(555)485-3508
Who is the oldest person that has their phone number known by a Carlos with the number 8-(555)485-3508?",Who is the oldest person that has their phone number known by a [x1.Person.name:Carlos] with the number [x2.Phone.phoneNo:8-(555)485-3508]?,"x1.Person.name:Carlos = Carlos
x2.Phone.phoneNo:8-(555)485-3508 = 8-(555)485-3508",3,170,max,1
2318,"Who are the individuals named Stephanie linked to crimes on August 20, 2017?","MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Person] = Stephanie
[Crime] = 20/08/2017
Who are the individuals named Stephanie linked to crimes on August 20, 2017?",Who are the individuals named [x0.Person.name:Stephanie] linked to crimes on [x1.Crime.date:20/08/2017]?,"x0.Person.name:Stephanie = Stephanie
x1.Crime.date:20/08/2017 = August 20, 2017",2,313,entity_set,1
3132,How many know the phone number of someone with last name Ross with the email gross34@i2i.jp?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Ross"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""gross34@i2i.jp"")
RETURN COUNT(DISTINCT x0)","[Person] = Ross
[Email] = gross34@i2i.jp
How many know the phone number of someone with last name Ross with the email gross34@i2i.jp?",How many know the phone number of someone with last name [x1.Person.surname:Ross] with the email [x2.Email.email_address:gross34@i2i.jp]?,"x1.Person.surname:Ross = Ross
x2.Email.email_address:gross34@i2i.jp = gross34@i2i.jp",3,12,count,1
3436,How much time did the longest call to a person named Philip last?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Philip"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Philip
How much time did the longest call to a person named Philip last?",How much time did the longest call to a person named [x2.Person.name:Philip] last?,x2.Person.name:Philip = Philip,3,66,argmax,1
1325,In how many zones can you find locations with the postcode M30 8NS?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M30 8NS"")
RETURN COUNT(DISTINCT x0)","[Location] = M30 8NS
In how many zones can you find locations with the postcode M30 8NS?",In how many zones can you find locations with the postcode [x1.Location.postcode:M30 8NS]?,x1.Location.postcode:M30 8NS = M30 8NS,2,175,count,1
2281,"How many investigations labeled ""complete; no suspect"" involve officer 63-3360135?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""63-3360135"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = 63-3360135
How many investigations labeled ""complete; no suspect"" involve officer 63-3360135?","How many investigations labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involve officer [x1.Officer.badge_no:63-3360135]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = complete; no suspect 
x1.Officer.badge_no:63-3360135 = 63-3360135",2,307,count,1
4517,"When did the first crime at Piccadilly, investigated by Officer Boydell, happen?","MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Piccadilly"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Boydell"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = Piccadilly
[Officer] = Boydell
When did the first crime at Piccadilly, investigated by Officer Boydell, happen?","When did the first crime at [x1.Location.address:Piccadilly], investigated by Officer [x2.Officer.surname:Boydell], happen?","x1.Location.address:Piccadilly = Piccadilly
x2.Officer.surname:Boydell = Boydell",3,48,argmin,1
3407,What are the NHS numbers of people related to the person with the email cknight2k@jiathis.com?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""cknight2k@jiathis.com"")
RETURN x0.nhs_no","[Email] = cknight2k@jiathis.com
What are the NHS numbers of people related to the person with the email cknight2k@jiathis.com?",What are the NHS numbers of people related to the person with the email [x2.Email.email_address:cknight2k@jiathis.com]?,x2.Email.email_address:cknight2k@jiathis.com = cknight2k@jiathis.com,3,59,attribute_set,2
2844,What is the most recent crime linked to someone with the phone number 0-(752)850-0116?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""0-(752)850-0116"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 0-(752)850-0116
What is the most recent crime linked to someone with the phone number 0-(752)850-0116?",What is the most recent crime linked to someone with the phone number [x2.Phone.phoneNo:0-(752)850-0116]?,x2.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116,3,414,max,1
487,Which vehicles were involved in crimes starting from 6/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""6/08/2017"")
RETURN x0","[Crime] = 6/08/2017
Which vehicles were involved in crimes starting from 6/08/2017?",Which vehicles were involved in crimes starting from [x1.Crime.date:6/08/2017]?,x1.Crime.date:6/08/2017 = 6/08/2017,2,63,entity_set,36
3053,Which phone numbers belong to people connected to a crime?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0.phoneNo",Which phone numbers belong to people connected to a crime?,Which phone numbers belong to people connected to a crime?,,3,0,attribute_set,53
974,"On 28/08/2017, in how many areas did crimes occur?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 28/08/2017
On 28/08/2017, in how many areas did crimes occur?","On [x1.Crime.date:28/08/2017], in how many areas did crimes occur?",x1.Crime.date:28/08/2017 = 28/08/2017,2,127,count,1
2452,How many people share a home with someone who has the surname Lopez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Lopez"")
RETURN COUNT(DISTINCT x0)","[Person] = Lopez
How many people share a home with someone who has the surname Lopez?",How many people share a home with someone who has the surname [x1.Person.surname:Lopez]?,x1.Person.surname:Lopez = Lopez,2,338,count,1
1254,Which crimes on 22/08/2017 included vehicles of the Fit model?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Fit"")
RETURN x0","[Crime] = 22/08/2017
[Vehicle] = Fit
Which crimes on 22/08/2017 included vehicles of the Fit model?",Which crimes on [x0.Crime.date:22/08/2017] included vehicles of the [x1.Vehicle.model:Fit] model?,"x0.Crime.date:22/08/2017 = 22/08/2017
x1.Vehicle.model:Fit = Fit",2,167,entity_set,1
247,Which phones got calls on 28/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""28/08/2017"")
RETURN x0","[PhoneCall] = 28/08/2017
Which phones got calls on 28/08/2017?",Which phones got calls on [x1.PhoneCall.call_date:28/08/2017]?,x1.PhoneCall.call_date:28/08/2017 = 28/08/2017,2,30,entity_set,19
1595,What are the post codes linked to crime locations from 8/08/2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""8/08/2017"")
RETURN x0","[Crime] = 8/08/2017
What are the post codes linked to crime locations from 8/08/2017?",What are the post codes linked to crime locations from [x2.Crime.date:8/08/2017]?,x2.Crime.date:8/08/2017 = 8/08/2017,3,211,entity_set,886
3158,What NHS numbers belong to Richards who are friends with individuals sharing a home with someone else?,"MATCH (x0:Person WHERE x0.name = ""Richard"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Richard
What NHS numbers belong to Richards who are friends with individuals sharing a home with someone else?",What NHS numbers belong to [x0.Person.name:Richard] who are friends with individuals sharing a home with someone else?,x0.Person.name:Richard = Richards,3,15,attribute_set,3
3379,What is the newest crime connected to a person who knows the individual with NHS number 249-54-6589?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""249-54-6589"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 249-54-6589
What is the newest crime connected to a person who knows the individual with NHS number 249-54-6589?",What is the newest crime connected to a person who knows the individual with NHS number [x2.Person.nhs_no:249-54-6589]?,x2.Person.nhs_no:249-54-6589 = 249-54-6589,3,49,max,1
1852,What's the postcode linked to 116 China Lane?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""116 China Lane"")
RETURN x0","[Location] = 116 China Lane
What's the postcode linked to 116 China Lane?",What's the postcode linked to [x1.Location.address:116 China Lane]?,x1.Location.address:116 China Lane = 116 China Lane,2,247,entity_set,1
2022,Can you provide the post codes for the M41 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M41"")
RETURN x0","[Area] = M41
Can you provide the post codes for the M41 area?",Can you provide the post codes for the [x1.Area.areaCode:M41] area?,x1.Area.areaCode:M41 = M41,2,272,entity_set,154
1140,Can you identify the phones that called at 00:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""00:26"")
RETURN x0","[PhoneCall] = 00:26
Can you identify the phones that called at 00:26?",Can you identify the phones that called at [x1.PhoneCall.call_time:00:26]?,x1.PhoneCall.call_time:00:26 = 00:26,2,151,entity_set,1
41,Which Toyota vehicles are linked to vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Toyota"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Toyota
[Crime] = Vehicle crime
Which Toyota vehicles are linked to vehicle crimes?",Which [x0.Vehicle.make:Toyota] vehicles are linked to [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.make:Toyota = Toyota
x1.Crime.type:Vehicle crime = vehicle crimes",2,5,entity_set,48
3181,Which officer ranks were involved in investigating Touareg vehicle crimes?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Touareg"")
RETURN x0.rank","[Vehicle] = Touareg
Which officer ranks were involved in investigating Touareg vehicle crimes?",Which officer ranks were involved in investigating [x2.Vehicle.model:Touareg] vehicle crimes?,x2.Vehicle.model:Touareg = Touareg,3,19,attribute_set,2
2288,When was the most recent crime at 197 Mason Street involving someone with the last name George?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""George"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""197 Mason Street"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = George
[Location] = 197 Mason Street
When was the most recent crime at 197 Mason Street involving someone with the last name George?",When was the most recent crime at [x1.Location.address:197 Mason Street] involving someone with the last name [x2.Person.surname:George]?,"x1.Location.address:197 Mason Street = 197 Mason Street
x2.Person.surname:George = George",3,309,argmax,1
54,Can you name everyone acquainted with a person named Judith?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Judith"")
RETURN x0","[Person] = Judith
Can you name everyone acquainted with a person named Judith?",Can you name everyone acquainted with a person named [x1.Person.name:Judith]?,x1.Person.name:Judith = Judith,2,7,entity_set,7
454,What are the emails of people living with someone with surname Baker?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Baker"")
RETURN x0","[Person] = Baker
What are the emails of people living with someone with surname Baker?",What are the emails of people living with someone with surname [x2.Person.surname:Baker]?,x2.Person.surname:Baker = Baker,3,60,entity_set,3
4375,When was the latest crime involving a person cohabiting with Pamela?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Pamela"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Pamela
When was the latest crime involving a person cohabiting with Pamela?",When was the latest crime involving a person cohabiting with [x2.Person.name:Pamela]?,x2.Person.name:Pamela = Pamela,3,0,argmax,1
3294,What is the latest vehicle-related crime at postcode BL8 2DA?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""BL8 2DA"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = BL8 2DA
What is the latest vehicle-related crime at postcode BL8 2DA?",What is the latest vehicle-related crime at postcode [x1.Location.postcode:BL8 2DA]?,x1.Location.postcode:BL8 2DA = BL8 2DA,3,37,max,1
4376,When did the most recent crime occur involving a person living with someone named Phillip?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Phillip
When did the most recent crime occur involving a person living with someone named Phillip?",When did the most recent crime occur involving a person living with someone named [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,0,argmax,1
1123,When did the first crime happen at the Petrol Station?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = Petrol Station
When did the first crime happen at the Petrol Station?",When did the first crime happen at the [x1.Location.address:Petrol Station]?,x1.Location.address:Petrol Station = Petrol Station,2,149,argmin,1
1061,Which offenses at 27 Lincoln Drive have been investigated but lack a suspect?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""27 Lincoln Drive"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = 27 Lincoln Drive
Which offenses at 27 Lincoln Drive have been investigated but lack a suspect?",Which offenses at [x1.Location.address:27 Lincoln Drive] have been [x0.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Crime.last_outcome:Investigation complete; no suspect identified = investigated but lack a suspect 
x1.Location.address:27 Lincoln Drive = 27 Lincoln Drive",2,140,entity_set,1
339,Who are the occupants of 162 Lowther Road?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""162 Lowther Road"")
RETURN x0","[Location] = 162 Lowther Road
Who are the occupants of 162 Lowther Road?",Who are the occupants of [x1.Location.address:162 Lowther Road]?,x1.Location.address:162 Lowther Road = 162 Lowther Road,2,42,entity_set,2
391,"Who are the Inspectors who investigated crimes on February 8, 2017?","MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""2/08/2017"")
RETURN x0","[Officer] = Inspector
[Crime] = 2/08/2017
Who are the Inspectors who investigated crimes on February 8, 2017?",Who are the [x0.Officer.rank:Inspector] who investigated crimes on [x1.Crime.date:2/08/2017]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.date:2/08/2017 = February 8, 2017",2,52,entity_set,185
3659,What are the surnames of people whose phone number is known by a person living with Jonathan?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jonathan"")
RETURN x0.surname","[Person] = Jonathan
What are the surnames of people whose phone number is known by a person living with Jonathan?",What are the surnames of people whose phone number is known by a person living with [x2.Person.name:Jonathan]?,x2.Person.name:Jonathan = Jonathan,3,166,attribute_set,4
2386,Which neighborhood includes 53 Shaw Street?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""53 Shaw Street"")
RETURN x0","[Location] = 53 Shaw Street
Which neighborhood includes 53 Shaw Street?",Which neighborhood includes [x1.Location.address:53 Shaw Street]?,x1.Location.address:53 Shaw Street = 53 Shaw Street,2,328,entity_set,1
2687,In which areas do people surnamed Gray live?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
In which areas do people surnamed Gray live?",In which areas do people surnamed [x2.Person.surname:Gray] live?,x2.Person.surname:Gray = Gray,3,389,entity_set,2
411,Which locations correspond to the postcode M16 7WP?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M16 7WP"")
RETURN x0","[PostCode] = M16 7WP
Which locations correspond to the postcode M16 7WP?",Which locations correspond to the postcode [x1.PostCode.code:M16 7WP]?,x1.PostCode.code:M16 7WP = M16 7WP,2,54,entity_set,1
1070,What is the number of phones owned by a person called Gloria?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Gloria"")
RETURN COUNT(DISTINCT x0)","[Person] = Gloria
What is the number of phones owned by a person called Gloria?",What is the number of phones owned by a person called [x1.Person.name:Gloria]?,x1.Person.name:Gloria = Gloria,2,142,count,1
1245,How many offenses on 26/08/2017 are being looked into by officers whose last name is Goneau?,"MATCH (x0:Crime WHERE x0.date = ""26/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Goneau"")
RETURN COUNT(DISTINCT x0)","[Crime] = 26/08/2017
[Officer] = Goneau
How many offenses on 26/08/2017 are being looked into by officers whose last name is Goneau?",How many offenses on [x0.Crime.date:26/08/2017] are being looked into by officers whose last name is [x1.Officer.surname:Goneau]?,"x0.Crime.date:26/08/2017 = 26/08/2017
x1.Officer.surname:Goneau = Goneau",2,166,count,1
4568,How many drug-related crimes involve the individual with the phone number 1-(179)787-6778?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(179)787-6778"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Phone] = 1-(179)787-6778
How many drug-related crimes involve the individual with the phone number 1-(179)787-6778?",How many [x0.Crime.type:Drugs] involve the individual with the phone number [x2.Phone.phoneNo:1-(179)787-6778]?,"x0.Crime.type:Drugs = drug-related crimes 
x2.Phone.phoneNo:1-(179)787-6778 = 1-(179)787-6778",3,66,count,1
2784,What is the date of the first recorded crime involving relatives of a person with the surname Green?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Green"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Green
What is the date of the first recorded crime involving relatives of a person with the surname Green?",What is the date of the first recorded crime involving relatives of a person with the surname [x2.Person.surname:Green]?,x2.Person.surname:Green = Green,3,405,argmin,1
349,How many offenses include someone with last name Robinson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robinson"")
RETURN COUNT(DISTINCT x0)","[Person] = Robinson
How many offenses include someone with last name Robinson?",How many offenses include someone with last name [x1.Person.surname:Robinson]?,x1.Person.surname:Robinson = Robinson,2,44,count,1
423,Which residences belong to people surnamed Butler in the BL9 6BE postcode?,"MATCH (x0:Location WHERE x0.postcode = ""BL9 6BE"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Butler"")
RETURN x0","[Location] = BL9 6BE
[Person] = Butler
Which residences belong to people surnamed Butler in the BL9 6BE postcode?",Which residences belong to people surnamed [x1.Person.surname:Butler] in the [x0.Location.postcode:BL9 6BE] postcode?,"x0.Location.postcode:BL9 6BE = BL9 6BE
x1.Person.surname:Butler = Butler",2,55,entity_set,1
2656,Which emails belong to individuals who are friends with someone whose last name is Nguyen?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Nguyen"")
RETURN x0","[Person] = Nguyen
Which emails belong to individuals who are friends with someone whose last name is Nguyen?",Which emails belong to individuals who are friends with someone whose last name is [x2.Person.surname:Nguyen]?,x2.Person.surname:Nguyen = Nguyen,3,382,entity_set,11
2511,What is the number of Police Constables who looked into crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
What is the number of Police Constables who looked into crimes?",What is the number of [x0.Officer.rank:Police Constable] who looked into crimes?,x0.Officer.rank:Police Constable = Police Constables,2,350,count,1
372,"Which officers named Kincaid were investigating crimes on August 17, 2017?","MATCH (x0:Officer WHERE x0.name = ""Kincaid"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN x0","[Officer] = Kincaid
[Crime] = 17/08/2017
Which officers named Kincaid were investigating crimes on August 17, 2017?",Which officers named [x0.Officer.name:Kincaid] were investigating crimes on [x1.Crime.date:17/08/2017]?,"x0.Officer.name:Kincaid = Kincaid
x1.Crime.date:17/08/2017 = August 17, 2017",2,49,entity_set,4
1135,Which phones placed a call at 14:59?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""14:59"")
RETURN x0","[PhoneCall] = 14:59
Which phones placed a call at 14:59?",Which phones placed a call at [x1.PhoneCall.call_time:14:59]?,x1.PhoneCall.call_time:14:59 = 14:59,2,151,entity_set,2
754,What was the first crime at 170 Thorn Lea?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""170 Thorn Lea"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 170 Thorn Lea
What was the first crime at 170 Thorn Lea?",What was the first crime at [x1.Location.address:170 Thorn Lea]?,x1.Location.address:170 Thorn Lea = 170 Thorn Lea,2,100,min,1
