id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1486,Can you provide all emails for individuals with the last name Fernandez?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Person] = Fernandez
Can you provide all emails for individuals with the last name Fernandez?",Can you provide all emails for individuals with the last name [x1.Person.surname:Fernandez]?,x1.Person.surname:Fernandez = Fernandez,2,198,entity_set,3
925,How many crimes on 20/08/2017 involved a vehicle?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
How many crimes on 20/08/2017 involved a vehicle?",How many crimes on [x0.Crime.date:20/08/2017] involved a vehicle?,x0.Crime.date:20/08/2017 = 20/08/2017,2,121,count,1
2888,"Which vehicle, involved in a vehicle crime, is the oldest and was investigated by a Sergeant?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Vehicle crime
[Officer] = Sergeant
Which vehicle, involved in a vehicle crime, is the oldest and was investigated by a Sergeant?","Which vehicle, involved in a [x1.Crime.type:Vehicle crime], is the oldest and was investigated by a [x2.Officer.rank:Sergeant]?","x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.rank:Sergeant = Sergeant",3,419,max,1
2912,What was the earliest crime at 199 Ogden Lane that included an Echo car?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""199 Ogden Lane"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Echo"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 199 Ogden Lane
[Vehicle] = Echo
What was the earliest crime at 199 Ogden Lane that included an Echo car?",What was the earliest crime at [x2.Location.address:199 Ogden Lane] that included an [x1.Vehicle.model:Echo] car?,"x1.Vehicle.model:Echo = Echo
x2.Location.address:199 Ogden Lane = 199 Ogden Lane",3,422,min,1
3462,Can you identify the earliest phone call received by someone named Stephen?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Stephen"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Stephen
Can you identify the earliest phone call received by someone named Stephen?",Can you identify the earliest phone call received by someone named [x2.Person.name:Stephen]?,x2.Person.name:Stephen = Stephen,3,82,min,1
1631,What areas contain locations with the post code SK5 7EH?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""SK5 7EH"")
RETURN x0","[Location] = SK5 7EH
What areas contain locations with the post code SK5 7EH?",What areas contain locations with the post code [x1.Location.postcode:SK5 7EH]?,x1.Location.postcode:SK5 7EH = SK5 7EH,2,215,entity_set,1
1147,What violent and sexual offences are investigated by officers with last name Braizier?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Braizier"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Braizier
What violent and sexual offences are investigated by officers with last name Braizier?",What [x0.Crime.type:Violence and sexual offences] are investigated by officers with last name [x1.Officer.surname:Braizier]?,"x0.Crime.type:Violence and sexual offences = violent and sexual offences 
x1.Officer.surname:Braizier = Braizier",2,152,entity_set,7
3270,What is the phone number of a friend of the person with NHS number 306-99-5229?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""306-99-5229"")
RETURN x0.phoneNo","[Person] = 306-99-5229
What is the phone number of a friend of the person with NHS number 306-99-5229?",What is the phone number of a friend of the person with NHS number [x2.Person.nhs_no:306-99-5229]?,x2.Person.nhs_no:306-99-5229 = 306-99-5229,3,35,attribute_set,1
2859,How many cases involving someone surnamed Hughes are handled by Inspectors?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Inspector"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
[Person] = Hughes
How many cases involving someone surnamed Hughes are handled by Inspectors?",How many cases involving someone surnamed [x1.Person.surname:Hughes] are handled by [x2.Officer.rank:Inspector]?,"x1.Person.surname:Hughes = Hughes
x2.Officer.rank:Inspector = Inspectors",3,416,count,1
3664,Can you provide the surnames of individuals who have the phone number of a person residing with Ruby?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Ruby"")
RETURN x0.surname","[Person] = Ruby
Can you provide the surnames of individuals who have the phone number of a person residing with Ruby?",Can you provide the surnames of individuals who have the phone number of a person residing with [x2.Person.name:Ruby]?,x2.Person.name:Ruby = Ruby,3,166,attribute_set,1
1671,What is the count of 21-second phone calls to 8-(689)151-8054?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""21"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(689)151-8054"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 21
[Phone] = 8-(689)151-8054
What is the count of 21-second phone calls to 8-(689)151-8054?",What is the count of [x0.PhoneCall.call_duration:21]-second phone calls to [x1.Phone.phoneNo:8-(689)151-8054]?,"x0.PhoneCall.call_duration:21 = 21
x1.Phone.phoneNo:8-(689)151-8054 = 8-(689)151-8054",2,220,count,1
461,Can you provide the emails of those residing with a person whose last name is George?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""George"")
RETURN x0","[Person] = George
Can you provide the emails of those residing with a person whose last name is George?",Can you provide the emails of those residing with a person whose last name is [x2.Person.surname:George]?,x2.Person.surname:George = George,3,60,entity_set,2
4631,What's the first crime involving someone who knows Virginia's phone number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Virginia"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Virginia
What's the first crime involving someone who knows Virginia's phone number?",What's the first crime involving someone who knows [x2.Person.name:Virginia]'s phone number?,x2.Person.name:Virginia = Virginia,3,89,min,1
10,"How many crimes labeled ""Investigation complete; no suspect identified"" are overseen by officers whose last name is Vosper?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Vosper"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = Vosper
How many crimes labeled ""Investigation complete; no suspect identified"" are overseen by officers whose last name is Vosper?","How many crimes labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are overseen by officers whose last name is [x1.Officer.surname:Vosper]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Officer.surname:Vosper = Vosper",2,2,count,1
2224,Which calls did 0-(070)893-3322 receive on 12/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""12/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(070)893-3322"")
RETURN x0","[PhoneCall] = 12/08/2017
[Phone] = 0-(070)893-3322
Which calls did 0-(070)893-3322 receive on 12/08/2017?",Which calls did [x1.Phone.phoneNo:0-(070)893-3322] receive on [x0.PhoneCall.call_date:12/08/2017]?,"x0.PhoneCall.call_date:12/08/2017 = 12/08/2017
x1.Phone.phoneNo:0-(070)893-3322 = 0-(070)893-3322",2,300,entity_set,1
1537,"On 25th August 2017, how many crimes involved Crown Victoria models?","MATCH (x0:Vehicle WHERE x0.model = ""Crown Victoria"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""25/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Crown Victoria
[Crime] = 25/08/2017
On 25th August 2017, how many crimes involved Crown Victoria models?","On [x1.Crime.date:25/08/2017], how many crimes involved [x0.Vehicle.model:Crown Victoria] models?","x0.Vehicle.model:Crown Victoria = Crown Victoria
x1.Crime.date:25/08/2017 = 25th August 2017",2,203,count,1
2278,"How many crimes labeled ""Investigation complete; no suspect identified"" are overseen by officer 37-2206375?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""37-2206375"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = 37-2206375
How many crimes labeled ""Investigation complete; no suspect identified"" are overseen by officer 37-2206375?","How many crimes labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are overseen by officer [x1.Officer.badge_no:37-2206375]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Officer.badge_no:37-2206375 = 37-2206375",2,307,count,1
1429,How many cases marked as Unable to prosecute suspect involve a person?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
How many cases marked as Unable to prosecute suspect involve a person?",How many cases marked as [x0.Crime.last_outcome:Unable to prosecute suspect] involve a person?,x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,189,count,1
3172,Can you identify the type of the most recent crime by those that already were part of a vehicle crime?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.type
ORDER BY x0.date DESC
LIMIT 1","[Crime] = Vehicle crime
Can you identify the type of the most recent crime by those that already were part of a vehicle crime?",Can you identify the type of the most recent crime by those that already were part of a [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = vehicle crime,3,17,argmax,1
419,Can you provide the homes of Hughes family members in the SK3 8NA postal zone?,"MATCH (x0:Location WHERE x0.postcode = ""SK3 8NA"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN x0","[Location] = SK3 8NA
[Person] = Hughes
Can you provide the homes of Hughes family members in the SK3 8NA postal zone?",Can you provide the homes of [x1.Person.surname:Hughes] family members in the [x0.Location.postcode:SK3 8NA] postal zone?,"x0.Location.postcode:SK3 8NA = SK3 8NA
x1.Person.surname:Hughes = Hughes",2,55,entity_set,1
1913,Which phones had a call that lasted 38 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""38"")
RETURN x0","[PhoneCall] = 38
Which phones had a call that lasted 38 seconds?",Which phones had a call that lasted [x1.PhoneCall.call_duration:38] seconds?,x1.PhoneCall.call_duration:38 = 38,2,255,entity_set,8
1623,Which crime involving Mazda3 cars happened first?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Mazda3"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Mazda3
Which crime involving Mazda3 cars happened first?",Which crime involving [x1.Vehicle.model:Mazda3] cars happened first?,x1.Vehicle.model:Mazda3 = Mazda3,2,214,min,1
1085,What is the number of phones that had a call for 66 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""66"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
What is the number of phones that had a call for 66 seconds?",What is the number of phones that had a call for [x1.PhoneCall.call_duration:66] seconds?,x1.PhoneCall.call_duration:66 = 66,2,144,count,1
2860,How many investigations do Inspectors conduct that involve a person with the surname Hughes?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Inspector"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
[Person] = Hughes
How many investigations do Inspectors conduct that involve a person with the surname Hughes?",How many investigations do [x2.Officer.rank:Inspector] conduct that involve a person with the surname [x1.Person.surname:Hughes]?,"x1.Person.surname:Hughes = Hughes
x2.Officer.rank:Inspector = Inspectors",3,416,count,1
687,How many homes belong to individuals named Ann?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Ann"")
RETURN COUNT(DISTINCT x0)","[Person] = Ann
How many homes belong to individuals named Ann?",How many homes belong to individuals named [x1.Person.name:Ann]?,x1.Person.name:Ann = Ann,2,90,count,1
1778,"What crimes with the status ""Investigation complete; no suspect identified"" happened at locations with the postcode M1 5DA?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M1 5DA"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = M1 5DA
What crimes with the status ""Investigation complete; no suspect identified"" happened at locations with the postcode M1 5DA?","What crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" happened at locations with the postcode [x1.Location.postcode:M1 5DA]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:M1 5DA = M1 5DA",2,236,entity_set,16
668,Can you name everyone who is friends with someone with surname Robertson?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN x0","[Person] = Robertson
Can you name everyone who is friends with someone with surname Robertson?",Can you name everyone who is friends with someone with surname [x1.Person.surname:Robertson]?,x1.Person.surname:Robertson = Robertson,2,88,entity_set,14
3322,Which are the last names of people that live in locations affected by vehicle crime?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.surname","[Crime] = Vehicle crime
Which are the last names of people that live in locations affected by vehicle crime?",Which are the last names of people that live in locations affected by [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = vehicle crime,3,41,attribute_set,58
50,How many officers with the name Meara looked into crimes happening on 28/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Meara"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Meara
[Crime] = 28/08/2017
How many officers with the name Meara looked into crimes happening on 28/08/2017?",How many officers with the name [x0.Officer.name:Meara] looked into crimes happening on [x1.Crime.date:28/08/2017]?,"x0.Officer.name:Meara = Meara
x1.Crime.date:28/08/2017 = 28/08/2017",2,6,count,1
700,What calls were made at 06:07 from the number 3-(065)802-7791?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""06:07"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(065)802-7791"")
RETURN x0","[PhoneCall] = 06:07
[Phone] = 3-(065)802-7791
What calls were made at 06:07 from the number 3-(065)802-7791?",What calls were made at [x0.PhoneCall.call_time:06:07] from the number [x1.Phone.phoneNo:3-(065)802-7791]?,"x0.PhoneCall.call_time:06:07 = 06:07
x1.Phone.phoneNo:3-(065)802-7791 = 3-(065)802-7791",2,93,entity_set,1
1024,When was the most recent crime at an address with the postcode SK7 6LQ?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""SK7 6LQ"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = SK7 6LQ
When was the most recent crime at an address with the postcode SK7 6LQ?",When was the most recent crime at an address with the postcode [x2.PostCode.code:SK7 6LQ]?,x2.PostCode.code:SK7 6LQ = SK7 6LQ,3,135,argmax,1
2393,Which crime involving a person surnamed Kelly and an LHS model vehicle happened first?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""LHS"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = LHS
[Person] = Kelly
Which crime involving a person surnamed Kelly and an LHS model vehicle happened first?",Which crime involving a person surnamed [x1.Person.surname:Kelly] and an [x2.Vehicle.model:LHS] model vehicle happened first?,"x1.Person.surname:Kelly = Kelly
x2.Vehicle.model:LHS = LHS",3,331,min,1
413,Which locations share the postcode BL2 2UQ?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""BL2 2UQ"")
RETURN x0","[PostCode] = BL2 2UQ
Which locations share the postcode BL2 2UQ?",Which locations share the postcode [x1.PostCode.code:BL2 2UQ]?,x1.PostCode.code:BL2 2UQ = BL2 2UQ,2,54,entity_set,1
1582,Which crimes took place at sites with the postcode M6 5HW?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M6 5HW"")
RETURN x0","[Location] = M6 5HW
Which crimes took place at sites with the postcode M6 5HW?",Which crimes took place at sites with the postcode [x1.Location.postcode:M6 5HW]?,x1.Location.postcode:M6 5HW = M6 5HW,2,209,entity_set,15
1156,How many Bonnies are acquainted with Rachels?,"MATCH (x0:Person WHERE x0.name = ""Bonnie"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Rachel"")
RETURN COUNT(DISTINCT x0)","[Person] = Bonnie
[Person] = Rachel
How many Bonnies are acquainted with Rachels?",How many [x0.Person.name:Bonnie] are acquainted with [x1.Person.name:Rachel]?,"x0.Person.name:Bonnie = Bonnies
x1.Person.name:Rachel = Rachels",2,153,count,1
92,What are the ages of individuals residing with someone with surname Jordan?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Jordan"")
RETURN x0.age","[Person] = Jordan
What are the ages of individuals residing with someone with surname Jordan?",What are the ages of individuals residing with someone with surname [x1.Person.surname:Jordan]?,x1.Person.surname:Jordan = Jordan,2,11,attribute_set,1
598,"What is the total number of calls made to any phone on August 9, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""09/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 09/08/2017
What is the total number of calls made to any phone on August 9, 2017?",What is the total number of calls made to any phone on [x0.PhoneCall.call_date:09/08/2017]?,"x0.PhoneCall.call_date:09/08/2017 = August 9, 2017",2,79,count,1
1079,"On 2/08/2017, how many crimes included Ford cars?","MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Ford"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Ford
On 2/08/2017, how many crimes included Ford cars?","On [x0.Crime.date:2/08/2017], how many crimes included [x1.Vehicle.make:Ford] cars?","x0.Crime.date:2/08/2017 = 2/08/2017
x1.Vehicle.make:Ford = Ford",2,143,count,1
2653,Which emails are owned by friends of a person with the last name Alexander?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Alexander"")
RETURN x0","[Person] = Alexander
Which emails are owned by friends of a person with the last name Alexander?",Which emails are owned by friends of a person with the last name [x2.Person.surname:Alexander]?,x2.Person.surname:Alexander = Alexander,3,382,entity_set,10
2336,How many 'Other theft' crimes are investigated by officers with last name Iddison?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Iddison"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
[Officer] = Iddison
How many 'Other theft' crimes are investigated by officers with last name Iddison?",How many '[x0.Crime.type:Other theft]' crimes are investigated by officers with last name [x1.Officer.surname:Iddison]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Iddison = Iddison",2,318,count,1
490,How many ongoing investigations include someone with last name Powell?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Person] = Powell
How many ongoing investigations include someone with last name Powell?",How many [x0.Crime.last_outcome:Under investigation] include someone with last name [x1.Person.surname:Powell]?,"x0.Crime.last_outcome:Under investigation = ongoing investigations 
x1.Person.surname:Powell = Powell",2,64,count,1
322,"How many calls were made to 4-(962)368-0599 on August 26, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""26/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(962)368-0599"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 26/08/2017
[Phone] = 4-(962)368-0599
How many calls were made to 4-(962)368-0599 on August 26, 2017?",How many calls were made to [x1.Phone.phoneNo:4-(962)368-0599] on [x0.PhoneCall.call_date:26/08/2017]?,"x0.PhoneCall.call_date:26/08/2017 = August 26, 2017 
x1.Phone.phoneNo:4-(962)368-0599 = 4-(962)368-0599",2,40,count,1
2163,What is the number of burglaries investigated by the officer with badge 23-7304886?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""23-7304886"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = 23-7304886
What is the number of burglaries investigated by the officer with badge 23-7304886?",What is the number of [x0.Crime.type:Burglary] investigated by the officer with badge [x1.Officer.badge_no:23-7304886]?,"x0.Crime.type:Burglary = burglaries 
x1.Officer.badge_no:23-7304886 = 23-7304886",2,292,count,1
689,How many officers probed into criminal activities?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",How many officers probed into criminal activities?,How many officers probed into criminal activities?,,2,91,count,1
1831,Who is the youngest resident living with someone who knows how to contact a person with the last name Edwards?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Edwards"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Edwards
Who is the youngest resident living with someone who knows how to contact a person with the last name Edwards?",Who is the youngest resident living with someone who knows how to contact a person with the last name [x2.Person.surname:Edwards]?,x2.Person.surname:Edwards = Edwards,3,243,min,1
3441,Can you identify all individuals residing with someone connected to a crime?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Can you identify all individuals residing with someone connected to a crime?,Can you identify all individuals residing with someone connected to a crime?,,3,67,entity_set,46
889,Who are the relatives of individuals with the last name Austin?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0","[Person] = Austin
Who are the relatives of individuals with the last name Austin?",Who are the relatives of individuals with the last name [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,117,entity_set,4
1365,What 1998 vehicles were involved in a crime on 26/08/2017?,"MATCH (x0:Vehicle WHERE x0.year = ""1998"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0","[Vehicle] = 1998
[Crime] = 26/08/2017
What 1998 vehicles were involved in a crime on 26/08/2017?",What [x0.Vehicle.year:1998] vehicles were involved in a crime on [x1.Crime.date:26/08/2017]?,"x0.Vehicle.year:1998 = 1998
x1.Crime.date:26/08/2017 = 26/08/2017",2,179,entity_set,3
2303,Can you provide all emails from individuals named Benjamin?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Benjamin"")
RETURN x0","[Person] = Benjamin
Can you provide all emails from individuals named Benjamin?",Can you provide all emails from individuals named [x1.Person.name:Benjamin]?,x1.Person.name:Benjamin = Benjamin,2,311,entity_set,2
2294,Can you provide a list of calls made using the number 2-(821)181-6941?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""2-(821)181-6941"")
RETURN x0","[Phone] = 2-(821)181-6941
Can you provide a list of calls made using the number 2-(821)181-6941?",Can you provide a list of calls made using the number [x1.Phone.phoneNo:2-(821)181-6941]?,x1.Phone.phoneNo:2-(821)181-6941 = 2-(821)181-6941,2,310,entity_set,2
3210,How many individuals have friends surnamed Harper who are also connected to someone surnamed Butler?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Harper"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Butler"")
RETURN COUNT(DISTINCT x0)","[Person] = Harper
[Person] = Butler
How many individuals have friends surnamed Harper who are also connected to someone surnamed Butler?",How many individuals have friends surnamed [x1.Person.surname:Harper] who are also connected to someone surnamed [x2.Person.surname:Butler]?,"x1.Person.surname:Harper = Harper
x2.Person.surname:Butler = Butler",3,24,count,1
2641,How many MINI automobiles are part of a vehicle crime inquiry led by Officer Rings?,"MATCH (x0:Vehicle WHERE x0.model = ""MINI"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Rings"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = MINI
[Crime] = Vehicle crime
[Officer] = Rings
How many MINI automobiles are part of a vehicle crime inquiry led by Officer Rings?",How many [x0.Vehicle.model:MINI] automobiles are part of a [x1.Crime.type:Vehicle crime] inquiry led by Officer [x2.Officer.surname:Rings]?,"x0.Vehicle.model:MINI = MINI
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Rings = Rings",3,380,count,1
79,How many phones were contacted at 19:19?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""19:19"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:19
How many phones were contacted at 19:19?",How many phones were contacted at [x1.PhoneCall.call_time:19:19]?,x1.PhoneCall.call_time:19:19 = 19:19,2,9,count,1
2715,When did crimes involving a relative with last name Kelly take place?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Kelly"")
RETURN x0.date","[Person] = Kelly
When did crimes involving a relative with last name Kelly take place?",When did crimes involving a relative with last name [x2.Person.surname:Kelly] take place?,x2.Person.surname:Kelly = Kelly,3,393,attribute_set,3
155,What crimes occurred on 28/08/2017 that Officer Ame is investigating?,"MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Ame"")
RETURN x0","[Crime] = 28/08/2017
[Officer] = Ame
What crimes occurred on 28/08/2017 that Officer Ame is investigating?",What crimes occurred on [x0.Crime.date:28/08/2017] that Officer [x1.Officer.name:Ame] is investigating?,"x0.Crime.date:28/08/2017 = 28/08/2017
x1.Officer.name:Ame = Ame",2,18,entity_set,1
146,Which is the earliest call made to phones that dialed on 04/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""04/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 04/08/2017
Which is the earliest call made to phones that dialed on 04/08/2017?",Which is the earliest call made to phones that dialed on [x2.PhoneCall.call_date:04/08/2017]?,x2.PhoneCall.call_date:04/08/2017 = 04/08/2017,3,17,min,1
1933,Which crime dates involve people whose phone numbers are known by individuals with the last name Fox?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Fox"")
RETURN x0.date","[Person] = Fox
Which crime dates involve people whose phone numbers are known by individuals with the last name Fox?",Which crime dates involve people whose phone numbers are known by individuals with the last name [x2.Person.surname:Fox]?,x2.Person.surname:Fox = Fox,3,258,attribute_set,5
504,Can you identify the officers who investigated crimes related to violence and sexual offences?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Crime] = Violence and sexual offences
Can you identify the officers who investigated crimes related to violence and sexual offences?",Can you identify the officers who investigated crimes related to [x1.Crime.type:Violence and sexual offences]?,x1.Crime.type:Violence and sexual offences = violence and sexual offences,2,65,entity_set,8765
1350,How many calls were placed on 02/08/2017 by phones of those with the surname Gordon?,"MATCH (x0:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""02/08/2017"")
MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Gordon"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 02/08/2017
[Person] = Gordon
How many calls were placed on 02/08/2017 by phones of those with the surname Gordon?",How many calls were placed on [x2.PhoneCall.call_date:02/08/2017] by phones of those with the surname [x1.Person.surname:Gordon]?,"x1.Person.surname:Gordon = Gordon
x2.PhoneCall.call_date:02/08/2017 = 02/08/2017",3,178,count,1
2619,Can you identify everyone with a phone?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN x0",Can you identify everyone with a phone?,Can you identify everyone with a phone?,,2,376,entity_set,328
870,How many people are familiar to anyone with the last name Garcia?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Garcia"")
RETURN COUNT(DISTINCT x0)","[Person] = Garcia
How many people are familiar to anyone with the last name Garcia?",How many people are familiar to anyone with the last name [x1.Person.surname:Garcia]?,x1.Person.surname:Garcia = Garcia,2,114,count,1
0,What crimes occurred on 1/08/2017 involving individuals with surname Walker?,"MATCH (x0:Crime WHERE x0.date = ""1/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Walker"")
RETURN x0","[Crime] = 1/08/2017
[Person] = Walker
What crimes occurred on 1/08/2017 involving individuals with surname Walker?",What crimes occurred on [x0.Crime.date:1/08/2017] involving individuals with surname [x1.Person.surname:Walker]?,"x0.Crime.date:1/08/2017 = 1/08/2017
x1.Person.surname:Walker = Walker",2,1,entity_set,1
2922,When were crimes committed by residents of 189 Jopson Street?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0.date","[Location] = 189 Jopson Street
When were crimes committed by residents of 189 Jopson Street?",When were crimes committed by residents of [x2.Location.address:189 Jopson Street]?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,424,attribute_set,6
779,"At 19:22, how many phones made calls?","MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""19:22"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:22
At 19:22, how many phones made calls?","At [x1.PhoneCall.call_time:19:22], how many phones made calls?",x1.PhoneCall.call_time:19:22 = 19:22,2,102,count,1
2366,"What are the areas with crime scenes from August 30, 2017?","MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""30/08/2017"")
RETURN x0","[Crime] = 30/08/2017
What are the areas with crime scenes from August 30, 2017?",What are the areas with crime scenes from [x2.Crime.date:30/08/2017]?,"x2.Crime.date:30/08/2017 = August 30, 2017",3,323,entity_set,871
