id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
4612,What's the least lengthy call received on the phone that had a call on 09/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""09/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 09/08/2017
What's the least lengthy call received on the phone that had a call on 09/08/2017?",What's the least lengthy call received on the phone that had a call on [x2.PhoneCall.call_date:09/08/2017]?,x2.PhoneCall.call_date:09/08/2017 = 09/08/2017,3,76,min,1
1675,How often were 45-second calls placed to 9-(184)752-7135?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""45"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(184)752-7135"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 45
[Phone] = 9-(184)752-7135
How often were 45-second calls placed to 9-(184)752-7135?",How often were [x0.PhoneCall.call_duration:45]-second calls placed to [x1.Phone.phoneNo:9-(184)752-7135]?,"x0.PhoneCall.call_duration:45 = 45
x1.Phone.phoneNo:9-(184)752-7135 = 9-(184)752-7135",2,220,count,1
3042,"What's the most recent crime linked to individuals who offended on August 19, 2017?","MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""19/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 19/08/2017
What's the most recent crime linked to individuals who offended on August 19, 2017?",What's the most recent crime linked to individuals who offended on [x2.Crime.date:19/08/2017]?,"x2.Crime.date:19/08/2017 = August 19, 2017",3,444,max,1
2716,What are the dates of crimes involving a family connection to someone with surname Kelly?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Kelly"")
RETURN x0.date","[Person] = Kelly
What are the dates of crimes involving a family connection to someone with surname Kelly?",What are the dates of crimes involving a family connection to someone with surname [x2.Person.surname:Kelly]?,x2.Person.surname:Kelly = Kelly,3,393,attribute_set,3
1893,Can you identify phones that had a call lasting 14 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""14"")
RETURN x0","[PhoneCall] = 14
Can you identify phones that had a call lasting 14 seconds?",Can you identify phones that had a call lasting [x1.PhoneCall.call_duration:14] seconds?,x1.PhoneCall.call_duration:14 = 14,2,252,entity_set,2
2694,Can you list the areas where individuals with the surname White reside?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""White"")
RETURN x0","[Person] = White
Can you list the areas where individuals with the surname White reside?",Can you list the areas where individuals with the surname [x2.Person.surname:White] reside?,x2.Person.surname:White = White,3,389,entity_set,2
2157,What is the count of public order offenses handled by officer 05-3036001?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""05-3036001"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = 05-3036001
What is the count of public order offenses handled by officer 05-3036001?",What is the count of [x0.Crime.type:Public order] offenses handled by officer [x1.Officer.badge_no:05-3036001]?,"x0.Crime.type:Public order = public order
x1.Officer.badge_no:05-3036001 = 05-3036001",2,292,count,1
2178,How many Mazdas are connected to criminal activities?,"MATCH (x0:Vehicle WHERE x0.make = ""Mazda"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Mazda
How many Mazdas are connected to criminal activities?",How many [x0.Vehicle.make:Mazda] are connected to criminal activities?,x0.Vehicle.make:Mazda = Mazdas,2,295,count,1
3048,"What is the most recent crime linked to individuals who offended on August 25, 2017?","MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""25/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 25/08/2017
What is the most recent crime linked to individuals who offended on August 25, 2017?",What is the most recent crime linked to individuals who offended on [x2.Crime.date:25/08/2017]?,"x2.Crime.date:25/08/2017 = August 25, 2017",3,444,max,1
2307,Can you provide the email addresses for individuals named James?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""James"")
RETURN x0","[Person] = James
Can you provide the email addresses for individuals named James?",Can you provide the email addresses for individuals named [x1.Person.name:James]?,x1.Person.name:James = James,2,311,entity_set,1
3382,What is the newest crime linked to a person who knows the holder of NHS number 873-28-7561?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 873-28-7561
What is the newest crime linked to a person who knows the holder of NHS number 873-28-7561?",What is the newest crime linked to a person who knows the holder of NHS number [x2.Person.nhs_no:873-28-7561]?,x2.Person.nhs_no:873-28-7561 = 873-28-7561,3,49,max,1
3063,What are the NHS numbers of individuals related to someone named John who shares a residence with another person?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""John"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = John
What are the NHS numbers of individuals related to someone named John who shares a residence with another person?",What are the NHS numbers of individuals related to someone named [x1.Person.name:John] who shares a residence with another person?,x1.Person.name:John = John,3,3,attribute_set,2
236,"Can you show the calls to 3-(285)553-8319 from August 18, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(285)553-8319"")
RETURN x0","[PhoneCall] = 18/08/2017
[Phone] = 3-(285)553-8319
Can you show the calls to 3-(285)553-8319 from August 18, 2017?",Can you show the calls to [x1.Phone.phoneNo:3-(285)553-8319] from [x0.PhoneCall.call_date:18/08/2017]?,"x0.PhoneCall.call_date:18/08/2017 = August 18, 2017 
x1.Phone.phoneNo:3-(285)553-8319 = 3-(285)553-8319",2,29,entity_set,1
358,How many phones got a call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall)
RETURN COUNT(DISTINCT x0)",How many phones got a call?,How many phones got a call?,,2,46,count,1
1126,"How many calls did phone number 1-(651)511-7559 get on August 8, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(651)511-7559"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 08/08/2017
[Phone] = 1-(651)511-7559
How many calls did phone number 1-(651)511-7559 get on August 8, 2017?",How many calls did phone number [x1.Phone.phoneNo:1-(651)511-7559] get on [x0.PhoneCall.call_date:08/08/2017]?,"x0.PhoneCall.call_date:08/08/2017 = August 8, 2017 
x1.Phone.phoneNo:1-(651)511-7559 = 1-(651)511-7559",2,150,count,1
1170,Can you show me the phones that had a call at 21:34?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""21:34"")
RETURN x0","[PhoneCall] = 21:34
Can you show me the phones that had a call at 21:34?",Can you show me the phones that had a call at [x1.PhoneCall.call_time:21:34]?,x1.PhoneCall.call_time:21:34 = 21:34,2,154,entity_set,2
4608,What number of residences belong to individuals connected to a crime?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",What number of residences belong to individuals connected to a crime?,What number of residences belong to individuals connected to a crime?,,3,73,count,1
541,How many offenses included Lincoln cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Lincoln"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Lincoln
How many offenses included Lincoln cars?",How many offenses included [x1.Vehicle.make:Lincoln] cars?,x1.Vehicle.make:Lincoln = Lincoln,2,70,count,1
1754,How many crimes included vehicles from 2011?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2011"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2011
How many crimes included vehicles from 2011?",How many crimes included vehicles from [x1.Vehicle.year:2011]?,x1.Vehicle.year:2011 = 2011,2,233,count,1
166,Which people have their phone numbers known by the holder of NHS number 444-91-2379?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""444-91-2379"")
RETURN x0","[Person] = 444-91-2379
Which people have their phone numbers known by the holder of NHS number 444-91-2379?",Which people have their phone numbers known by the holder of NHS number [x1.Person.nhs_no:444-91-2379]?,x1.Person.nhs_no:444-91-2379 = 444-91-2379,2,19,entity_set,1
2915,What is the first crime at 169 Thynne Street that included a Firebird vehicle?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""169 Thynne Street"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Firebird"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 169 Thynne Street
[Vehicle] = Firebird
What is the first crime at 169 Thynne Street that included a Firebird vehicle?",What is the first crime at [x2.Location.address:169 Thynne Street] that included a [x1.Vehicle.model:Firebird] vehicle?,"x1.Vehicle.model:Firebird = Firebird
x2.Location.address:169 Thynne Street = 169 Thynne Street",3,422,min,1
543,How often were Lincoln vehicles part of criminal activities?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Lincoln"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Lincoln
How often were Lincoln vehicles part of criminal activities?",How often were [x1.Vehicle.make:Lincoln] vehicles part of criminal activities?,x1.Vehicle.make:Lincoln = Lincoln,2,70,count,1
3386,What brands of vehicles were involved in a crime at the location with postcode M3 1SQ?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M3 1SQ"")
RETURN x0.make","[Location] = M3 1SQ
What brands of vehicles were involved in a crime at the location with postcode M3 1SQ?",What brands of vehicles were involved in a crime at the location with postcode [x2.Location.postcode:M3 1SQ]?,x2.Location.postcode:M3 1SQ = M3 1SQ,3,54,attribute_set,3
2342,How many violence and sexual offence cases are handled by officers surnamed Guyonneau?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Guyonneau"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Officer] = Guyonneau
How many violence and sexual offence cases are handled by officers surnamed Guyonneau?",How many [x0.Crime.type:Violence and sexual offences] are handled by officers surnamed [x1.Officer.surname:Guyonneau]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offence cases 
x1.Officer.surname:Guyonneau = Guyonneau",2,318,count,1
2622,What is the number of crime locations?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",What is the number of crime locations?,What is the number of crime locations?,,2,378,count,1
1974,"At 22:48, how many phone calls were made to any number?","MATCH (x0:PhoneCall WHERE x0.call_time = ""22:48"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 22:48
At 22:48, how many phone calls were made to any number?","At [x0.PhoneCall.call_time:22:48], how many phone calls were made to any number?",x0.PhoneCall.call_time:22:48 = 22:48,2,265,count,1
3068,Could you list the NHS numbers of people related with an Alan who cohabitates with another individual?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Alan"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Alan
Could you list the NHS numbers of people related with an Alan who cohabitates with another individual?",Could you list the NHS numbers of people related with an [x1.Person.name:Alan] who cohabitates with another individual?,x1.Person.name:Alan = Alan,3,3,attribute_set,2
256,Where do people surnamed Williams live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Williams"")
RETURN x0","[Person] = Williams
Where do people surnamed Williams live?",Where do people surnamed [x1.Person.surname:Williams] live?,x1.Person.surname:Williams = Williams,2,31,entity_set,1
626,Can you provide a list of 2011 vehicles linked to vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2011"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2011
[Crime] = Vehicle crime
Can you provide a list of 2011 vehicles linked to vehicle crimes?",Can you provide a list of [x0.Vehicle.year:2011] vehicles linked to [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2011 = 2011
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,52
2211,How many ongoing investigations are conducted by officers ranked as Police Constables?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = Police Constable
How many ongoing investigations are conducted by officers ranked as Police Constables?",How many [x0.Crime.last_outcome:Under investigation] are conducted by officers ranked as [x1.Officer.rank:Police Constable]?,"x0.Crime.last_outcome:Under investigation = ongoing investigations 
x1.Officer.rank:Police Constable = Police Constables",2,298,count,1
2026,Which post codes fall under the M44 area code?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M44"")
RETURN x0","[Area] = M44
Which post codes fall under the M44 area code?",Which post codes fall under the [x1.Area.areaCode:M44] area code?,x1.Area.areaCode:M44 = M44,2,272,entity_set,89
121,Who lives with Kevin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Kevin"")
RETURN x0","[Person] = Kevin
Who lives with Kevin?",Who lives with [x1.Person.name:Kevin]?,x1.Person.name:Kevin = Kevin,2,14,entity_set,2
3093,How many crimes are linked to someone surnamed Bailey who is friends with Raymond?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Bailey"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Raymond"")
RETURN COUNT(DISTINCT x0)","[Person] = Bailey
[Person] = Raymond
How many crimes are linked to someone surnamed Bailey who is friends with Raymond?",How many crimes are linked to someone surnamed [x1.Person.surname:Bailey] who is friends with [x2.Person.name:Raymond]?,"x1.Person.surname:Bailey = Bailey
x2.Person.name:Raymond = Raymond",3,7,count,1
399,"Can you name the Inspectors who handled investigations on August 4, 2017?","MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Officer] = Inspector
[Crime] = 4/08/2017
Can you name the Inspectors who handled investigations on August 4, 2017?",Can you name the [x0.Officer.rank:Inspector] who handled investigations on [x1.Crime.date:4/08/2017]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.date:4/08/2017 = August 4, 2017",2,52,entity_set,182
40,What Cadillac models have been involved in vehicle-related crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Cadillac
[Crime] = Vehicle crime
What Cadillac models have been involved in vehicle-related crimes?",What [x0.Vehicle.make:Cadillac] models have been involved in [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.make:Cadillac = Cadillac
x1.Crime.type:Vehicle crime = vehicle-related crimes",2,5,entity_set,23
394,"Who are the Police Constables that investigated crimes on August 20, 2017?","MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Officer] = Police Constable
[Crime] = 20/08/2017
Who are the Police Constables that investigated crimes on August 20, 2017?",Who are the [x0.Officer.rank:Police Constable] that investigated crimes on [x1.Crime.date:20/08/2017]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:20/08/2017 = August 20, 2017",2,52,entity_set,344
1402,How many 6-second calls did phone number 4-(881)045-9208 get?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""6"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""4-(881)045-9208"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 6
[Phone] = 4-(881)045-9208
How many 6-second calls did phone number 4-(881)045-9208 get?",How many [x0.PhoneCall.call_duration:6]-second calls did phone number [x1.Phone.phoneNo:4-(881)045-9208] get?,"x0.PhoneCall.call_duration:6 = 6
x1.Phone.phoneNo:4-(881)045-9208 = 4-(881)045-9208",2,184,count,1
3043,What's the newest offense connected to those who committed crimes on 08/19/2017?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""19/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 19/08/2017
What's the newest offense connected to those who committed crimes on 08/19/2017?",What's the newest offense connected to those who committed crimes on [x2.Crime.date:19/08/2017]?,x2.Crime.date:19/08/2017 = 08/19/2017,3,444,max,1
466,What crimes are associated with individuals with last name Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN x0","[Person] = Morales
What crimes are associated with individuals with last name Morales?",What crimes are associated with individuals with last name [x1.Person.surname:Morales]?,x1.Person.surname:Morales = Morales,2,61,entity_set,4
2062,Which people have connections to anyone bearing the surname Boyd?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN x0","[Person] = Boyd
Which people have connections to anyone bearing the surname Boyd?",Which people have connections to anyone bearing the surname [x1.Person.surname:Boyd]?,x1.Person.surname:Boyd = Boyd,2,277,entity_set,10
648,Who is the senior family member linked to someone familiar with a Harper's contact number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Harper"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Harper
Who is the senior family member linked to someone familiar with a Harper's contact number?",Who is the senior family member linked to someone familiar with a [x2.Person.surname:Harper]'s contact number?,x2.Person.surname:Harper = Harper,3,86,max,1
1794,Who is the senior-most person living among the Hernandezes?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Hernandez
Who is the senior-most person living among the Hernandezes?",Who is the senior-most person living among the [x1.Person.surname:Hernandez]?,x1.Person.surname:Hernandez = Hernandezes,2,237,max,1
1667,Which are the names of relatives of individuals with the last name Fuller?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Fuller"")
RETURN x0.name","[Person] = Fuller
Which are the names of relatives of individuals with the last name Fuller?",Which are the names of relatives of individuals with the last name [x1.Person.surname:Fuller]?,x1.Person.surname:Fuller = Fuller,2,219,attribute_set,6
3330,Can you provide the residential addresses of those acquainted with anyone named Denise?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Denise"")
RETURN x0.address","[Person] = Denise
Can you provide the residential addresses of those acquainted with anyone named Denise?",Can you provide the residential addresses of those acquainted with anyone named [x2.Person.name:Denise]?,x2.Person.name:Denise = Denise,3,42,attribute_set,8
1375,What is the total number of calls to 9-(074)489-3512?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""9-(074)489-3512"")
RETURN COUNT(DISTINCT x0)","[Phone] = 9-(074)489-3512
What is the total number of calls to 9-(074)489-3512?",What is the total number of calls to [x1.Phone.phoneNo:9-(074)489-3512]?,x1.Phone.phoneNo:9-(074)489-3512 = 9-(074)489-3512,2,181,count,1
1950,What is the number of Discovery models tied to criminal activities?,"MATCH (x0:Vehicle WHERE x0.model = ""Discovery"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Discovery
What is the number of Discovery models tied to criminal activities?",What is the number of [x0.Vehicle.model:Discovery] models tied to criminal activities?,x0.Vehicle.model:Discovery = Discovery,2,260,count,1
2782,When was the earliest crime involving Brooks' family members committed?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Brooks"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Brooks
When was the earliest crime involving Brooks' family members committed?",When was the earliest crime involving [x2.Person.surname:Brooks]' family members committed?,x2.Person.surname:Brooks = Brooks,3,405,argmin,1
486,Can you provide a list of vehicles connected to crimes from 26/08/2017 onward?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0","[Crime] = 26/08/2017
Can you provide a list of vehicles connected to crimes from 26/08/2017 onward?",Can you provide a list of vehicles connected to crimes from [x1.Crime.date:26/08/2017] onward?,x1.Crime.date:26/08/2017 = 26/08/2017,2,63,entity_set,36
1018,How many devices placed a call on 03/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""03/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 03/08/2017
How many devices placed a call on 03/08/2017?",How many devices placed a call on [x1.PhoneCall.call_date:03/08/2017]?,x1.PhoneCall.call_date:03/08/2017 = 03/08/2017,2,134,count,1
1413,How many emails are there for those named Victor?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Victor"")
RETURN COUNT(DISTINCT x0)","[Person] = Victor
How many emails are there for those named Victor?",How many emails are there for those named [x1.Person.name:Victor]?,x1.Person.name:Victor = Victor,2,187,count,1
2223,Can you show all calls to 0-(070)893-3322 from 12/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""12/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(070)893-3322"")
RETURN x0","[PhoneCall] = 12/08/2017
[Phone] = 0-(070)893-3322
Can you show all calls to 0-(070)893-3322 from 12/08/2017?",Can you show all calls to [x1.Phone.phoneNo:0-(070)893-3322] from [x0.PhoneCall.call_date:12/08/2017]?,"x0.PhoneCall.call_date:12/08/2017 = 12/08/2017
x1.Phone.phoneNo:0-(070)893-3322 = 0-(070)893-3322",2,300,entity_set,1
3126,What are the durations of calls received on 29/08/2017 by phones that dialed out on 20/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""20/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 29/08/2017
[PhoneCall] = 20/08/2017
What are the durations of calls received on 29/08/2017 by phones that dialed out on 20/08/2017?",What are the durations of calls received on [x0.PhoneCall.call_date:29/08/2017] by phones that dialed out on [x2.PhoneCall.call_date:20/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = 29/08/2017
x2.PhoneCall.call_date:20/08/2017 = 20/08/2017",3,11,attribute_set,2
857,What is the count of people named Ernest connected to crimes on 7/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Ernest"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Ernest
[Crime] = 7/08/2017
What is the count of people named Ernest connected to crimes on 7/08/2017?",What is the count of people named [x0.Person.name:Ernest] connected to crimes on [x1.Crime.date:7/08/2017]?,"x0.Person.name:Ernest = Ernest
x1.Crime.date:7/08/2017 = 7/08/2017",2,113,count,1
1454,What is the number of family members linked to the individual with NHS number 358-19-2542?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""358-19-2542"")
RETURN COUNT(DISTINCT x0)","[Person] = 358-19-2542
What is the number of family members linked to the individual with NHS number 358-19-2542?",What is the number of family members linked to the individual with NHS number [x1.Person.nhs_no:358-19-2542]?,x1.Person.nhs_no:358-19-2542 = 358-19-2542,2,191,count,1
1007,Which Inspectors have handled burglary investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Burglary"")
RETURN x0","[Officer] = Inspector
[Crime] = Burglary
Which Inspectors have handled burglary investigations?",Which [x0.Officer.rank:Inspector] have handled [x1.Crime.type:Burglary] investigations?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.type:Burglary = burglary",2,133,entity_set,609
3040,What's the email address of the person who has the phone number 3-(259)651-7024?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(259)651-7024"")
RETURN x0","[Phone] = 3-(259)651-7024
What's the email address of the person who has the phone number 3-(259)651-7024?",What's the email address of the person who has the phone number [x2.Phone.phoneNo:3-(259)651-7024]?,x2.Phone.phoneNo:3-(259)651-7024 = 3-(259)651-7024,3,442,entity_set,1
1195,How many offenses on 25/08/2017 involve someone with last name Ward?,"MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Ward"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Ward
How many offenses on 25/08/2017 involve someone with last name Ward?",How many offenses on [x0.Crime.date:25/08/2017] involve someone with last name [x1.Person.surname:Ward]?,"x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.surname:Ward = Ward",2,159,count,1
2032,"On 18/08/2017, what was the longest call time for phones that made calls?","MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 18/08/2017
On 18/08/2017, what was the longest call time for phones that made calls?","On [x2.PhoneCall.call_date:18/08/2017], what was the longest call time for phones that made calls?",x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,273,argmax,1
900,Which offenses took place on 1/08/2017 at 48 Barlow Lane?,"MATCH (x0:Crime WHERE x0.date = ""1/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""48 Barlow Lane"")
RETURN x0","[Crime] = 1/08/2017
[Location] = 48 Barlow Lane
Which offenses took place on 1/08/2017 at 48 Barlow Lane?",Which offenses took place on [x0.Crime.date:1/08/2017] at [x1.Location.address:48 Barlow Lane]?,"x0.Crime.date:1/08/2017 = 1/08/2017
x1.Location.address:48 Barlow Lane = 48 Barlow Lane",2,118,entity_set,1
2321,"Who are the individuals named Diana linked to crimes on August 25, 2017?","MATCH (x0:Person WHERE x0.name = ""Diana"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""25/08/2017"")
RETURN x0","[Person] = Diana
[Crime] = 25/08/2017
Who are the individuals named Diana linked to crimes on August 25, 2017?",Who are the individuals named [x0.Person.name:Diana] linked to crimes on [x1.Crime.date:25/08/2017]?,"x0.Person.name:Diana = Diana
x1.Crime.date:25/08/2017 = August 25, 2017",2,313,entity_set,1
3627,Can you provide the surnames of those who are friends with someone connected to a public order offense?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Public order"")
RETURN x0.surname","[Crime] = Public order
Can you provide the surnames of those who are friends with someone connected to a public order offense?",Can you provide the surnames of those who are friends with someone connected to a [x2.Crime.type:Public order] offense?,x2.Crime.type:Public order = public order,3,148,attribute_set,11
856,How many individuals named Ernest were linked to crimes on 7/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Ernest"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Ernest
[Crime] = 7/08/2017
How many individuals named Ernest were linked to crimes on 7/08/2017?",How many individuals named [x0.Person.name:Ernest] were linked to crimes on [x1.Crime.date:7/08/2017]?,"x0.Person.name:Ernest = Ernest
x1.Crime.date:7/08/2017 = 7/08/2017",2,113,count,1
1530,"On 15/08/2017, how many crimes involved Suburban 2500 vehicles?","MATCH (x0:Vehicle WHERE x0.model = ""Suburban 2500"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""15/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Suburban 2500
[Crime] = 15/08/2017
On 15/08/2017, how many crimes involved Suburban 2500 vehicles?","On [x1.Crime.date:15/08/2017], how many crimes involved [x0.Vehicle.model:Suburban 2500] vehicles?","x0.Vehicle.model:Suburban 2500 = Suburban 2500
x1.Crime.date:15/08/2017 = 15/08/2017",2,203,count,1
685,In how many places does someone named Ann live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Ann"")
RETURN COUNT(DISTINCT x0)","[Person] = Ann
In how many places does someone named Ann live?",In how many places does someone named [x1.Person.name:Ann] live?,x1.Person.name:Ann = Ann,2,90,count,1
719,Which places with the postcode SK15 2AL were crime scenes on 10/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""SK15 2AL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN x0","[Location] = SK15 2AL
[Crime] = 10/08/2017
Which places with the postcode SK15 2AL were crime scenes on 10/08/2017?",Which places with the postcode [x0.Location.postcode:SK15 2AL] were crime scenes on [x1.Crime.date:10/08/2017]?,"x0.Location.postcode:SK15 2AL = SK15 2AL
x1.Crime.date:10/08/2017 = 10/08/2017",2,96,entity_set,1
4381,Which are the types of the crimes on 7/08/2017 that involved a friend of the person holding NHS number 804-54-6976?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""804-54-6976"")
RETURN x0.type","[Crime] = 7/08/2017
[Person] = 804-54-6976
Which are the types of the crimes on 7/08/2017 that involved a friend of the person holding NHS number 804-54-6976?",Which are the types of the crimes on [x0.Crime.date:7/08/2017] that involved a friend of the person holding NHS number [x2.Person.nhs_no:804-54-6976]?,"x0.Crime.date:7/08/2017 = 7/08/2017
x2.Person.nhs_no:804-54-6976 = 804-54-6976",3,1,attribute_set,2
1509,Which crime happened first that includes those with the last name Harper?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Harper"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Harper
Which crime happened first that includes those with the last name Harper?",Which crime happened first that includes those with the last name [x1.Person.surname:Harper]?,x1.Person.surname:Harper = Harper,2,200,min,1
1142,What phones dialed out at 20:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""20:26"")
RETURN x0","[PhoneCall] = 20:26
What phones dialed out at 20:26?",What phones dialed out at [x1.PhoneCall.call_time:20:26]?,x1.PhoneCall.call_time:20:26 = 20:26,2,151,entity_set,1
1678,How often were 11-second calls placed to 9-(879)321-8806?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(879)321-8806"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
[Phone] = 9-(879)321-8806
How often were 11-second calls placed to 9-(879)321-8806?",How often were [x0.PhoneCall.call_duration:11]-second calls placed to [x1.Phone.phoneNo:9-(879)321-8806]?,"x0.PhoneCall.call_duration:11 = 11
x1.Phone.phoneNo:9-(879)321-8806 = 9-(879)321-8806",2,220,count,1
