id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
903,Which criminal activities were reported at 194 Beresford Street on 24/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""194 Beresford Street"")
RETURN x0","[Crime] = 24/08/2017
[Location] = 194 Beresford Street
Which criminal activities were reported at 194 Beresford Street on 24/08/2017?",Which criminal activities were reported at [x1.Location.address:194 Beresford Street] on [x0.Crime.date:24/08/2017]?,"x0.Crime.date:24/08/2017 = 24/08/2017
x1.Location.address:194 Beresford Street = 194 Beresford Street",2,118,entity_set,1
2803,What are the emails of the residents at 73 Grindrod Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""73 Grindrod Street"")
RETURN x0","[Location] = 73 Grindrod Street
What are the emails of the residents at 73 Grindrod Street?",What are the emails of the residents at [x2.Location.address:73 Grindrod Street]?,x2.Location.address:73 Grindrod Street = 73 Grindrod Street,3,408,entity_set,1
3018,What is the date of the most recent crime that happened at homes of people with last name Bennett?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Bennett"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Bennett
What is the date of the most recent crime that happened at homes of people with last name Bennett?",What is the date of the most recent crime that happened at homes of people with last name [x2.Person.surname:Bennett]?,x2.Person.surname:Bennett = Bennett,3,439,argmax,1
1587,What is the number of areas with the postcode M11 1AD?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""M11 1AD"")
RETURN COUNT(DISTINCT x0)","[PostCode] = M11 1AD
What is the number of areas with the postcode M11 1AD?",What is the number of areas with the postcode [x1.PostCode.code:M11 1AD]?,x1.PostCode.code:M11 1AD = M11 1AD,2,210,count,1
3177,What are the ranks of officers who investigated crimes with Grand Prix model vehicles?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Grand Prix"")
RETURN x0.rank","[Vehicle] = Grand Prix
What are the ranks of officers who investigated crimes with Grand Prix model vehicles?",What are the ranks of officers who investigated crimes with [x2.Vehicle.model:Grand Prix] model vehicles?,x2.Vehicle.model:Grand Prix = Grand Prix,3,19,attribute_set,7
4642,Where did crimes happen that Officer Tollerton investigated?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Tollerton"")
RETURN x0.address","[Officer] = Tollerton
Where did crimes happen that Officer Tollerton investigated?",Where did crimes happen that Officer [x2.Officer.surname:Tollerton] investigated?,x2.Officer.surname:Tollerton = Tollerton,3,93,attribute_set,38
2717,On what dates did crimes involving a family member with the last name Morales occur?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
On what dates did crimes involving a family member with the last name Morales occur?",On what dates did crimes involving a family member with the last name [x2.Person.surname:Morales] occur?,x2.Person.surname:Morales = Morales,3,393,attribute_set,7
2447,How many individuals reside with someone with last name Gibson?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Gibson"")
RETURN COUNT(DISTINCT x0)","[Person] = Gibson
How many individuals reside with someone with last name Gibson?",How many individuals reside with someone with last name [x1.Person.surname:Gibson]?,x1.Person.surname:Gibson = Gibson,2,338,count,1
3607,"Can you identify all spots in the WA15 zone where crimes occurred and were marked as ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""WA15"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = WA15
Can you identify all spots in the WA15 zone where crimes occurred and were marked as ""Investigation complete; no suspect identified""?","Can you identify all spots in the [x1.Area.areaCode:WA15] zone where crimes occurred and were marked as ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:WA15 = WA15
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,118
2058,Can you identify everyone who knows a person with the surname Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0","[Person] = Nguyen
Can you identify everyone who knows a person with the surname Nguyen?",Can you identify everyone who knows a person with the surname [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,277,entity_set,22
3156,What are the NHS numbers of Richards who are friends with someone living with another person?,"MATCH (x0:Person WHERE x0.name = ""Richard"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Richard
What are the NHS numbers of Richards who are friends with someone living with another person?",What are the NHS numbers of [x0.Person.name:Richard] who are friends with someone living with another person?,x0.Person.name:Richard = Richards,3,15,attribute_set,3
666,Which people are friends with those whose last name is Washington?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Washington"")
RETURN x0","[Person] = Washington
Which people are friends with those whose last name is Washington?",Which people are friends with those whose last name is [x1.Person.surname:Washington]?,x1.Person.surname:Washington = Washington,2,88,entity_set,6
498,How many offenses listed as Unable to prosecute suspect include an individual with the last name Robertson?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Person] = Robertson
How many offenses listed as Unable to prosecute suspect include an individual with the last name Robertson?",How many offenses listed as [x0.Crime.last_outcome:Unable to prosecute suspect] include an individual with the last name [x1.Person.surname:Robertson]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Person.surname:Robertson = Robertson",2,64,count,1
1340,Can you identify all Pontiac vehicles connected to crimes on 24/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN x0","[Vehicle] = Pontiac
[Crime] = 24/08/2017
Can you identify all Pontiac vehicles connected to crimes on 24/08/2017?",Can you identify all [x0.Vehicle.make:Pontiac] vehicles connected to crimes on [x1.Crime.date:24/08/2017]?,"x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.date:24/08/2017 = 24/08/2017",2,177,entity_set,1
3195,What are the surnames of individuals linked to crimes at post code BL1 8PZ?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 8PZ"")
RETURN x0.surname","[Location] = BL1 8PZ
What are the surnames of individuals linked to crimes at post code BL1 8PZ?",What are the surnames of individuals linked to crimes at post code [x2.Location.postcode:BL1 8PZ]?,x2.Location.postcode:BL1 8PZ = BL1 8PZ,3,21,attribute_set,1
3284,Can you identify the latest call to the phone of the individual with NHS number 468-82-3915?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""468-82-3915"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 468-82-3915
Can you identify the latest call to the phone of the individual with NHS number 468-82-3915?",Can you identify the latest call to the phone of the individual with NHS number [x2.Person.nhs_no:468-82-3915]?,x2.Person.nhs_no:468-82-3915 = 468-82-3915,3,36,max,1
3130,How many individuals are aware of the phone number for a person whose last name is Sullivan and has the email fsullivandl@eepurl.com?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Sullivan"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""fsullivandl@eepurl.com"")
RETURN COUNT(DISTINCT x0)","[Person] = Sullivan
[Email] = fsullivandl@eepurl.com
How many individuals are aware of the phone number for a person whose last name is Sullivan and has the email fsullivandl@eepurl.com?",How many individuals are aware of the phone number for a person whose last name is [x1.Person.surname:Sullivan] and has the email [x2.Email.email_address:fsullivandl@eepurl.com]?,"x1.Person.surname:Sullivan = Sullivan
x2.Email.email_address:fsullivandl@eepurl.com = fsullivandl@eepurl.com",3,12,count,1
792,"On 19/08/2017, how many criminal incidents were reported in OL2 6NL postcode locations?","MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL2 6NL"")
RETURN COUNT(DISTINCT x0)","[Crime] = 19/08/2017
[Location] = OL2 6NL
On 19/08/2017, how many criminal incidents were reported in OL2 6NL postcode locations?","On [x0.Crime.date:19/08/2017], how many criminal incidents were reported in [x1.Location.postcode:OL2 6NL] postcode locations?","x0.Crime.date:19/08/2017 = 19/08/2017
x1.Location.postcode:OL2 6NL = OL2 6NL",2,104,count,1
3157,Can you provide the NHS numbers for Richards who have friends living with others?,"MATCH (x0:Person WHERE x0.name = ""Richard"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Richard
Can you provide the NHS numbers for Richards who have friends living with others?",Can you provide the NHS numbers for [x0.Person.name:Richard]s who have friends living with others?,x0.Person.name:Richard = Richard,3,15,attribute_set,3
972,How many sites saw criminal activity on 23/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
How many sites saw criminal activity on 23/08/2017?",How many sites saw criminal activity on [x1.Crime.date:23/08/2017]?,x1.Crime.date:23/08/2017 = 23/08/2017,2,127,count,1
2923,What are the dates of criminal activities by those living at 189 Jopson Street?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0.date","[Location] = 189 Jopson Street
What are the dates of criminal activities by those living at 189 Jopson Street?",What are the dates of criminal activities by those living at [x2.Location.address:189 Jopson Street]?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,424,attribute_set,6
1994,What crimes occurred on 13/08/2017 that are being investigated by Police Constables?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 13/08/2017
[Officer] = Police Constable
What crimes occurred on 13/08/2017 that are being investigated by Police Constables?",What crimes occurred on [x0.Crime.date:13/08/2017] that are being investigated by [x1.Officer.rank:Police Constable]?,"x0.Crime.date:13/08/2017 = 13/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,349
3685,Can you identify the Cadillac models involved in investigations by the officer with badge 23-4315807?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""23-4315807"")
RETURN x0.model","[Vehicle] = Cadillac
[Officer] = 23-4315807
Can you identify the Cadillac models involved in investigations by the officer with badge 23-4315807?",Can you identify the [x0.Vehicle.make:Cadillac] models involved in investigations by the officer with badge [x2.Officer.badge_no:23-4315807]?,"x0.Vehicle.make:Cadillac = Cadillac
x2.Officer.badge_no:23-4315807 = 23-4315807",3,176,attribute_set,1
464,Can you provide a list of crimes linked to people with the surname Peters?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN x0","[Person] = Peters
Can you provide a list of crimes linked to people with the surname Peters?",Can you provide a list of crimes linked to people with the surname [x1.Person.surname:Peters]?,x1.Person.surname:Peters = Peters,2,61,entity_set,3
663,Which people are friends with those whose surname is Martin?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Martin"")
RETURN x0","[Person] = Martin
Which people are friends with those whose surname is Martin?",Which people are friends with those whose surname is [x1.Person.surname:Martin]?,x1.Person.surname:Martin = Martin,2,88,entity_set,3
604,"What is the total number of calls made to any phone on August 12, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""12/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 12/08/2017
What is the total number of calls made to any phone on August 12, 2017?",What is the total number of calls made to any phone on [x0.PhoneCall.call_date:12/08/2017]?,"x0.PhoneCall.call_date:12/08/2017 = August 12, 2017",2,79,count,1
2841,What is the most recent crime linked to the phone number 1-(111)459-3206?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 1-(111)459-3206
What is the most recent crime linked to the phone number 1-(111)459-3206?",What is the most recent crime linked to the phone number [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,414,max,1
907,How many individuals have a friend with surname Bradley?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Bradley"")
RETURN COUNT(DISTINCT x0)","[Person] = Bradley
How many individuals have a friend with surname Bradley?",How many individuals have a friend with surname [x1.Person.surname:Bradley]?,x1.Person.surname:Bradley = Bradley,2,119,count,1
496,How many crimes with a status of Unable to prosecute suspect involve someone with last name Robertson?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Person] = Robertson
How many crimes with a status of Unable to prosecute suspect involve someone with last name Robertson?",How many crimes with a status of [x0.Crime.last_outcome:Unable to prosecute suspect] involve someone with last name [x1.Person.surname:Robertson]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Person.surname:Robertson = Robertson",2,64,count,1
2754,Can you provide the emails of individuals familiar with a person whose NHS number is 838-11-7607?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""838-11-7607"")
RETURN x0","[Person] = 838-11-7607
Can you provide the emails of individuals familiar with a person whose NHS number is 838-11-7607?",Can you provide the emails of individuals familiar with a person whose NHS number is [x2.Person.nhs_no:838-11-7607]?,x2.Person.nhs_no:838-11-7607 = 838-11-7607,3,398,entity_set,4
1253,Can you provide a list of crimes on 22/08/2017 with Fit model cars involved?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Fit"")
RETURN x0","[Crime] = 22/08/2017
[Vehicle] = Fit
Can you provide a list of crimes on 22/08/2017 with Fit model cars involved?",Can you provide a list of crimes on [x0.Crime.date:22/08/2017] with [x1.Vehicle.model:Fit] model cars involved?,"x0.Crime.date:22/08/2017 = 22/08/2017
x1.Vehicle.model:Fit = Fit",2,167,entity_set,1
1186,What are the locations with the postcode OL3 5HP where crimes have been investigated but no suspect was found?,"MATCH (x0:Location WHERE x0.postcode = ""OL3 5HP"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Location] = OL3 5HP
[Crime] = Investigation complete; no suspect identified
What are the locations with the postcode OL3 5HP where crimes have been investigated but no suspect was found?",What are the locations with the postcode [x0.Location.postcode:OL3 5HP] where crimes have been [x1.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Location.postcode:OL3 5HP = OL3 5HP
x1.Crime.last_outcome:Investigation complete; no suspect identified = investigated but no suspect was found",2,158,entity_set,1
1433,How many offenses awaiting court decisions involve someone?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Awaiting court outcome"")-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Crime] = Awaiting court outcome
How many offenses awaiting court decisions involve someone?",How many [x0.Crime.last_outcome:Awaiting court outcome] involve someone?,x0.Crime.last_outcome:Awaiting court outcome = offenses awaiting court decisions,2,189,count,1
2639,How many MINI cars are linked to a vehicle crime probed by Officer Rings?,"MATCH (x0:Vehicle WHERE x0.model = ""MINI"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Rings"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = MINI
[Crime] = Vehicle crime
[Officer] = Rings
How many MINI cars are linked to a vehicle crime probed by Officer Rings?",How many [x0.Vehicle.model:MINI] cars are linked to a [x1.Crime.type:Vehicle crime] probed by Officer [x2.Officer.surname:Rings]?,"x0.Vehicle.model:MINI = MINI
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Rings = Rings",3,380,count,1
1431,How many offenses with the status Unable to prosecute suspect involve an individual?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
How many offenses with the status Unable to prosecute suspect involve an individual?",How many offenses with the status [x0.Crime.last_outcome:Unable to prosecute suspect] involve an individual?,x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,189,count,1
1965,How many mobile devices does the person with NHS ID 358-70-5810 have?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""358-70-5810"")
RETURN COUNT(DISTINCT x0)","[Person] = 358-70-5810
How many mobile devices does the person with NHS ID 358-70-5810 have?",How many mobile devices does the person with NHS ID [x1.Person.nhs_no:358-70-5810] have?,x1.Person.nhs_no:358-70-5810 = 358-70-5810,2,263,count,1
2220,Can you identify all ES model cars connected to incidents on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""ES"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN x0","[Vehicle] = ES
[Crime] = 11/08/2017
Can you identify all ES model cars connected to incidents on 11/08/2017?",Can you identify all [x0.Vehicle.model:ES] model cars connected to incidents on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.model:ES = ES
x1.Crime.date:11/08/2017 = 11/08/2017",2,299,entity_set,1
47,How many officers called Ashleigh investigated crimes that happened on  31/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Ashleigh"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Ashleigh
[Crime] = 31/08/2017
How many officers called Ashleigh investigated crimes that happened on  31/08/2017?",How many officers called [x0.Officer.name:Ashleigh] investigated crimes that happened on  [x1.Crime.date:31/08/2017]?,"x0.Officer.name:Ashleigh = Ashleigh
x1.Crime.date:31/08/2017 = 31/08/2017",2,6,count,1
1189,How many offenses on 19/08/2017 involve someone with last name Morales?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN COUNT(DISTINCT x0)","[Crime] = 19/08/2017
[Person] = Morales
How many offenses on 19/08/2017 involve someone with last name Morales?",How many offenses on [x0.Crime.date:19/08/2017] involve someone with last name [x1.Person.surname:Morales]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x1.Person.surname:Morales = Morales",2,159,count,1
1190,"On 19/08/2017, how many incidents involve a person with the surname Morales?","MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN COUNT(DISTINCT x0)","[Crime] = 19/08/2017
[Person] = Morales
On 19/08/2017, how many incidents involve a person with the surname Morales?","On [x0.Crime.date:19/08/2017], how many incidents involve a person with the surname [x1.Person.surname:Morales]?","x0.Crime.date:19/08/2017 = 19/08/2017
x1.Person.surname:Morales = Morales",2,159,count,1
44,How many officers called Margaret looked into crimes that happened on 30/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Margaret"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Margaret
[Crime] = 30/08/2017
How many officers called Margaret looked into crimes that happened on 30/08/2017?",How many officers called [x0.Officer.name:Margaret] looked into crimes that happened on [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Margaret = Margaret
x1.Crime.date:30/08/2017 = 30/08/2017",2,6,count,1
1109,Where can I find crime locations with the postcode M22 4ZB involving violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""M22 4ZB"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Location] = M22 4ZB
[Crime] = Violence and sexual offences
Where can I find crime locations with the postcode M22 4ZB involving violence and sexual offences?",Where can I find crime locations with the postcode [x0.Location.postcode:M22 4ZB] involving [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:M22 4ZB = M22 4ZB
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,146,entity_set,2
4409,What is the most recent vehicle used in a crime at 35 Back St George's Road North?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""35 Back St George'S Road North"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 35 Back St George'S Road North
What is the most recent vehicle used in a crime at 35 Back St George's Road North?",What is the most recent vehicle used in a crime at [x2.Location.address:35 Back St George'S Road North]?,x2.Location.address:35 Back St George'S Road North = 35 Back St George's Road North,3,12,max,1
1097,How often was 3-(965)714-5374 dialed?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(965)714-5374"")
RETURN COUNT(DISTINCT x0)","[Phone] = 3-(965)714-5374
How often was 3-(965)714-5374 dialed?",How often was [x1.Phone.phoneNo:3-(965)714-5374] dialed?,x1.Phone.phoneNo:3-(965)714-5374 = 3-(965)714-5374,2,145,count,1
1415,What's the count of emails linked to individuals named Scott?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Scott"")
RETURN COUNT(DISTINCT x0)","[Person] = Scott
What's the count of emails linked to individuals named Scott?",What's the count of emails linked to individuals named [x1.Person.name:Scott]?,x1.Person.name:Scott = Scott,2,187,count,1
3118,What are the oldest calls made to a phone that received a call at 08:20?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""08:20"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 08:20
What are the oldest calls made to a phone that received a call at 08:20?",What are the oldest calls made to a phone that received a call at [x2.PhoneCall.call_time:08:20]?,x2.PhoneCall.call_time:08:20 = 08:20,3,10,min,1
1323,How many districts feature locations with the postcode M4 7FN?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M4 7FN"")
RETURN COUNT(DISTINCT x0)","[Location] = M4 7FN
How many districts feature locations with the postcode M4 7FN?",How many districts feature locations with the postcode [x1.Location.postcode:M4 7FN]?,x1.Location.postcode:M4 7FN = M4 7FN,2,175,count,1
1792,Who is the oldest person sharing a home with the Murrays?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Murray
Who is the oldest person sharing a home with the Murrays?",Who is the oldest person sharing a home with the [x1.Person.surname:Murray]?,x1.Person.surname:Murray = Murrays,2,237,max,1
1214,How many individuals possess the phone number 5-(711)674-4929?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""5-(711)674-4929"")
RETURN COUNT(DISTINCT x0)","[Phone] = 5-(711)674-4929
How many individuals possess the phone number 5-(711)674-4929?",How many individuals possess the phone number [x1.Phone.phoneNo:5-(711)674-4929]?,x1.Phone.phoneNo:5-(711)674-4929 = 5-(711)674-4929,2,162,count,1
2769,Which vehicle-related offenses include Phillip and XT vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""XT"")
RETURN x0","[Crime] = Vehicle crime
[Person] = Phillip
[Vehicle] = XT
Which vehicle-related offenses include Phillip and XT vehicles?",Which [x0.Crime.type:Vehicle crime] include [x2.Person.name:Phillip] and [x1.Vehicle.model:XT] vehicles?,"x0.Crime.type:Vehicle crime = vehicle-related offenses 
x1.Vehicle.model:XT = XT
x2.Person.name:Phillip = Phillip",3,401,entity_set,1
1211,How many individuals possess the phone number 7-(263)287-1140?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""7-(263)287-1140"")
RETURN COUNT(DISTINCT x0)","[Phone] = 7-(263)287-1140
How many individuals possess the phone number 7-(263)287-1140?",How many individuals possess the phone number [x1.Phone.phoneNo:7-(263)287-1140]?,x1.Phone.phoneNo:7-(263)287-1140 = 7-(263)287-1140,2,162,count,1
2117,"How many Police Constables looked into crimes on August 17, 2017?","MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = 17/08/2017
How many Police Constables looked into crimes on August 17, 2017?",How many [x0.Officer.rank:Police Constable] looked into crimes on [x1.Crime.date:17/08/2017]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:17/08/2017 = August 17, 2017",2,286,count,1
664,Who are the friends of individuals with the last name Washington?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Washington"")
RETURN x0","[Person] = Washington
Who are the friends of individuals with the last name Washington?",Who are the friends of individuals with the last name [x1.Person.surname:Washington]?,x1.Person.surname:Washington = Washington,2,88,entity_set,6
1834,Which calls at 10:29 went to the number 5-(094)022-8985?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""10:29"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(094)022-8985"")
RETURN x0","[PhoneCall] = 10:29
[Phone] = 5-(094)022-8985
Which calls at 10:29 went to the number 5-(094)022-8985?",Which calls at [x0.PhoneCall.call_time:10:29] went to the number [x1.Phone.phoneNo:5-(094)022-8985]?,"x0.PhoneCall.call_time:10:29 = 10:29
x1.Phone.phoneNo:5-(094)022-8985 = 5-(094)022-8985",2,244,entity_set,1
3367,How many places with drug offenses involved people called Jack?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Drugs"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Jack"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Jack
How many places with drug offenses involved people called Jack?",How many places with [x1.Crime.type:Drugs] involved people called [x2.Person.name:Jack]?,"x1.Crime.type:Drugs = drug offenses 
x2.Person.name:Jack = Jack",3,47,count,1
320,"On 20/08/2017, how many times was 6-(438)031-8267 dialed?","MATCH (x0:PhoneCall WHERE x0.call_date = ""20/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(438)031-8267"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20/08/2017
[Phone] = 6-(438)031-8267
On 20/08/2017, how many times was 6-(438)031-8267 dialed?","On [x0.PhoneCall.call_date:20/08/2017], how many times was [x1.Phone.phoneNo:6-(438)031-8267] dialed?","x0.PhoneCall.call_date:20/08/2017 = 20/08/2017
x1.Phone.phoneNo:6-(438)031-8267 = 6-(438)031-8267",2,40,count,1
2135,Which phone call received by someone with last name Hamilton has the earliest date?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Hamilton"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Hamilton
Which phone call received by someone with last name Hamilton has the earliest date?",Which phone call received by someone with last name [x2.Person.surname:Hamilton] has the earliest date?,x2.Person.surname:Hamilton = Hamilton,3,288,min,1
1083,How many incidents on 2/08/2017 featured Suzuki vehicles?,"MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Suzuki"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Suzuki
How many incidents on 2/08/2017 featured Suzuki vehicles?",How many incidents on [x0.Crime.date:2/08/2017] featured [x1.Vehicle.make:Suzuki] vehicles?,"x0.Crime.date:2/08/2017 = 2/08/2017
x1.Vehicle.make:Suzuki = Suzuki",2,143,count,1
1522,How many locations with the postcode BL2 6PR experienced crimes on 28/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""BL2 6PR"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Location] = BL2 6PR
[Crime] = 28/08/2017
How many locations with the postcode BL2 6PR experienced crimes on 28/08/2017?",How many locations with the postcode [x0.Location.postcode:BL2 6PR] experienced crimes on [x1.Crime.date:28/08/2017]?,"x0.Location.postcode:BL2 6PR = BL2 6PR
x1.Crime.date:28/08/2017 = 28/08/2017",2,202,count,1
2693,In which areas do people surnamed White live?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""White"")
RETURN x0","[Person] = White
In which areas do people surnamed White live?",In which areas do people surnamed [x2.Person.surname:White] live?,x2.Person.surname:White = White,3,389,entity_set,2
2536,How many officers named Hansiain examined any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Hansiain"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Hansiain
How many officers named Hansiain examined any crimes?",How many officers named [x0.Officer.name:Hansiain] examined any crimes?,x0.Officer.name:Hansiain = Hansiain,2,354,count,1
725,Can you identify all crime sites with the postcode SK6 1HE on 16th August 2017?,"MATCH (x0:Location WHERE x0.postcode = ""SK6 1HE"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Location] = SK6 1HE
[Crime] = 16/08/2017
Can you identify all crime sites with the postcode SK6 1HE on 16th August 2017?",Can you identify all crime sites with the postcode [x0.Location.postcode:SK6 1HE] on [x1.Crime.date:16/08/2017]?,"x0.Location.postcode:SK6 1HE = SK6 1HE
x1.Crime.date:16/08/2017 = 16th August 2017",2,96,entity_set,1
883,What are the emails of individuals with the NHS number 820-53-4909?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""820-53-4909"")
RETURN x0","[Person] = 820-53-4909
What are the emails of individuals with the NHS number 820-53-4909?",What are the emails of individuals with the NHS number [x1.Person.nhs_no:820-53-4909]?,x1.Person.nhs_no:820-53-4909 = 820-53-4909,2,116,entity_set,1
