id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1639,What is the latest date a crime took place at 45 Cherry Tree Lane and was probed by an officer with the surname Dureden?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Dureden"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""45 Cherry Tree Lane"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = Dureden
[Location] = 45 Cherry Tree Lane
What is the latest date a crime took place at 45 Cherry Tree Lane and was probed by an officer with the surname Dureden?",What is the latest date a crime took place at [x1.Location.address:45 Cherry Tree Lane] and was probed by an officer with the surname [x2.Officer.surname:Dureden]?,"x1.Location.address:45 Cherry Tree Lane = 45 Cherry Tree Lane
x2.Officer.surname:Dureden = Dureden",3,216,argmax,1
1404,How many calls of 6 seconds were made to 4-(881)045-9208?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""6"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""4-(881)045-9208"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 6
[Phone] = 4-(881)045-9208
How many calls of 6 seconds were made to 4-(881)045-9208?",How many calls of [x0.PhoneCall.call_duration:6] seconds were made to [x1.Phone.phoneNo:4-(881)045-9208]?,"x0.PhoneCall.call_duration:6 = 6
x1.Phone.phoneNo:4-(881)045-9208 = 4-(881)045-9208",2,184,count,1
14,How many crimes marked as Under investigation are being handled by officers with surname Yukhnevich?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Yukhnevich"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = Yukhnevich
How many crimes marked as Under investigation are being handled by officers with surname Yukhnevich?",How many crimes marked as [x0.Crime.last_outcome:Under investigation] are being handled by officers with surname [x1.Officer.surname:Yukhnevich]?,"x0.Crime.last_outcome:Under investigation = Under investigation
x1.Officer.surname:Yukhnevich = Yukhnevich",2,2,count,1
3290,Can you identify the most recent vehicle crime at M9 6DA?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M9 6DA"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = M9 6DA
Can you identify the most recent vehicle crime at M9 6DA?",Can you identify the most recent vehicle crime at [x1.Location.postcode:M9 6DA]?,x1.Location.postcode:M9 6DA = M9 6DA,3,37,max,1
1361,Can you identify 2011 vehicles connected to a crime on 20th August 2017?,"MATCH (x0:Vehicle WHERE x0.year = ""2011"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Vehicle] = 2011
[Crime] = 20/08/2017
Can you identify 2011 vehicles connected to a crime on 20th August 2017?",Can you identify [x0.Vehicle.year:2011] vehicles connected to a crime on [x1.Crime.date:20/08/2017]?,"x0.Vehicle.year:2011 = 2011
x1.Crime.date:20/08/2017 = 20th August 2017",2,179,entity_set,1
4531,What is the initial crime connected to a family member of someone named Jessica?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.name = ""Jessica"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Jessica
What is the initial crime connected to a family member of someone named Jessica?",What is the initial crime connected to a family member of someone named [x2.Person.name:Jessica]?,x2.Person.name:Jessica = Jessica,3,51,max,1
1976,Which officers named Angelita investigated crimes marked as Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Angelita"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Officer] = Angelita
[Crime] = Unable to prosecute suspect
Which officers named Angelita investigated crimes marked as Unable to prosecute suspect?",Which officers named [x0.Officer.name:Angelita] investigated crimes marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Angelita = Angelita
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,266,entity_set,3
2551,Who are the individuals related by family?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)
RETURN x0",Who are the individuals related by family?,Who are the individuals related by family?,,2,356,entity_set,310
843,How many years has the youngest person living with a Baker been alive?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Baker"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Baker
How many years has the youngest person living with a Baker been alive?",How many years has the youngest person living with a [x1.Person.surname:Baker] been alive?,x1.Person.surname:Baker = Baker,2,111,argmin,1
2983,Which crime did friends of the Robinson family most recently get involved in?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Robinson"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Robinson
Which crime did friends of the Robinson family most recently get involved in?",Which crime did friends of the [x2.Person.surname:Robinson] family most recently get involved in?,x2.Person.surname:Robinson = Robinson,3,432,max,1
672,What number of crimes happened at 116 China Lane?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""116 China Lane"")
RETURN COUNT(DISTINCT x0)","[Location] = 116 China Lane
What number of crimes happened at 116 China Lane?",What number of crimes happened at [x1.Location.address:116 China Lane]?,x1.Location.address:116 China Lane = 116 China Lane,2,89,count,1
1718,How many Jennifers reside with individuals whose last name is Hawkins?,"MATCH (x0:Person WHERE x0.name = ""Jennifer"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hawkins"")
RETURN COUNT(DISTINCT x0)","[Person] = Jennifer
[Person] = Hawkins
How many Jennifers reside with individuals whose last name is Hawkins?",How many [x0.Person.name:Jennifer] reside with individuals whose last name is [x1.Person.surname:Hawkins]?,"x0.Person.name:Jennifer = Jennifers
x1.Person.surname:Hawkins = Hawkins",2,226,count,1
4606,Could you list the phones of people who are friends of Brian?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0","[Person] = Brian
Could you list the phones of people who are friends of Brian?",Could you list the phones of people who are friends of [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,71,entity_set,9
3108,How many places do people with an email live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_EMAIL]-(x2:Email)
RETURN COUNT(DISTINCT x0)",How many places do people with an email live?,How many places do people with an email live?,,3,9,count,1
2201,Who knows the phone number of someone with surname Armstrong?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Armstrong"")
RETURN COUNT(DISTINCT x0)","[Person] = Armstrong
Who knows the phone number of someone with surname Armstrong?",Who knows the phone number of someone with surname [x1.Person.surname:Armstrong]?,x1.Person.surname:Armstrong = Armstrong,2,297,count,1
3251,How many people have friends involved in illegal activities?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",How many people have friends involved in illegal activities?,How many people have friends involved in illegal activities?,,3,31,count,1
3051,What are the phone numbers of individuals linked to a crime?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0.phoneNo",What are the phone numbers of individuals linked to a crime?,What are the phone numbers of individuals linked to a crime?,,3,0,attribute_set,53
1841,How many locations with the postcode WN6 7HD had crimes of violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""WN6 7HD"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = WN6 7HD
[Crime] = Violence and sexual offences
How many locations with the postcode WN6 7HD had crimes of violence and sexual offences?",How many locations with the postcode [x0.Location.postcode:WN6 7HD] had crimes of [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:WN6 7HD = WN6 7HD
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,246,count,1
3399,When did crimes occur that involve a person residing with someone with last name Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
When did crimes occur that involve a person residing with someone with last name Morales?",When did crimes occur that involve a person residing with someone with last name [x2.Person.surname:Morales]?,x2.Person.surname:Morales = Morales,3,55,attribute_set,10
2763,"What is the email count for Christopher, who is related to a Murray?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Christopher"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Murray
What is the email count for Christopher, who is related to a Murray?","What is the email count for [x1.Person.name:Christopher], who is related to a [x2.Person.surname:Murray]?","x1.Person.name:Christopher = Christopher
x2.Person.surname:Murray = Murray",3,400,count,1
1311,When did officers with the surname Shakesby last handle a case involving E250 vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""E250"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Shakesby"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = E250
[Officer] = Shakesby
When did officers with the surname Shakesby last handle a case involving E250 vehicles?",When did officers with the surname [x1.Officer.surname:Shakesby] last handle a case involving [x2.Vehicle.model:E250] vehicles?,"x1.Officer.surname:Shakesby = Shakesby
x2.Vehicle.model:E250 = E250",3,173,argmax,1
3573,What are the last names of friends of Amanda who is linked to a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Amanda"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Amanda
What are the last names of friends of Amanda who is linked to a crime?",What are the last names of friends of [x1.Person.name:Amanda] who is linked to a crime?,x1.Person.name:Amanda = Amanda,3,119,attribute_set,7
3332,Who resides in the BL4 area code?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""BL4"")
RETURN x0","[Area] = BL4
Who resides in the BL4 area code?",Who resides in the [x2.Area.areaCode:BL4] area code?,x2.Area.areaCode:BL4 = BL4,3,43,entity_set,8
978,What number of locations saw criminal activity on 12/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""12/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 12/08/2017
What number of locations saw criminal activity on 12/08/2017?",What number of locations saw criminal activity on [x1.Crime.date:12/08/2017]?,x1.Crime.date:12/08/2017 = 12/08/2017,2,127,count,1
2379,In which area is the address Petrol Station located?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0","[Location] = Petrol Station
In which area is the address Petrol Station located?",In which area is the address [x1.Location.address:Petrol Station] located?,x1.Location.address:Petrol Station = Petrol Station,2,328,entity_set,124
98,"How many Volkswagens were linked to crimes on August 1, 2017?","MATCH (x0:Vehicle WHERE x0.make = ""Volkswagen"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""1/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Volkswagen
[Crime] = 1/08/2017
How many Volkswagens were linked to crimes on August 1, 2017?",How many [x0.Vehicle.make:Volkswagen]s were linked to crimes on [x1.Crime.date:1/08/2017]?,"x0.Vehicle.make:Volkswagen = Volkswagen
x1.Crime.date:1/08/2017 = August 1, 2017",2,12,count,1
2597,When did an officer with last name Joskowicz first investigate a crime?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Joskowicz"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Joskowicz
When did an officer with last name Joskowicz first investigate a crime?",When did an officer with last name [x1.Officer.surname:Joskowicz] first investigate a crime?,x1.Officer.surname:Joskowicz = Joskowicz,2,367,argmin,1
503,Which officers handled cases involving violence and sexual offences?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Crime] = Violence and sexual offences
Which officers handled cases involving violence and sexual offences?",Which officers handled cases involving [x1.Crime.type:Violence and sexual offences]?,x1.Crime.type:Violence and sexual offences = violence and sexual offences,2,65,entity_set,8765
3112,What are the oldest calls made to a phone that received a call at 11:08?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""11:08"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 11:08
What are the oldest calls made to a phone that received a call at 11:08?",What are the oldest calls made to a phone that received a call at [x2.PhoneCall.call_time:11:08]?,x2.PhoneCall.call_time:11:08 = 11:08,3,10,min,1
144,What's the earliest call made to phones that dialed on 30/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""30/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 30/08/2017
What's the earliest call made to phones that dialed on 30/08/2017?",What's the earliest call made to phones that dialed on [x2.PhoneCall.call_date:30/08/2017]?,x2.PhoneCall.call_date:30/08/2017 = 30/08/2017,3,17,min,1
359,What number of phones had an incoming call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall)
RETURN COUNT(DISTINCT x0)",What number of phones had an incoming call?,What number of phones had an incoming call?,,2,46,count,1
1693,"On August 17, 2017, how many crimes happened at 141 Dominic Close?","MATCH (x0:Crime WHERE x0.date = ""17/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""141 Dominic Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = 17/08/2017
[Location] = 141 Dominic Close
On August 17, 2017, how many crimes happened at 141 Dominic Close?","On [x0.Crime.date:17/08/2017], how many crimes happened at [x1.Location.address:141 Dominic Close]?","x0.Crime.date:17/08/2017 = August 17, 2017 
x1.Location.address:141 Dominic Close = 141 Dominic Close",2,223,count,1
3361,How many locations had vehicle crimes involving someone named Amy,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Amy
How many locations had vehicle crimes involving someone named Amy",How many locations had [x1.Crime.type:Vehicle crime] involving someone named [x2.Person.name:Amy],"x1.Crime.type:Vehicle crime = vehicle crimes
x2.Person.name:Amy = Amy",3,47,count,1
3663,What are the last names of those who know the phone number of someone sharing a home with Ruby?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Ruby"")
RETURN x0.surname","[Person] = Ruby
What are the last names of those who know the phone number of someone sharing a home with Ruby?",What are the last names of those who know the phone number of someone sharing a home with [x2.Person.name:Ruby]?,x2.Person.name:Ruby = Ruby,3,166,attribute_set,1
3199,Can you provide the last names of those connected to offenses at BL1 6RN?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 6RN"")
RETURN x0.surname","[Location] = BL1 6RN
Can you provide the last names of those connected to offenses at BL1 6RN?",Can you provide the last names of those connected to offenses at [x2.Location.postcode:BL1 6RN]?,x2.Location.postcode:BL1 6RN = BL1 6RN,3,21,attribute_set,1
1179,Can you provide a list of violence and sexual offences investigated by the officer whose badge number is 76-8953443?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""76-8953443"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = 76-8953443
Can you provide a list of violence and sexual offences investigated by the officer whose badge number is 76-8953443?",Can you provide a list of [x0.Crime.type:Violence and sexual offences] investigated by the officer whose badge number is [x1.Officer.badge_no:76-8953443]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Officer.badge_no:76-8953443 = 76-8953443",2,156,entity_set,9
746,What are the locations with postcode M27 0JU where someone named Ralph resides?,"MATCH (x0:Location WHERE x0.postcode = ""M27 0JU"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Ralph"")
RETURN x0","[Location] = M27 0JU
[Person] = Ralph
What are the locations with postcode M27 0JU where someone named Ralph resides?",What are the locations with postcode [x0.Location.postcode:M27 0JU] where someone named [x1.Person.name:Ralph] resides?,"x0.Location.postcode:M27 0JU = M27 0JU
x1.Person.name:Ralph = Ralph",2,99,entity_set,1
3009,How many Pontiac cars were linked to crimes on 25/08/2017 in places with the M20 2QZ postcode?,"MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""25/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M20 2QZ"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Pontiac
[Crime] = 25/08/2017
[Location] = M20 2QZ
How many Pontiac cars were linked to crimes on 25/08/2017 in places with the M20 2QZ postcode?",How many [x0.Vehicle.make:Pontiac] cars were linked to crimes on [x1.Crime.date:25/08/2017] in places with the [x2.Location.postcode:M20 2QZ] postcode?,"x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.date:25/08/2017 = 25/08/2017
x2.Location.postcode:M20 2QZ = M20 2QZ",3,436,count,1
625,Which vehicles from 2011 were involved in vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2011"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2011
[Crime] = Vehicle crime
Which vehicles from 2011 were involved in vehicle crimes?",Which vehicles from [x0.Vehicle.year:2011] were involved in [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2011 = 2011
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,52
973,How many places experienced crimes on 28/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 28/08/2017
How many places experienced crimes on 28/08/2017?",How many places experienced crimes on [x1.Crime.date:28/08/2017]?,x1.Crime.date:28/08/2017 = 28/08/2017,2,127,count,1
1860,What is the number of phones owned by individuals with the surname Rose?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Rose"")
RETURN COUNT(DISTINCT x0)","[Person] = Rose
What is the number of phones owned by individuals with the surname Rose?",What is the number of phones owned by individuals with the surname [x1.Person.surname:Rose]?,x1.Person.surname:Rose = Rose,2,249,count,1
131,What is the count of emails associated with NHS number 694-00-4113?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""694-00-4113"")
RETURN COUNT(DISTINCT x0)","[Person] = 694-00-4113
What is the count of emails associated with NHS number 694-00-4113?",What is the count of emails associated with NHS number [x1.Person.nhs_no:694-00-4113]?,x1.Person.nhs_no:694-00-4113 = 694-00-4113,2,15,count,1
3674,What are the NHS numbers of individuals linked to someone living in the M33 3WE postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M33 3WE"")
RETURN x0.nhs_no","[Location] = M33 3WE
What are the NHS numbers of individuals linked to someone living in the M33 3WE postcode?",What are the NHS numbers of individuals linked to someone living in the [x2.Location.postcode:M33 3WE] postcode?,x2.Location.postcode:M33 3WE = M33 3WE,3,172,attribute_set,2
3468,Can you identify the earliest phone call received by Frances?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Frances"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Frances
Can you identify the earliest phone call received by Frances?",Can you identify the earliest phone call received by [x2.Person.name:Frances]?,x2.Person.name:Frances = Frances,3,82,min,1
3460,"On August 29, 2017, when did a call come in for someone with the last name Gordon?","MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gordon"")
RETURN x0.call_time","[PhoneCall] = 29/08/2017
[Person] = Gordon
On August 29, 2017, when did a call come in for someone with the last name Gordon?","On [x0.PhoneCall.call_date:29/08/2017], when did a call come in for someone with the last name [x2.Person.surname:Gordon]?","x0.PhoneCall.call_date:29/08/2017 = August 29, 2017 
x2.Person.surname:Gordon = Gordon",3,77,attribute_set,1
3329,What are the home addresses of individuals known by anyone named Denise?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Denise"")
RETURN x0.address","[Person] = Denise
What are the home addresses of individuals known by anyone named Denise?",What are the home addresses of individuals known by anyone named [x2.Person.name:Denise]?,x2.Person.name:Denise = Denise,3,42,attribute_set,8
2359,Can you name the officers who probed any crimes?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)
RETURN x0",Can you name the officers who probed any crimes?,Can you name the officers who probed any crimes?,,2,322,entity_set,28762
2861,How often do Inspectors investigate crimes involving individuals with the last name Hughes?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Inspector"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
[Person] = Hughes
How often do Inspectors investigate crimes involving individuals with the last name Hughes?",How often do [x2.Officer.rank:Inspector] investigate crimes involving individuals with the last name [x1.Person.surname:Hughes]?,"x1.Person.surname:Hughes = Hughes
x2.Officer.rank:Inspector = Inspectors",3,416,count,1
2737,Who is the senior-most family member connected to a friend of a Duncan?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Duncan"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Duncan
Who is the senior-most family member connected to a friend of a Duncan?",Who is the senior-most family member connected to a friend of a [x2.Person.surname:Duncan]?,x2.Person.surname:Duncan = Duncan,3,396,max,1
1194,How many incidents on 23/08/2017 include individuals with the last name Martinez?,"MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
[Person] = Martinez
How many incidents on 23/08/2017 include individuals with the last name Martinez?",How many incidents on [x0.Crime.date:23/08/2017] include individuals with the last name [x1.Person.surname:Martinez]?,"x0.Crime.date:23/08/2017 = 23/08/2017
x1.Person.surname:Martinez = Martinez",2,159,count,1
2469,How many postal codes are there in any region?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area)
RETURN COUNT(DISTINCT x0)",How many postal codes are there in any region?,How many postal codes are there in any region?,,2,342,count,1
3609,"Which places in OL11 experienced crimes that ended with ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL11"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = OL11
Which places in OL11 experienced crimes that ended with ""Investigation complete; no suspect identified""?","Which places in [x1.Area.areaCode:OL11] experienced crimes that ended with ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:OL11 = OL11
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,256
1700,What are the residences at 57 Linden Avenue for individuals with surname Cooper?,"MATCH (x0:Location WHERE x0.address = ""57 Linden Avenue"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Cooper"")
RETURN x0","[Location] = 57 Linden Avenue
[Person] = Cooper
What are the residences at 57 Linden Avenue for individuals with surname Cooper?",What are the residences at [x0.Location.address:57 Linden Avenue] for individuals with surname [x1.Person.surname:Cooper]?,"x0.Location.address:57 Linden Avenue = 57 Linden Avenue
x1.Person.surname:Cooper = Cooper",2,224,entity_set,1
2118,"On August 17, 2017, how many Police Constables were involved in crime investigations?","MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = 17/08/2017
On August 17, 2017, how many Police Constables were involved in crime investigations?","On [x1.Crime.date:17/08/2017], how many [x0.Officer.rank:Police Constable] were involved in crime investigations?","x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:17/08/2017 = August 17, 2017",2,286,count,1
1313,How many 18:05 calls were directed to 6-(622)025-5648?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""18:05"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""6-(622)025-5648"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18:05
[Phone] = 6-(622)025-5648
How many 18:05 calls were directed to 6-(622)025-5648?",How many [x0.PhoneCall.call_time:18:05] calls were directed to [x1.Phone.phoneNo:6-(622)025-5648]?,"x0.PhoneCall.call_time:18:05 = 18:05
x1.Phone.phoneNo:6-(622)025-5648 = 6-(622)025-5648",2,174,count,1
1901,"How many 2001 vehicles were linked to crimes on August 21, 2017?","MATCH (x0:Vehicle WHERE x0.year = ""2001"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""21/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
[Crime] = 21/08/2017
How many 2001 vehicles were linked to crimes on August 21, 2017?",How many [x0.Vehicle.year:2001] vehicles were linked to crimes on [x1.Crime.date:21/08/2017]?,"x0.Vehicle.year:2001 = 2001
x1.Crime.date:21/08/2017 = August 21, 2017",2,253,count,1
1409,How many calls of 88 seconds were made to 0-(521)287-3218?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""88"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(521)287-3218"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 88
[Phone] = 0-(521)287-3218
How many calls of 88 seconds were made to 0-(521)287-3218?",How many calls of [x0.PhoneCall.call_duration:88] seconds were made to [x1.Phone.phoneNo:0-(521)287-3218]?,"x0.PhoneCall.call_duration:88 = 88
x1.Phone.phoneNo:0-(521)287-3218 = 0-(521)287-3218",2,184,count,1
615,How many officers examined incidents from 5/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""5/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 5/08/2017
How many officers examined incidents from 5/08/2017?",How many officers examined incidents from [x1.Crime.date:5/08/2017]?,x1.Crime.date:5/08/2017 = 5/08/2017,2,80,count,1
2057,Who are the individuals acquainted with someone with last name Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0","[Person] = Nguyen
Who are the individuals acquainted with someone with last name Nguyen?",Who are the individuals acquainted with someone with last name [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,277,entity_set,22
1865,How many phones does someone with last name Oliver own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Oliver"")
RETURN COUNT(DISTINCT x0)","[Person] = Oliver
How many phones does someone with last name Oliver own?",How many phones does someone with last name [x1.Person.surname:Oliver] own?,x1.Person.surname:Oliver = Oliver,2,249,count,1
3151,Can you provide the NHS numbers for people named Benjamin who have friends with roommates?,"MATCH (x0:Person WHERE x0.name = ""Benjamin"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Benjamin
Can you provide the NHS numbers for people named Benjamin who have friends with roommates?",Can you provide the NHS numbers for people named [x0.Person.name:Benjamin] who have friends with roommates?,x0.Person.name:Benjamin = Benjamin,3,15,attribute_set,4
239,"Can you show the calls to 6-(513)403-4733 from August 15, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""15/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(513)403-4733"")
RETURN x0","[PhoneCall] = 15/08/2017
[Phone] = 6-(513)403-4733
Can you show the calls to 6-(513)403-4733 from August 15, 2017?",Can you show the calls to [x1.Phone.phoneNo:6-(513)403-4733] from [x0.PhoneCall.call_date:15/08/2017]?,"x0.PhoneCall.call_date:15/08/2017 = August 15, 2017 
x1.Phone.phoneNo:6-(513)403-4733 = 6-(513)403-4733",2,29,entity_set,1
4628,What's the first crime involving someone who knows Melissa's phone number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Melissa"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Melissa
What's the first crime involving someone who knows Melissa's phone number?",What's the first crime involving someone who knows [x2.Person.name:Melissa]'s phone number?,x2.Person.name:Melissa = Melissa,3,89,min,1
1897,"What number of vehicles from 1992 were implicated in crimes on August 10, 2017?","MATCH (x0:Vehicle WHERE x0.year = ""1992"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1992
[Crime] = 10/08/2017
What number of vehicles from 1992 were implicated in crimes on August 10, 2017?",What number of vehicles from [x0.Vehicle.year:1992] were implicated in crimes on [x1.Crime.date:10/08/2017]?,"x0.Vehicle.year:1992 = 1992
x1.Crime.date:10/08/2017 = August 10, 2017",2,253,count,1
3465,Can you identify the earliest call that Kevin got?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Kevin"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Kevin
Can you identify the earliest call that Kevin got?",Can you identify the earliest call that [x2.Person.name:Kevin] got?,x2.Person.name:Kevin = Kevin,3,82,min,1
941,What is the count of crimes at 167 Barton Road with the status Unable to prosecute suspect?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""167 Barton Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = 167 Barton Road
What is the count of crimes at 167 Barton Road with the status Unable to prosecute suspect?",What is the count of crimes at [x1.Location.address:167 Barton Road] with the status [x0.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.address:167 Barton Road = 167 Barton Road",2,122,count,1
