id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1979,Which officers named Aldric investigated crimes marked as Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Aldric"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Officer] = Aldric
[Crime] = Unable to prosecute suspect
Which officers named Aldric investigated crimes marked as Unable to prosecute suspect?",Which officers named [x0.Officer.name:Aldric] investigated crimes marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Aldric = Aldric
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,266,entity_set,7
2064,Can you identify everyone familiar with a person whose last name is Moreno?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Moreno"")
RETURN x0","[Person] = Moreno
Can you identify everyone familiar with a person whose last name is Moreno?",Can you identify everyone familiar with a person whose last name is [x1.Person.surname:Moreno]?,x1.Person.surname:Moreno = Moreno,2,277,entity_set,13
4548,Can you provide the NHS numbers for those acquainted with a relative of a person with the last name Nichols?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Nichols"")
RETURN x0.nhs_no","[Person] = Nichols
Can you provide the NHS numbers for those acquainted with a relative of a person with the last name Nichols?",Can you provide the NHS numbers for those acquainted with a relative of a person with the last name [x2.Person.surname:Nichols]?,x2.Person.surname:Nichols = Nichols,3,56,attribute_set,9
1294,How many 2-second calls were received by any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""2"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 2
How many 2-second calls were received by any phone?",How many [x0.PhoneCall.call_duration:2]-second calls were received by any phone?,x0.PhoneCall.call_duration:2 = 2,2,172,count,1
2121,What number of Police Constables probed crimes on 31st August 2017?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = 31/08/2017
What number of Police Constables probed crimes on 31st August 2017?",What number of [x0.Officer.rank:Police Constable] probed crimes on [x1.Crime.date:31/08/2017]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:31/08/2017 = 31st August 2017",2,286,count,1
1072,How many phones does someone named Richard own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Richard"")
RETURN COUNT(DISTINCT x0)","[Person] = Richard
How many phones does someone named Richard own?",How many phones does someone named [x1.Person.name:Richard] own?,x1.Person.name:Richard = Richard,2,142,count,1
446,"Which officers handled cases with the status ""Investigation complete; no suspect identified""?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
Which officers handled cases with the status ""Investigation complete; no suspect identified""?","Which officers handled cases with the status ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?",x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified,2,59,entity_set,17087
3393,Which vehicle brands were linked to a crime at the address with postcode M12 4WZ?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M12 4WZ"")
RETURN x0.make","[Location] = M12 4WZ
Which vehicle brands were linked to a crime at the address with postcode M12 4WZ?",Which vehicle brands were linked to a crime at the address with postcode [x2.Location.postcode:M12 4WZ]?,x2.Location.postcode:M12 4WZ = M12 4WZ,3,54,attribute_set,1
3665,What are the surnames of people whose phone number is known by a person living with Harry?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Harry"")
RETURN x0.surname","[Person] = Harry
What are the surnames of people whose phone number is known by a person living with Harry?",What are the surnames of people whose phone number is known by a person living with [x2.Person.name:Harry]?,x2.Person.name:Harry = Harry,3,166,attribute_set,4
4551,Can you provide the NHS numbers for those acquainted with a family member of a Fields?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Fields"")
RETURN x0.nhs_no","[Person] = Fields
Can you provide the NHS numbers for those acquainted with a family member of a Fields?",Can you provide the NHS numbers for those acquainted with a family member of a [x2.Person.surname:Fields]?,x2.Person.surname:Fields = Fields,3,56,attribute_set,16
1246,"How many crimes on August 31, 2017, were investigated by officers surnamed Taks?","MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Taks"")
RETURN COUNT(DISTINCT x0)","[Crime] = 31/08/2017
[Officer] = Taks
How many crimes on August 31, 2017, were investigated by officers surnamed Taks?","How many crimes on [x0.Crime.date:31/08/2017], were investigated by officers surnamed [x1.Officer.surname:Taks]?","x0.Crime.date:31/08/2017 = August 31, 2017 
x1.Officer.surname:Taks = Taks",2,166,count,1
4497,How many calls lasting 73 seconds were received by a phone that dialed at 21:35?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""73"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""21:35"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 73
[PhoneCall] = 21:35
How many calls lasting 73 seconds were received by a phone that dialed at 21:35?",How many calls lasting [x0.PhoneCall.call_duration:73] seconds were received by a phone that dialed at [x2.PhoneCall.call_time:21:35]?,"x0.PhoneCall.call_duration:73 = 73
x2.PhoneCall.call_time:21:35 = 21:35",3,41,count,1
244,Which phones got calls on 02/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""02/08/2017"")
RETURN x0","[PhoneCall] = 02/08/2017
Which phones got calls on 02/08/2017?",Which phones got calls on [x1.PhoneCall.call_date:02/08/2017]?,x1.PhoneCall.call_date:02/08/2017 = 02/08/2017,2,30,entity_set,34
2199,How many individuals are aware of the phone number of a person with the surname Allen?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Allen"")
RETURN COUNT(DISTINCT x0)","[Person] = Allen
How many individuals are aware of the phone number of a person with the surname Allen?",How many individuals are aware of the phone number of a person with the surname [x1.Person.surname:Allen]?,x1.Person.surname:Allen = Allen,2,297,count,1
2638,How many Probe vehicles are part of a vehicle crime case under Officer Cosslett's investigation?,"MATCH (x0:Vehicle WHERE x0.model = ""Probe"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cosslett"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Probe
[Crime] = Vehicle crime
[Officer] = Cosslett
How many Probe vehicles are part of a vehicle crime case under Officer Cosslett's investigation?",How many [x0.Vehicle.model:Probe] vehicles are part of a [x1.Crime.type:Vehicle crime] case under Officer [x2.Officer.surname:Cosslett]'s investigation?,"x0.Vehicle.model:Probe = Probe
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Cosslett = Cosslett",3,380,count,1
3466,Which call did Kevin receive first?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Kevin"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Kevin
Which call did Kevin receive first?",Which call did [x2.Person.name:Kevin] receive first?,x2.Person.name:Kevin = Kevin,3,82,min,1
51,How many officers called Meara were involved in investigations of crimes that occured on 28/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Meara"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Meara
[Crime] = 28/08/2017
How many officers called Meara were involved in investigations of crimes that occured on 28/08/2017?",How many officers called [x0.Officer.name:Meara] were involved in investigations of crimes that occured on [x1.Crime.date:28/08/2017]?,"x0.Officer.name:Meara = Meara
x1.Crime.date:28/08/2017 = 28/08/2017",2,6,count,1
118,Who are Diana's housemates?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Diana"")
RETURN x0","[Person] = Diana
Who are Diana's housemates?",Who are [x1.Person.name:Diana]'s housemates?,x1.Person.name:Diana = Diana,2,14,entity_set,3
436,How many emails are linked to a person with last name Spencer?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Spencer"")
RETURN COUNT(DISTINCT x0)","[Person] = Spencer
How many emails are linked to a person with last name Spencer?",How many emails are linked to a person with last name [x1.Person.surname:Spencer]?,x1.Person.surname:Spencer = Spencer,2,58,count,1
2187,How many officers with the name Eimile handled investigations labeled Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Eimile"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Officer] = Eimile
[Crime] = Unable to prosecute suspect
How many officers with the name Eimile handled investigations labeled Unable to prosecute suspect?",How many officers with the name [x0.Officer.name:Eimile] handled investigations labeled [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Eimile = Eimile
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,296,count,1
4421,What is the address of the person whose phone number is 7-(727)924-9245?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""7-(727)924-9245"")
RETURN x0.address","[Phone] = 7-(727)924-9245
What is the address of the person whose phone number is 7-(727)924-9245?",What is the address of the person whose phone number is [x2.Phone.phoneNo:7-(727)924-9245]?,x2.Phone.phoneNo:7-(727)924-9245 = 7-(727)924-9245,3,16,attribute_set,1
1343,Can you identify Hyundai vehicles connected to offenses on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Hyundai"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN x0","[Vehicle] = Hyundai
[Crime] = 11/08/2017
Can you identify Hyundai vehicles connected to offenses on 11/08/2017?",Can you identify [x0.Vehicle.make:Hyundai] vehicles connected to offenses on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.make:Hyundai = Hyundai
x1.Crime.date:11/08/2017 = 11/08/2017",2,177,entity_set,2
1641,What is the most recent date a crime at 188 Hathaway Gardens was probed by an officer with surname Gronow?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Gronow"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""188 Hathaway Gardens"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = Gronow
[Location] = 188 Hathaway Gardens
What is the most recent date a crime at 188 Hathaway Gardens was probed by an officer with surname Gronow?",What is the most recent date a crime at [x1.Location.address:188 Hathaway Gardens] was probed by an officer with surname [x2.Officer.surname:Gronow]?,"x1.Location.address:188 Hathaway Gardens = 188 Hathaway Gardens
x2.Officer.surname:Gronow = Gronow",3,216,argmax,1
3147,How many offenses involve individuals with friends?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many offenses involve individuals with friends?,How many offenses involve individuals with friends?,,3,14,count,1
1284,Who is the eldest person whose number is recognized by someone named Andrea with the phone 8-(574)079-6700?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Andrea"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""8-(574)079-6700"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Andrea
[Phone] = 8-(574)079-6700
Who is the eldest person whose number is recognized by someone named Andrea with the phone 8-(574)079-6700?",Who is the eldest person whose number is recognized by someone named [x1.Person.name:Andrea] with the phone [x2.Phone.phoneNo:8-(574)079-6700]?,"x1.Person.name:Andrea = Andrea
x2.Phone.phoneNo:8-(574)079-6700 = 8-(574)079-6700",3,170,max,1
57,Can you name everyone that someone named Bonnie knows?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Bonnie"")
RETURN x0","[Person] = Bonnie
Can you name everyone that someone named Bonnie knows?",Can you name everyone that someone named [x1.Person.name:Bonnie] knows?,x1.Person.name:Bonnie = Bonnie,2,7,entity_set,14
2979,What most recent crime involved friends of individuals with last name Weaver?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Weaver"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Weaver
What most recent crime involved friends of individuals with last name Weaver?",What most recent crime involved friends of individuals with last name [x2.Person.surname:Weaver]?,x2.Person.surname:Weaver = Weaver,3,432,max,1
427,Which Inspectors are handling cases still under investigation?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Inspector
[Crime] = Under investigation
Which Inspectors are handling cases still under investigation?",Which [x0.Officer.rank:Inspector] are handling cases still [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.last_outcome:Under investigation = under investigation",2,57,entity_set,673
2282,How many crimes are being investigated by officer badge 31-2542986?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""31-2542986"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = 31-2542986
How many crimes are being investigated by officer badge 31-2542986?",How many crimes are [x0.Crime.last_outcome:Under investigation] by officer badge [x1.Officer.badge_no:31-2542986]?,"x0.Crime.last_outcome:Under investigation = being investigated 
x1.Officer.badge_no:31-2542986 = 31-2542986",2,307,count,1
438,How many emails belong to people whose last name is Spencer?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Spencer"")
RETURN COUNT(DISTINCT x0)","[Person] = Spencer
How many emails belong to people whose last name is Spencer?",How many emails belong to people whose last name is [x1.Person.surname:Spencer]?,x1.Person.surname:Spencer = Spencer,2,58,count,1
605,How many calls were placed to any phone on 12/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""12/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 12/08/2017
How many calls were placed to any phone on 12/08/2017?",How many calls were placed to any phone on [x0.PhoneCall.call_date:12/08/2017]?,x0.PhoneCall.call_date:12/08/2017 = 12/08/2017,2,79,count,1
3477,Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number 272-95-2412?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""272-95-2412"")
RETURN x0.surname","[Person] = 272-95-2412
Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number 272-95-2412?",Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number [x2.Person.nhs_no:272-95-2412]?,x2.Person.nhs_no:272-95-2412 = 272-95-2412,3,83,attribute_set,3
1209,How many owns the phone number 6-(703)886-7830?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""6-(703)886-7830"")
RETURN COUNT(DISTINCT x0)","[Phone] = 6-(703)886-7830
How many owns the phone number 6-(703)886-7830?",How many owns the phone number [x1.Phone.phoneNo:6-(703)886-7830]?,x1.Phone.phoneNo:6-(703)886-7830 = 6-(703)886-7830,2,162,count,1
1787,Who is the eldest individual residing with the Porters?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Porter"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Porter
Who is the eldest individual residing with the Porters?",Who is the eldest individual residing with the [x1.Person.surname:Porter]?,x1.Person.surname:Porter = Porters,2,237,max,1
374,Can you provide a list of officers named Melodie who worked on cases dated 27/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Melodie"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""27/08/2017"")
RETURN x0","[Officer] = Melodie
[Crime] = 27/08/2017
Can you provide a list of officers named Melodie who worked on cases dated 27/08/2017?",Can you provide a list of officers named [x0.Officer.name:Melodie] who worked on cases dated [x1.Crime.date:27/08/2017]?,"x0.Officer.name:Melodie = Melodie
x1.Crime.date:27/08/2017 = 27/08/2017",2,49,entity_set,2
934,"How many crimes were recorded as ""Investigation complete; no suspect identified"" at 64 First Avenue?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""64 First Avenue"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Location] = 64 First Avenue
How many crimes were recorded as ""Investigation complete; no suspect identified"" at 64 First Avenue?","How many crimes were recorded as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" at [x1.Location.address:64 First Avenue]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.address:64 First Avenue = 64 First Avenue",2,122,count,1
1167,Can you show me the phones that had a call at 00:05?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""00:05"")
RETURN x0","[PhoneCall] = 00:05
Can you show me the phones that had a call at 00:05?",Can you show me the phones that had a call at [x1.PhoneCall.call_time:00:05]?,x1.PhoneCall.call_time:00:05 = 00:05,2,154,entity_set,2
3514,What are the postal codes for where the friends of the person with NHS number 664-34-9245 live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""664-34-9245"")
RETURN x0.postcode","[Person] = 664-34-9245
What are the postal codes for where the friends of the person with NHS number 664-34-9245 live?",What are the postal codes for where the friends of the person with NHS number [x2.Person.nhs_no:664-34-9245] live?,x2.Person.nhs_no:664-34-9245 = 664-34-9245,3,104,attribute_set,6
1295,What is the count of 2-second phone calls received?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""2"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 2
What is the count of 2-second phone calls received?",What is the count of [x0.PhoneCall.call_duration:2]-second phone calls received?,x0.PhoneCall.call_duration:2 = 2,2,172,count,1
4494,How many calls lasting 15 seconds were received by a phone that dialed out at 14:48?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""15"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""14:48"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 15
[PhoneCall] = 14:48
How many calls lasting 15 seconds were received by a phone that dialed out at 14:48?",How many calls lasting [x0.PhoneCall.call_duration:15] seconds were received by a phone that dialed out at [x2.PhoneCall.call_time:14:48]?,"x0.PhoneCall.call_duration:15 = 15
x2.PhoneCall.call_time:14:48 = 14:48",3,41,count,1
2598,What is the first date a crime was probed by an officer with surname Joskowicz?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Joskowicz"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Joskowicz
What is the first date a crime was probed by an officer with surname Joskowicz?",What is the first date a crime was probed by an officer with surname [x1.Officer.surname:Joskowicz]?,x1.Officer.surname:Joskowicz = Joskowicz,2,367,argmin,1
1720,How many individuals named Jennifer cohabit with those bearing the surname Hawkins?,"MATCH (x0:Person WHERE x0.name = ""Jennifer"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hawkins"")
RETURN COUNT(DISTINCT x0)","[Person] = Jennifer
[Person] = Hawkins
How many individuals named Jennifer cohabit with those bearing the surname Hawkins?",How many individuals named [x0.Person.name:Jennifer] cohabit with those bearing the surname [x1.Person.surname:Hawkins]?,"x0.Person.name:Jennifer = Jennifer
x1.Person.surname:Hawkins = Hawkins",2,226,count,1
202,Who has a family connection to anyone named Carl?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Carl"")
RETURN x0","[Person] = Carl
Who has a family connection to anyone named Carl?",Who has a family connection to anyone named [x1.Person.name:Carl]?,x1.Person.name:Carl = Carl,2,24,entity_set,4
1106,Can you identify places with the postcode M8 5UU that have reported burglary incidents?,"MATCH (x0:Location WHERE x0.postcode = ""M8 5UU"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Burglary"")
RETURN x0","[Location] = M8 5UU
[Crime] = Burglary
Can you identify places with the postcode M8 5UU that have reported burglary incidents?",Can you identify places with the postcode [x0.Location.postcode:M8 5UU] that have reported [x1.Crime.type:Burglary] incidents?,"x0.Location.postcode:M8 5UU = M8 5UU
x1.Crime.type:Burglary = burglary",2,146,entity_set,1
3065,Could you list the NHS numbers of those related with a John who cohabitates with another individual?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""John"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = John
Could you list the NHS numbers of those related with a John who cohabitates with another individual?",Could you list the NHS numbers of those related with a [x1.Person.name:John] who cohabitates with another individual?,x1.Person.name:John = John,3,3,attribute_set,2
3038,Could you tell me the email linked to the person with phone number 4-(223)417-6164?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""4-(223)417-6164"")
RETURN x0","[Phone] = 4-(223)417-6164
Could you tell me the email linked to the person with phone number 4-(223)417-6164?",Could you tell me the email linked to the person with phone number [x2.Phone.phoneNo:4-(223)417-6164]?,x2.Phone.phoneNo:4-(223)417-6164 = 4-(223)417-6164,3,442,entity_set,1
1960,Can you tell me how many phones are owned by the person with NHS number 577-08-1339?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""577-08-1339"")
RETURN COUNT(DISTINCT x0)","[Person] = 577-08-1339
Can you tell me how many phones are owned by the person with NHS number 577-08-1339?",Can you tell me how many phones are owned by the person with NHS number [x1.Person.nhs_no:577-08-1339]?,x1.Person.nhs_no:577-08-1339 = 577-08-1339,2,263,count,1
806,Can you provide the badge numbers of officers involved in investigations on 14th August 2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""14/08/2017"")
RETURN x0.badge_no","[Crime] = 14/08/2017
Can you provide the badge numbers of officers involved in investigations on 14th August 2017?",Can you provide the badge numbers of officers involved in investigations on [x1.Crime.date:14/08/2017]?,x1.Crime.date:14/08/2017 = 14th August 2017,2,106,attribute_set,959
1607,How many phones got a 24-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""24"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 24
How many phones got a 24-second call?",How many phones got a [x1.PhoneCall.call_duration:24]-second call?,x1.PhoneCall.call_duration:24 = 24,2,212,count,1
2018,"How many crimes with the status ""Investigation complete; no suspect identified"" involved C30 model vehicles?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""C30"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = C30
How many crimes with the status ""Investigation complete; no suspect identified"" involved C30 model vehicles?","How many crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involved [x1.Vehicle.model:C30] model vehicles?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:C30 = C30",2,270,count,1
2777,What was the most recent crime involving a resident of 161 Sawyer Drive?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""161 Sawyer Drive"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 161 Sawyer Drive
What was the most recent crime involving a resident of 161 Sawyer Drive?",What was the most recent crime involving a resident of [x2.Location.address:161 Sawyer Drive]?,x2.Location.address:161 Sawyer Drive = 161 Sawyer Drive,3,402,max,1
3478,What are the last name of people whose phone is known to individuals familiar with someone having NHS number 272-95-2412?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""272-95-2412"")
RETURN x0.surname","[Person] = 272-95-2412
What are the last name of people whose phone is known to individuals familiar with someone having NHS number 272-95-2412?",What are the last name of people whose phone is known to individuals familiar with someone having NHS number [x2.Person.nhs_no:272-95-2412]?,x2.Person.nhs_no:272-95-2412 = 272-95-2412,3,83,attribute_set,3
3175,Can you provide the ranks of officers involved in Vanquish S vehicle crime investigations?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Vanquish S"")
RETURN x0.rank","[Vehicle] = Vanquish S
Can you provide the ranks of officers involved in Vanquish S vehicle crime investigations?",Can you provide the ranks of officers involved in [x2.Vehicle.model:Vanquish S] vehicle crime investigations?,x2.Vehicle.model:Vanquish S = Vanquish S,3,19,attribute_set,1
773,"At 09:28, how many phones made calls?","MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""09:28"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 09:28
At 09:28, how many phones made calls?","At [x1.PhoneCall.call_time:09:28], how many phones made calls?",x1.PhoneCall.call_time:09:28 = 09:28,2,102,count,1
3360,In how many places were there vehicle crimes where people named Amy were involved?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Amy
In how many places were there vehicle crimes where people named Amy were involved?",In how many places were there [x1.Crime.type:Vehicle crime] where people named [x2.Person.name:Amy] were involved?,"x1.Crime.type:Vehicle crime = vehicle crimes
x2.Person.name:Amy = Amy",3,47,count,1
1694,"What is the number of crimes that took place at 46 Dunkery Road on August 27, 2017?","MATCH (x0:Crime WHERE x0.date = ""27/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""46 Dunkery Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = 27/08/2017
[Location] = 46 Dunkery Road
What is the number of crimes that took place at 46 Dunkery Road on August 27, 2017?",What is the number of crimes that took place at [x1.Location.address:46 Dunkery Road] on [x0.Crime.date:27/08/2017]?,"x0.Crime.date:27/08/2017 = August 27, 2017 
x1.Location.address:46 Dunkery Road = 46 Dunkery Road",2,223,count,1
4638,Which locations were crime scenes under Officer Duny's investigation?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Duny"")
RETURN x0.address","[Officer] = Duny
Which locations were crime scenes under Officer Duny's investigation?",Which locations were crime scenes under Officer [x2.Officer.surname:Duny]'s investigation?,x2.Officer.surname:Duny = Duny,3,93,attribute_set,33
3388,Can you name the vehicle brands connected to a crime at the site with postcode M3 1SQ?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M3 1SQ"")
RETURN x0.make","[Location] = M3 1SQ
Can you name the vehicle brands connected to a crime at the site with postcode M3 1SQ?",Can you name the vehicle brands connected to a crime at the site with postcode [x2.Location.postcode:M3 1SQ]?,x2.Location.postcode:M3 1SQ = M3 1SQ,3,54,attribute_set,3
2132,Which phone call with the earliest date was received by someone with last name Gilbert?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gilbert"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Gilbert
Which phone call with the earliest date was received by someone with last name Gilbert?",Which phone call with the earliest date was received by someone with last name [x2.Person.surname:Gilbert]?,x2.Person.surname:Gilbert = Gilbert,3,288,min,1
3171,What is the type of the latest crime committed by individuals already involved in vehicle crimes?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.type
ORDER BY x0.date DESC
LIMIT 1","[Crime] = Vehicle crime
What is the type of the latest crime committed by individuals already involved in vehicle crimes?",What is the type of the latest crime committed by individuals already involved in [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = vehicle crimes,3,17,argmax,1
1504,Which is the earliest crime involving individuals with surname Powell?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Powell
Which is the earliest crime involving individuals with surname Powell?",Which is the earliest crime involving individuals with surname [x1.Person.surname:Powell]?,x1.Person.surname:Powell = Powell,2,200,min,1
1200,Can you identify the cases under investigation that include suspects with the last name Powell?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN x0","[Crime] = Under investigation
[Person] = Powell
Can you identify the cases under investigation that include suspects with the last name Powell?",Can you identify the cases [x0.Crime.last_outcome:Under investigation] that include suspects with the last name [x1.Person.surname:Powell]?,"x0.Crime.last_outcome:Under investigation = under investigation
x1.Person.surname:Powell = Powell",2,161,entity_set,3
2324,How many phones placed calls?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)
RETURN COUNT(DISTINCT x0)",How many phones placed calls?,How many phones placed calls?,,2,314,count,1
975,How many sites saw criminal activity on 28/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 28/08/2017
How many sites saw criminal activity on 28/08/2017?",How many sites saw criminal activity on [x1.Crime.date:28/08/2017]?,x1.Crime.date:28/08/2017 = 28/08/2017,2,127,count,1
4571,Who was the officer that looked into the crime involving the person with NHS number 589-69-0106?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""589-69-0106"")
RETURN x0","[Person] = 589-69-0106
Who was the officer that looked into the crime involving the person with NHS number 589-69-0106?",Who was the officer that looked into the crime involving the person with NHS number [x2.Person.nhs_no:589-69-0106]?,x2.Person.nhs_no:589-69-0106 = 589-69-0106,3,67,entity_set,1
