id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1853,What is the postal code for 110 Sheard Avenue?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""110 Sheard Avenue"")
RETURN x0","[Location] = 110 Sheard Avenue
What is the postal code for 110 Sheard Avenue?",What is the postal code for [x1.Location.address:110 Sheard Avenue]?,x1.Location.address:110 Sheard Avenue = 110 Sheard Avenue,2,247,entity_set,1
1467,Could you list the phones of those who have the last name Kelly?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0","[Person] = Kelly
Could you list the phones of those who have the last name Kelly?",Could you list the phones of those who have the last name [x1.Person.surname:Kelly]?,x1.Person.surname:Kelly = Kelly,2,193,entity_set,3
3398,What are the dates of crimes involving a person residing with someone with the last name Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
What are the dates of crimes involving a person residing with someone with the last name Morales?",What are the dates of crimes involving a person residing with someone with the last name [x2.Person.surname:Morales]?,x2.Person.surname:Morales = Morales,3,55,attribute_set,10
3249,How many individuals have friends who are engaged in criminal activities?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",How many individuals have friends who are engaged in criminal activities?,How many individuals have friends who are engaged in criminal activities?,,3,31,count,1
1862,How many phones do people surnamed Frazier own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Frazier"")
RETURN COUNT(DISTINCT x0)","[Person] = Frazier
How many phones do people surnamed Frazier own?",How many phones do people surnamed [x1.Person.surname:Frazier] own?,x1.Person.surname:Frazier = Frazier,2,249,count,1
2225,What are the phone calls received on 14/08/2017 by the number 8-(342)691-8174?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""14/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(342)691-8174"")
RETURN x0","[PhoneCall] = 14/08/2017
[Phone] = 8-(342)691-8174
What are the phone calls received on 14/08/2017 by the number 8-(342)691-8174?",What are the phone calls received on [x0.PhoneCall.call_date:14/08/2017] by the number [x1.Phone.phoneNo:8-(342)691-8174]?,"x0.PhoneCall.call_date:14/08/2017 = 14/08/2017
x1.Phone.phoneNo:8-(342)691-8174 = 8-(342)691-8174",2,300,entity_set,1
1283,Who is the oldest person that has their phone number known by an Andrea with the contact 8-(574)079-6700?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Andrea"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""8-(574)079-6700"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Andrea
[Phone] = 8-(574)079-6700
Who is the oldest person that has their phone number known by an Andrea with the contact 8-(574)079-6700?",Who is the oldest person that has their phone number known by an [x1.Person.name:Andrea] with the contact [x2.Phone.phoneNo:8-(574)079-6700]?,"x1.Person.name:Andrea = Andrea
x2.Phone.phoneNo:8-(574)079-6700 = 8-(574)079-6700",3,170,max,1
2461,Which crime involving an XLR model did an officer with surname Stodart first investigate?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Stodart"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""XLR"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stodart
[Vehicle] = XLR
Which crime involving an XLR model did an officer with surname Stodart first investigate?",Which crime involving an [x1.Vehicle.model:XLR] model did an officer with surname [x2.Officer.surname:Stodart] first investigate?,"x1.Vehicle.model:XLR = XLR
x2.Officer.surname:Stodart = Stodart",3,341,min,1
2286,What is the most recent date of a crime at 95 Cobden Street with a Hughes involved?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Hughes"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""95 Cobden Street"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Hughes
[Location] = 95 Cobden Street
What is the most recent date of a crime at 95 Cobden Street with a Hughes involved?",What is the most recent date of a crime at [x1.Location.address:95 Cobden Street] with a [x2.Person.surname:Hughes] involved?,"x1.Location.address:95 Cobden Street = 95 Cobden Street
x2.Person.surname:Hughes = Hughes",3,309,argmax,1
4617,Which is the least lengthy call received on the phone that had a call on 18/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 18/08/2017
Which is the least lengthy call received on the phone that had a call on 18/08/2017?",Which is the least lengthy call received on the phone that had a call on [x2.PhoneCall.call_date:18/08/2017]?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,76,min,1
718,What are the crime locations with the postcode SK15 2AL from 10/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""SK15 2AL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN x0","[Location] = SK15 2AL
[Crime] = 10/08/2017
What are the crime locations with the postcode SK15 2AL from 10/08/2017?",What are the crime locations with the postcode [x0.Location.postcode:SK15 2AL] from [x1.Crime.date:10/08/2017]?,"x0.Location.postcode:SK15 2AL = SK15 2AL
x1.Crime.date:10/08/2017 = 10/08/2017",2,96,entity_set,1
2850,"How many crimes, marked as investigation complete with no suspect, involve family members of someone with last name Martin?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Martin
How many crimes, marked as investigation complete with no suspect, involve family members of someone with last name Martin?","How many crimes, marked as [x0.Crime.last_outcome:Investigation complete; no suspect identified], involve family members of someone with last name [x2.Person.surname:Martin]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = investigation complete with no suspect 
x2.Person.surname:Martin = Martin",3,415,count,1
226,Can you identify the phones that contacted 1-(111)459-3206?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0","[Phone] = 1-(111)459-3206
Can you identify the phones that contacted 1-(111)459-3206?",Can you identify the phones that contacted [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,28,entity_set,2
3605,"What locations in the WA15 area had crimes with the status ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""WA15"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = WA15
What locations in the WA15 area had crimes with the status ""Investigation complete; no suspect identified""?","What locations in the [x1.Area.areaCode:WA15] area had crimes with the status ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:WA15 = WA15
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,118
627,What 2011 vehicles were associated with vehicle offenses?,"MATCH (x0:Vehicle WHERE x0.year = ""2011"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2011
[Crime] = Vehicle crime
What 2011 vehicles were associated with vehicle offenses?",What [x0.Vehicle.year:2011] vehicles were associated with [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2011 = 2011
x1.Crime.type:Vehicle crime = vehicle offenses",2,83,entity_set,52
24,What is the number of sites with the postcode M9 7EB where crimes happened?,"MATCH (x0:Location WHERE x0.postcode = ""M9 7EB"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = M9 7EB
What is the number of sites with the postcode M9 7EB where crimes happened?",What is the number of sites with the postcode [x0.Location.postcode:M9 7EB] where crimes happened?,x0.Location.postcode:M9 7EB = M9 7EB,2,3,count,1
156,Which offenses from 28/08/2017 are under investigation by an officer named Ame?,"MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Ame"")
RETURN x0","[Crime] = 28/08/2017
[Officer] = Ame
Which offenses from 28/08/2017 are under investigation by an officer named Ame?",Which offenses from [x0.Crime.date:28/08/2017] are under investigation by an officer named [x1.Officer.name:Ame]?,"x0.Crime.date:28/08/2017 = 28/08/2017
x1.Officer.name:Ame = Ame",2,18,entity_set,1
546,How many residents named Anne are at 146 Gloucester Street?,"MATCH (x0:Person WHERE x0.name = ""Anne"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""146 Gloucester Street"")
RETURN COUNT(DISTINCT x0)","[Person] = Anne
[Location] = 146 Gloucester Street
How many residents named Anne are at 146 Gloucester Street?",How many residents named [x0.Person.name:Anne] are at [x1.Location.address:146 Gloucester Street]?,"x0.Person.name:Anne = Anne
x1.Location.address:146 Gloucester Street = 146 Gloucester Street",2,71,count,1
745,Where does anyone named Ralph live with the postcode M27 0JU?,"MATCH (x0:Location WHERE x0.postcode = ""M27 0JU"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Ralph"")
RETURN x0","[Location] = M27 0JU
[Person] = Ralph
Where does anyone named Ralph live with the postcode M27 0JU?",Where does anyone named [x1.Person.name:Ralph] live with the postcode [x0.Location.postcode:M27 0JU]?,"x0.Location.postcode:M27 0JU = M27 0JU
x1.Person.name:Ralph = Ralph",2,99,entity_set,1
412,What are all the places with the postcode BL2 2UQ?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""BL2 2UQ"")
RETURN x0","[PostCode] = BL2 2UQ
What are all the places with the postcode BL2 2UQ?",What are all the places with the postcode [x1.PostCode.code:BL2 2UQ]?,x1.PostCode.code:BL2 2UQ = BL2 2UQ,2,54,entity_set,1
2412,What phones placed calls on 03/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""03/08/2017"")
RETURN x0","[PhoneCall] = 03/08/2017
What phones placed calls on 03/08/2017?",What phones placed calls on [x1.PhoneCall.call_date:03/08/2017]?,x1.PhoneCall.call_date:03/08/2017 = 03/08/2017,2,333,entity_set,19
2853,How many ongoing investigations involve individuals related to someone with last name Martin?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Person] = Martin
How many ongoing investigations involve individuals related to someone with last name Martin?",How many [x0.Crime.last_outcome:Under investigation] involve individuals related to someone with last name [x2.Person.surname:Martin]?,"x0.Crime.last_outcome:Under investigation = ongoing investigations 
x2.Person.surname:Martin = Martin",3,415,count,1
224,Which phones called the number 1-(111)459-3206?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0","[Phone] = 1-(111)459-3206
Which phones called the number 1-(111)459-3206?",Which phones called the number [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,28,entity_set,2
3606,"Which places in the WA15 region experienced crimes that ended with ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""WA15"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = WA15
Which places in the WA15 region experienced crimes that ended with ""Investigation complete; no suspect identified""?","Which places in the [x1.Area.areaCode:WA15] region experienced crimes that ended with ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:WA15 = WA15
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,118
3328,What are the addresses of homes belonging to those recognized by anyone named Bobby?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Bobby"")
RETURN x0.address","[Person] = Bobby
What are the addresses of homes belonging to those recognized by anyone named Bobby?",What are the addresses of homes belonging to those recognized by anyone named [x2.Person.name:Bobby]?,x2.Person.name:Bobby = Bobby,3,42,attribute_set,7
4498,How many 73-second phone calls were received by a phone that called at 21:35?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""73"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""21:35"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 73
[PhoneCall] = 21:35
How many 73-second phone calls were received by a phone that called at 21:35?",How many [x0.PhoneCall.call_duration:73]-second phone calls were received by a phone that called at [x2.PhoneCall.call_time:21:35]?,"x0.PhoneCall.call_duration:73 = 73
x2.PhoneCall.call_time:21:35 = 21:35",3,41,count,1
1466,Can you provide the phones for individuals with the surname Kelly?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0","[Person] = Kelly
Can you provide the phones for individuals with the surname Kelly?",Can you provide the phones for individuals with the surname [x1.Person.surname:Kelly]?,x1.Person.surname:Kelly = Kelly,2,193,entity_set,3
1996,Can you identify the crimes from 13/08/2017 being looked into by Police Constables?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 13/08/2017
[Officer] = Police Constable
Can you identify the crimes from 13/08/2017 being looked into by Police Constables?",Can you identify the crimes from [x0.Crime.date:13/08/2017] being looked into by [x1.Officer.rank:Police Constable]?,"x0.Crime.date:13/08/2017 = 13/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,349
2059,Which people have connections to anyone with the last name Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0","[Person] = Nguyen
Which people have connections to anyone with the last name Nguyen?",Which people have connections to anyone with the last name [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,277,entity_set,22
2071,What is the count of vehicle crimes involving Acura vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Acura"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Acura
What is the count of vehicle crimes involving Acura vehicles?",What is the count of [x0.Crime.type:Vehicle crime] involving [x1.Vehicle.make:Acura] vehicles?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Acura = Acura",2,278,count,1
448,Who are the officers handling cases still under investigation?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Crime] = Under investigation
Who are the officers handling cases still under investigation?",Who are the officers handling cases still [x1.Crime.last_outcome:Under investigation]?,x1.Crime.last_outcome:Under investigation = under investigation,2,59,entity_set,3421
1472,Can you provide a list of phones for individuals with surname Patterson?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Patterson"")
RETURN x0","[Person] = Patterson
Can you provide a list of phones for individuals with surname Patterson?",Can you provide a list of phones for individuals with surname [x1.Person.surname:Patterson]?,x1.Person.surname:Patterson = Patterson,2,193,entity_set,3
3497,What most recent crime happened at postcode M24 2GP?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M24 2GP"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M24 2GP
What most recent crime happened at postcode M24 2GP?",What most recent crime happened at postcode [x2.PostCode.code:M24 2GP]?,x2.PostCode.code:M24 2GP = M24 2GP,3,103,max,1
3442,Who are the people sharing a home with a crime-involved individual?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Who are the people sharing a home with a crime-involved individual?,Who are the people sharing a home with a crime-involved individual?,,3,67,entity_set,46
1579,Which crimes took place at sites with the postcode M4 6EW?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M4 6EW"")
RETURN x0","[Location] = M4 6EW
Which crimes took place at sites with the postcode M4 6EW?",Which crimes took place at sites with the postcode [x1.Location.postcode:M4 6EW]?,x1.Location.postcode:M4 6EW = M4 6EW,2,209,entity_set,2
1490,Can you provide the emails for individuals with the surname Montgomery?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Montgomery"")
RETURN x0","[Person] = Montgomery
Can you provide the emails for individuals with the surname Montgomery?",Can you provide the emails for individuals with the surname [x1.Person.surname:Montgomery]?,x1.Person.surname:Montgomery = Montgomery,2,198,entity_set,1
683,In how many spots does a person named Irene reside?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
In how many spots does a person named Irene reside?",In how many spots does a person named [x1.Person.name:Irene] reside?,x1.Person.name:Irene = Irene,2,90,count,1
2367,"Which areas experienced crimes on August 30, 2017?","MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""30/08/2017"")
RETURN x0","[Crime] = 30/08/2017
Which areas experienced crimes on August 30, 2017?",Which areas experienced crimes on [x2.Crime.date:30/08/2017]?,"x2.Crime.date:30/08/2017 = August 30, 2017",3,323,entity_set,871
1322,How many zones contain sites with the postal code M4 7FN?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M4 7FN"")
RETURN COUNT(DISTINCT x0)","[Location] = M4 7FN
How many zones contain sites with the postal code M4 7FN?",How many zones contain sites with the postal code [x1.Location.postcode:M4 7FN]?,x1.Location.postcode:M4 7FN = M4 7FN,2,175,count,1
2050,How many incidents of violence and sexual offences took place at 106 Eastwell Road?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""106 Eastwell Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Location] = 106 Eastwell Road
How many incidents of violence and sexual offences took place at 106 Eastwell Road?",How many incidents of [x0.Crime.type:Violence and sexual offences] took place at [x1.Location.address:106 Eastwell Road]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Location.address:106 Eastwell Road = 106 Eastwell Road",2,276,count,1
1651,Which calls of 56 seconds were received by 5-(606)104-0382?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""56"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(606)104-0382"")
RETURN x0","[PhoneCall] = 56
[Phone] = 5-(606)104-0382
Which calls of 56 seconds were received by 5-(606)104-0382?",Which calls of [x0.PhoneCall.call_duration:56] seconds were received by [x1.Phone.phoneNo:5-(606)104-0382]?,"x0.PhoneCall.call_duration:56 = 56
x1.Phone.phoneNo:5-(606)104-0382 = 5-(606)104-0382",2,217,entity_set,2
1410,How many times did 0-(521)287-3218 receive calls lasting 88 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""88"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(521)287-3218"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 88
[Phone] = 0-(521)287-3218
How many times did 0-(521)287-3218 receive calls lasting 88 seconds?",How many times did [x1.Phone.phoneNo:0-(521)287-3218] receive calls lasting [x0.PhoneCall.call_duration:88] seconds?,"x0.PhoneCall.call_duration:88 = 88
x1.Phone.phoneNo:0-(521)287-3218 = 0-(521)287-3218",2,184,count,1
2142,How many devices were called on 11/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""11/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11/08/2017
How many devices were called on 11/08/2017?",How many devices were called on [x1.PhoneCall.call_date:11/08/2017]?,x1.PhoneCall.call_date:11/08/2017 = 11/08/2017,2,289,count,1
1816,How many drug crimes are linked to those with the last name Powell?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Person] = Powell
How many drug crimes are linked to those with the last name Powell?",How many [x0.Crime.type:Drugs] are linked to those with the last name [x1.Person.surname:Powell]?,"x0.Crime.type:Drugs = drug crimes 
x1.Person.surname:Powell = Powell",2,241,count,1
157,Can you identify the crimes from 28/08/2017 being looked into by Officer Ame?,"MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Ame"")
RETURN x0","[Crime] = 28/08/2017
[Officer] = Ame
Can you identify the crimes from 28/08/2017 being looked into by Officer Ame?",Can you identify the crimes from [x0.Crime.date:28/08/2017] being looked into by Officer [x1.Officer.name:Ame]?,"x0.Crime.date:28/08/2017 = 28/08/2017
x1.Officer.name:Ame = Ame",2,18,entity_set,1
1277,What is the number of people called Diane who have a friend with last name Bennett?,"MATCH (x0:Person WHERE x0.name = ""Diane"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Bennett"")
RETURN COUNT(DISTINCT x0)","[Person] = Diane
[Person] = Bennett
What is the number of people called Diane who have a friend with last name Bennett?",What is the number of people called [x0.Person.name:Diane] who have a friend with last name [x1.Person.surname:Bennett]?,"x0.Person.name:Diane = Diane
x1.Person.surname:Bennett = Bennett",2,169,count,1
192,How many calls to any phone lasted 54 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""54"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 54
How many calls to any phone lasted 54 seconds?",How many calls to any phone lasted [x0.PhoneCall.call_duration:54] seconds?,x0.PhoneCall.call_duration:54 = 54,2,23,count,1
4373,When did the most recent crime occur involving someone who resides with a person named Pamela?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Pamela"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Pamela
When did the most recent crime occur involving someone who resides with a person named Pamela?",When did the most recent crime occur involving someone who resides with a person named [x2.Person.name:Pamela]?,x2.Person.name:Pamela = Pamela,3,0,argmax,1
381,In how many cases was a vehicle part of the crime?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)",In how many cases was a vehicle part of the crime?,In how many cases was a vehicle part of the crime?,,2,50,count,1
2633,How many Protege cars are linked to a vehicle crime probed by Officer with surname Klicher?,"MATCH (x0:Vehicle WHERE x0.model = ""Protege"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Klicher"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Protege
[Crime] = Vehicle crime
[Officer] = Klicher
How many Protege cars are linked to a vehicle crime probed by Officer with surname Klicher?",How many [x0.Vehicle.model:Protege] cars are linked to a [x1.Crime.type:Vehicle crime] probed by Officer with surname [x2.Officer.surname:Klicher]?,"x0.Vehicle.model:Protege = Protege
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Klicher = Klicher",3,380,count,1
643,Who is the eldest family member of someone who knows a Ford's phone number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Ford"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Ford
Who is the eldest family member of someone who knows a Ford's phone number?",Who is the eldest family member of someone who knows a [x2.Person.surname:Ford]'s phone number?,x2.Person.surname:Ford = Ford,3,86,max,1
853,How many individuals named Andrea were linked to crimes on 30/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrea
[Crime] = 30/08/2017
How many individuals named Andrea were linked to crimes on 30/08/2017?",How many individuals named [x0.Person.name:Andrea] were linked to crimes on [x1.Crime.date:30/08/2017]?,"x0.Person.name:Andrea = Andrea
x1.Crime.date:30/08/2017 = 30/08/2017",2,113,count,1
1958,How many phones does the person with NHS number 577-08-1339 own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""577-08-1339"")
RETURN COUNT(DISTINCT x0)","[Person] = 577-08-1339
How many phones does the person with NHS number 577-08-1339 own?",How many phones does the person with NHS number [x1.Person.nhs_no:577-08-1339] own?,x1.Person.nhs_no:577-08-1339 = 577-08-1339,2,263,count,1
3315,Can you provide the last names of individuals residing in places with burglary incidents?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Burglary"")
RETURN x0.surname","[Crime] = Burglary
Can you provide the last names of individuals residing in places with burglary incidents?",Can you provide the last names of individuals residing in places with [x2.Crime.type:Burglary] incidents?,x2.Crime.type:Burglary = burglary,3,41,attribute_set,62
1145,Can you provide a list of Other theft offences handled by officers with the surname Almeida?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Almeida"")
RETURN x0","[Crime] = Other theft
[Officer] = Almeida
Can you provide a list of Other theft offences handled by officers with the surname Almeida?",Can you provide a list of [x0.Crime.type:Other theft] offences handled by officers with the surname [x1.Officer.surname:Almeida]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Almeida = Almeida",2,152,entity_set,2
1635,Which areas have locations with the post code SK16 4JZ?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""SK16 4JZ"")
RETURN x0","[Location] = SK16 4JZ
Which areas have locations with the post code SK16 4JZ?",Which areas have locations with the post code [x1.Location.postcode:SK16 4JZ]?,x1.Location.postcode:SK16 4JZ = SK16 4JZ,2,215,entity_set,1
1655,How many individuals are related to someone with last name Perry?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Perry"")
RETURN COUNT(DISTINCT x0)","[Person] = Perry
How many individuals are related to someone with last name Perry?",How many individuals are related to someone with last name [x1.Person.surname:Perry]?,x1.Person.surname:Perry = Perry,2,218,count,1
3170,Which is the type of the most recent crime that involve individuals previously linked to drug offenses?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Drugs"")
RETURN x0.type
ORDER BY x0.date DESC
LIMIT 1","[Crime] = Drugs
Which is the type of the most recent crime that involve individuals previously linked to drug offenses?",Which is the type of the most recent crime that involve individuals previously linked to [x2.Crime.type:Drugs]?,x2.Crime.type:Drugs = drug offenses,3,17,argmax,1
124,Who shares a home with Lillian?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Lillian"")
RETURN x0","[Person] = Lillian
Who shares a home with Lillian?",Who shares a home with [x1.Person.name:Lillian]?,x1.Person.name:Lillian = Lillian,2,14,entity_set,2
1856,What is the postal code for 73 Longford Street?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""73 Longford Street"")
RETURN x0","[Location] = 73 Longford Street
What is the postal code for 73 Longford Street?",What is the postal code for [x1.Location.address:73 Longford Street]?,x1.Location.address:73 Longford Street = 73 Longford Street,2,247,entity_set,1
2620,Who are the individuals possessing phones?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN x0",Who are the individuals possessing phones?,Who are the individuals possessing phones?,,2,376,entity_set,328
677,How many offenses took place at 124 Clegg Place?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""124 Clegg Place"")
RETURN COUNT(DISTINCT x0)","[Location] = 124 Clegg Place
How many offenses took place at 124 Clegg Place?",How many offenses took place at [x1.Location.address:124 Clegg Place]?,x1.Location.address:124 Clegg Place = 124 Clegg Place,2,89,count,1
2659,Which emails belong to those who are friends with a person with last name Brown?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Brown"")
RETURN x0","[Person] = Brown
Which emails belong to those who are friends with a person with last name Brown?",Which emails belong to those who are friends with a person with last name [x2.Person.surname:Brown]?,x2.Person.surname:Brown = Brown,3,382,entity_set,2
2382,Which region is linked to 108 Milnthorpe Road?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""108 Milnthorpe Road"")
RETURN x0","[Location] = 108 Milnthorpe Road
Which region is linked to 108 Milnthorpe Road?",Which region is linked to [x1.Location.address:108 Milnthorpe Road]?,x1.Location.address:108 Milnthorpe Road = 108 Milnthorpe Road,2,328,entity_set,1
1661,What are the names of the relatives of people with the last name Phillips?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Phillips"")
RETURN x0.name","[Person] = Phillips
What are the names of the relatives of people with the last name Phillips?",What are the names of the relatives of people with the last name [x1.Person.surname:Phillips]?,x1.Person.surname:Phillips = Phillips,2,219,attribute_set,4
2862,How many cases do Police Constables investigate involving someone with last name Peters?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Police Constable"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Person] = Peters
How many cases do Police Constables investigate involving someone with last name Peters?",How many cases do [x2.Officer.rank:Police Constable] investigate involving someone with last name [x1.Person.surname:Peters]?,"x1.Person.surname:Peters = Peters
x2.Officer.rank:Police Constable = Police Constables",3,416,count,1
2094,Can you show the calls to 6-(957)226-3476 that lasted 71 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""71"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(957)226-3476"")
RETURN x0","[PhoneCall] = 71
[Phone] = 6-(957)226-3476
Can you show the calls to 6-(957)226-3476 that lasted 71 seconds?",Can you show the calls to [x1.Phone.phoneNo:6-(957)226-3476] that lasted [x0.PhoneCall.call_duration:71] seconds?,"x0.PhoneCall.call_duration:71 = 71
x1.Phone.phoneNo:6-(957)226-3476 = 6-(957)226-3476",2,283,entity_set,2
