id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2946,What vehicle crimes happened at 67 Speyside Close involving Escalade ESVs?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""67 Speyside Close"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Escalade ESV"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 67 Speyside Close
[Vehicle] = Escalade ESV
What vehicle crimes happened at 67 Speyside Close involving Escalade ESVs?",What [x0.Crime.type:Vehicle crime] happened at [x2.Location.address:67 Speyside Close] involving [x1.Vehicle.model:Escalade ESV]s?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Escalade ESV = Escalade ESV
x2.Location.address:67 Speyside Close = 67 Speyside Close",3,428,entity_set,1
350,What is the count of crimes linked to individuals with the surname Robinson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robinson"")
RETURN COUNT(DISTINCT x0)","[Person] = Robinson
What is the count of crimes linked to individuals with the surname Robinson?",What is the count of crimes linked to individuals with the surname [x1.Person.surname:Robinson]?,x1.Person.surname:Robinson = Robinson,2,44,count,1
2517,Can you provide a list of places in the M6 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN x0","[Area] = M6
Can you provide a list of places in the M6 area code?",Can you provide a list of places in the [x1.Area.areaCode:M6] area code?,x1.Area.areaCode:M6 = M6,2,351,entity_set,200
3635,Who are the people living with someone who knows a person surnamed Hamilton?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Hamilton"")
RETURN x0","[Person] = Hamilton
Who are the people living with someone who knows a person surnamed Hamilton?",Who are the people living with someone who knows a person surnamed [x2.Person.surname:Hamilton]?,x2.Person.surname:Hamilton = Hamilton,3,151,entity_set,6
1746,How many homes belong to individuals with the surname Murphy?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Murphy"")
RETURN COUNT(DISTINCT x0)","[Person] = Murphy
How many homes belong to individuals with the surname Murphy?",How many homes belong to individuals with the surname [x1.Person.surname:Murphy]?,x1.Person.surname:Murphy = Murphy,2,232,count,1
1139,What phones placed a call at 00:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""00:26"")
RETURN x0","[PhoneCall] = 00:26
What phones placed a call at 00:26?",What phones placed a call at [x1.PhoneCall.call_time:00:26]?,x1.PhoneCall.call_time:00:26 = 00:26,2,151,entity_set,1
1701,Can you provide the location of residence at 57 Linden Avenue for those with the surname Cooper?,"MATCH (x0:Location WHERE x0.address = ""57 Linden Avenue"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Cooper"")
RETURN x0","[Location] = 57 Linden Avenue
[Person] = Cooper
Can you provide the location of residence at 57 Linden Avenue for those with the surname Cooper?",Can you provide the location of residence at [x0.Location.address:57 Linden Avenue] for those with the surname [x1.Person.surname:Cooper]?,"x0.Location.address:57 Linden Avenue = 57 Linden Avenue
x1.Person.surname:Cooper = Cooper",2,224,entity_set,1
1302,How many calls of 69 seconds were answered by any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""69"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 69
How many calls of 69 seconds were answered by any phone?",How many calls of [x0.PhoneCall.call_duration:69] seconds were answered by any phone?,x0.PhoneCall.call_duration:69 = 69,2,172,count,1
1910,How many individuals named Betty reside with a person whose NHS number is 888-09-8856?,"MATCH (x0:Person WHERE x0.name = ""Betty"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""888-09-8856"")
RETURN COUNT(DISTINCT x0)","[Person] = Betty
[Person] = 888-09-8856
How many individuals named Betty reside with a person whose NHS number is 888-09-8856?",How many individuals named [x0.Person.name:Betty] reside with a person whose NHS number is [x1.Person.nhs_no:888-09-8856]?,"x0.Person.name:Betty = Betty
x1.Person.nhs_no:888-09-8856 = 888-09-8856",2,254,count,1
187,How many people called Norma have access to the phone number of a person with surname Matthews?,"MATCH (x0:Person WHERE x0.name = ""Norma"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Matthews"")
RETURN COUNT(DISTINCT x0)","[Person] = Norma
[Person] = Matthews
How many people called Norma have access to the phone number of a person with surname Matthews?",How many people called [x0.Person.name:Norma] have access to the phone number of a person with surname [x1.Person.surname:Matthews]?,"x0.Person.name:Norma = Norma
x1.Person.surname:Matthews = Matthews",2,22,count,1
2276,"How many cases marked as ""Investigation complete; no suspect"" are handled by officer badge 37-2206375?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""37-2206375"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = 37-2206375
How many cases marked as ""Investigation complete; no suspect"" are handled by officer badge 37-2206375?","How many cases marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are handled by officer badge [x1.Officer.badge_no:37-2206375]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect 
x1.Officer.badge_no:37-2206375 = 37-2206375",2,307,count,1
2952,"When did the most recent Exige vehicle crime, investigated by officer badge 02-6848539, occur?","MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""02-6848539"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Exige"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 02-6848539
[Vehicle] = Exige
When did the most recent Exige vehicle crime, investigated by officer badge 02-6848539, occur?","When did the most recent [x1.Vehicle.model:Exige] vehicle crime, investigated by officer badge [x2.Officer.badge_no:02-6848539], occur?","x1.Vehicle.model:Exige = Exige
x2.Officer.badge_no:02-6848539 = 02-6848539",3,429,argmax,1
4523,When did the first crime happen at 60 Victoria Avenue that Officer Cawkwell investigated?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Victoria Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cawkwell"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Victoria Avenue
[Officer] = Cawkwell
When did the first crime happen at 60 Victoria Avenue that Officer Cawkwell investigated?",When did the first crime happen at [x1.Location.address:60 Victoria Avenue] that Officer [x2.Officer.surname:Cawkwell] investigated?,"x1.Location.address:60 Victoria Avenue = 60 Victoria Avenue
x2.Officer.surname:Cawkwell = Cawkwell",3,48,argmin,1
2015,"How many crimes with the status ""Investigation complete; no suspect identified"" involved Protege model vehicles?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Protege"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = Protege
How many crimes with the status ""Investigation complete; no suspect identified"" involved Protege model vehicles?","How many crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involved [x1.Vehicle.model:Protege] model vehicles?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:Protege = Protege",2,270,count,1
2337,How many cases of 'Other theft' are handled by officers with the surname Iddison?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Iddison"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
[Officer] = Iddison
How many cases of 'Other theft' are handled by officers with the surname Iddison?",How many cases of '[x0.Crime.type:Other theft]' are handled by officers with the surname [x1.Officer.surname:Iddison]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Iddison = Iddison",2,318,count,1
2714,On what dates did crimes occur involving a family member with the last name Kelly?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Kelly"")
RETURN x0.date","[Person] = Kelly
On what dates did crimes occur involving a family member with the last name Kelly?",On what dates did crimes occur involving a family member with the last name [x2.Person.surname:Kelly]?,x2.Person.surname:Kelly = Kelly,3,393,attribute_set,3
3400,On what dates did crimes happen involving a cohabitant of someone with the surname Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
On what dates did crimes happen involving a cohabitant of someone with the surname Morales?",On what dates did crimes happen involving a cohabitant of someone with the surname [x2.Person.surname:Morales]?,x2.Person.surname:Morales = Morales,3,55,attribute_set,10
1598,"What are the post codes linked to crime locations from August 15, 2017?","MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""15/08/2017"")
RETURN x0","[Crime] = 15/08/2017
What are the post codes linked to crime locations from August 15, 2017?",What are the post codes linked to crime locations from [x2.Crime.date:15/08/2017]?,"x2.Crime.date:15/08/2017 = August 15, 2017",3,211,entity_set,922
1401,How many times did 9-(882)417-7531 receive calls at 15:03?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""15:03"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(882)417-7531"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 15:03
[Phone] = 9-(882)417-7531
How many times did 9-(882)417-7531 receive calls at 15:03?",How many times did [x1.Phone.phoneNo:9-(882)417-7531] receive calls at [x0.PhoneCall.call_time:15:03]?,"x0.PhoneCall.call_time:15:03 = 15:03
x1.Phone.phoneNo:9-(882)417-7531 = 9-(882)417-7531",2,183,count,1
982,How many crimes included vehicles of the Amanti model?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Amanti"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Amanti
How many crimes included vehicles of the Amanti model?",How many crimes included vehicles of the [x1.Vehicle.model:Amanti] model?,x1.Vehicle.model:Amanti = Amanti,2,128,count,1
2776,What is the most recent offense linked to someone at 54 Barton Street?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""54 Barton Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 54 Barton Street
What is the most recent offense linked to someone at 54 Barton Street?",What is the most recent offense linked to someone at [x2.Location.address:54 Barton Street]?,x2.Location.address:54 Barton Street = 54 Barton Street,3,402,max,1
2301,Could you show me every call made from the phone number 8-(697)626-3419?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(697)626-3419"")
RETURN x0","[Phone] = 8-(697)626-3419
Could you show me every call made from the phone number 8-(697)626-3419?",Could you show me every call made from the phone number [x1.Phone.phoneNo:8-(697)626-3419]?,x1.Phone.phoneNo:8-(697)626-3419 = 8-(697)626-3419,2,310,entity_set,2
2595,What is the first date a crime was investigated by an officer surnamed Stutard?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Stutard"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stutard
What is the first date a crime was investigated by an officer surnamed Stutard?",What is the first date a crime was investigated by an officer surnamed [x1.Officer.surname:Stutard]?,x1.Officer.surname:Stutard = Stutard,2,367,argmin,1
1118,What date marks the initial crime at 34 Toxhead Close?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""34 Toxhead Close"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 34 Toxhead Close
What date marks the initial crime at 34 Toxhead Close?",What date marks the initial crime at [x1.Location.address:34 Toxhead Close]?,x1.Location.address:34 Toxhead Close = 34 Toxhead Close,2,149,argmin,1
1975,How many calls to any phone occurred at 22:48?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""22:48"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 22:48
How many calls to any phone occurred at 22:48?",How many calls to any phone occurred at [x0.PhoneCall.call_time:22:48]?,x0.PhoneCall.call_time:22:48 = 22:48,2,265,count,1
1761,Which regions correspond to postcode WN2 1YL?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WN2 1YL"")
RETURN x0","[PostCode] = WN2 1YL
Which regions correspond to postcode WN2 1YL?",Which regions correspond to postcode [x1.PostCode.code:WN2 1YL]?,x1.PostCode.code:WN2 1YL = WN2 1YL,2,234,entity_set,1
940,How many crimes at 167 Barton Road were marked as Unable to prosecute suspect?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""167 Barton Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = 167 Barton Road
How many crimes at 167 Barton Road were marked as Unable to prosecute suspect?",How many crimes at [x1.Location.address:167 Barton Road] were marked as [x0.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.address:167 Barton Road = 167 Barton Road",2,122,count,1
3574,Can you name the surnames of friends of Amanda who is connected to a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Amanda"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Amanda
Can you name the surnames of friends of Amanda who is connected to a crime?",Can you name the surnames of friends of [x1.Person.name:Amanda] who is connected to a crime?,x1.Person.name:Amanda = Amanda,3,119,attribute_set,7
1981,Can you identify officers named Aldric who worked on cases labeled Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Aldric"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Officer] = Aldric
[Crime] = Unable to prosecute suspect
Can you identify officers named Aldric who worked on cases labeled Unable to prosecute suspect?",Can you identify officers named [x0.Officer.name:Aldric] who worked on cases labeled [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Aldric = Aldric
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,266,entity_set,7
583,What are the call times for calls made to the number 1-(463)289-5744?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(463)289-5744"")
RETURN x0.call_time","[Phone] = 1-(463)289-5744
What are the call times for calls made to the number 1-(463)289-5744?",What are the call times for calls made to the number [x1.Phone.phoneNo:1-(463)289-5744]?,x1.Phone.phoneNo:1-(463)289-5744 = 1-(463)289-5744,2,77,attribute_set,2
1951,How many Discovery cars are associated with crimes?,"MATCH (x0:Vehicle WHERE x0.model = ""Discovery"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Discovery
How many Discovery cars are associated with crimes?",How many [x0.Vehicle.model:Discovery] cars are associated with crimes?,x0.Vehicle.model:Discovery = Discovery,2,260,count,1
163,Which people have their phone numbers known by someone with the NHS number 821-24-9412?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""821-24-9412"")
RETURN x0","[Person] = 821-24-9412
Which people have their phone numbers known by someone with the NHS number 821-24-9412?",Which people have their phone numbers known by someone with the NHS number [x1.Person.nhs_no:821-24-9412]?,x1.Person.nhs_no:821-24-9412 = 821-24-9412,2,19,entity_set,1
1611,Can you list the type of offenses that took place at 174 Mill Lane?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""174 Mill Lane"")
RETURN x0.type","[Location] = 174 Mill Lane
Can you list the type of offenses that took place at 174 Mill Lane?",Can you list the type of offenses that took place at [x1.Location.address:174 Mill Lane]?,x1.Location.address:174 Mill Lane = 174 Mill Lane,2,213,attribute_set,6
3221,Which NHS numbers belong to people who got a call at 09:27?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""09:27"")
RETURN x0.nhs_no","[PhoneCall] = 09:27
Which NHS numbers belong to people who got a call at 09:27?",Which NHS numbers belong to people who got a call at [x2.PhoneCall.call_time:09:27]?,x2.PhoneCall.call_time:09:27 = 09:27,3,26,attribute_set,1
1021,When was the most recent crime at a location with the postcode BL6 4HY?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""BL6 4HY"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = BL6 4HY
When was the most recent crime at a location with the postcode BL6 4HY?",When was the most recent crime at a location with the postcode [x2.PostCode.code:BL6 4HY]?,x2.PostCode.code:BL6 4HY = BL6 4HY,3,135,argmax,1
681,How many locations of residence are linked to anyone named Christine?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Christine"")
RETURN COUNT(DISTINCT x0)","[Person] = Christine
How many locations of residence are linked to anyone named Christine?",How many locations of residence are linked to anyone named [x1.Person.name:Christine]?,x1.Person.name:Christine = Christine,2,90,count,1
2890,What is the oldest vehicle in a vehicle crime case handled by a Police Constable?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Police Constable"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Vehicle crime
[Officer] = Police Constable
What is the oldest vehicle in a vehicle crime case handled by a Police Constable?",What is the oldest vehicle in a [x1.Crime.type:Vehicle crime] case handled by a [x2.Officer.rank:Police Constable]?,"x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.rank:Police Constable = Police Constable",3,419,max,1
125,How many emails are associated with NHS number 591-90-2791?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""591-90-2791"")
RETURN COUNT(DISTINCT x0)","[Person] = 591-90-2791
How many emails are associated with NHS number 591-90-2791?",How many emails are associated with NHS number [x1.Person.nhs_no:591-90-2791]?,x1.Person.nhs_no:591-90-2791 = 591-90-2791,2,15,count,1
2719,What are the dates of crimes linked to a Morales relative?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
What are the dates of crimes linked to a Morales relative?",What are the dates of crimes linked to a [x2.Person.surname:Morales] relative?,x2.Person.surname:Morales = Morales,3,393,attribute_set,7
425,Can you provide the homes of Lawrences in the WA14 1NG postal zone?,"MATCH (x0:Location WHERE x0.postcode = ""WA14 1NG"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Location] = WA14 1NG
[Person] = Lawrence
Can you provide the homes of Lawrences in the WA14 1NG postal zone?",Can you provide the homes of [x1.Person.surname:Lawrence] in the [x0.Location.postcode:WA14 1NG] postal zone?,"x0.Location.postcode:WA14 1NG = WA14 1NG
x1.Person.surname:Lawrence = Lawrences",2,55,entity_set,1
577,Where does someone with NHS number 303-86-0371 live if their postcode is BL6 6HF?,"MATCH (x0:Location WHERE x0.postcode = ""BL6 6HF"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""303-86-0371"")
RETURN x0","[Location] = BL6 6HF
[Person] = 303-86-0371
Where does someone with NHS number 303-86-0371 live if their postcode is BL6 6HF?",Where does someone with NHS number [x1.Person.nhs_no:303-86-0371] live if their postcode is [x0.Location.postcode:BL6 6HF]?,"x0.Location.postcode:BL6 6HF = BL6 6HF
x1.Person.nhs_no:303-86-0371 = 303-86-0371",2,76,entity_set,1
317,"On 23/08/2017, how many times was the number 3-(664)506-0704 dialed?","MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(664)506-0704"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(664)506-0704
On 23/08/2017, how many times was the number 3-(664)506-0704 dialed?","On [x0.PhoneCall.call_date:23/08/2017], how many times was the number [x1.Phone.phoneNo:3-(664)506-0704] dialed?","x0.PhoneCall.call_date:23/08/2017 = 23/08/2017
x1.Phone.phoneNo:3-(664)506-0704 = 3-(664)506-0704",2,40,count,1
1649,What are the 56-second calls received at 5-(606)104-0382?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""56"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(606)104-0382"")
RETURN x0","[PhoneCall] = 56
[Phone] = 5-(606)104-0382
What are the 56-second calls received at 5-(606)104-0382?",What are the [x0.PhoneCall.call_duration:56]-second calls received at [x1.Phone.phoneNo:5-(606)104-0382]?,"x0.PhoneCall.call_duration:56 = 56
x1.Phone.phoneNo:5-(606)104-0382 = 5-(606)104-0382",2,217,entity_set,2
1699,What are the residences at 155 Chapel Street for people whose last name is Sims?,"MATCH (x0:Location WHERE x0.address = ""155 Chapel Street"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Sims"")
RETURN x0","[Location] = 155 Chapel Street
[Person] = Sims
What are the residences at 155 Chapel Street for people whose last name is Sims?",What are the residences at [x0.Location.address:155 Chapel Street] for people whose last name is [x1.Person.surname:Sims]?,"x0.Location.address:155 Chapel Street = 155 Chapel Street
x1.Person.surname:Sims = Sims",2,224,entity_set,1
1129,"How many calls did the number 5-(210)690-9847 get on August 17, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""17/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(210)690-9847"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 17/08/2017
[Phone] = 5-(210)690-9847
How many calls did the number 5-(210)690-9847 get on August 17, 2017?",How many calls did the number [x1.Phone.phoneNo:5-(210)690-9847] get on [x0.PhoneCall.call_date:17/08/2017]?,"x0.PhoneCall.call_date:17/08/2017 = August 17, 2017 
x1.Phone.phoneNo:5-(210)690-9847 = 5-(210)690-9847",2,150,count,1
1324,How many regions contain places with the postcode M30 8NS?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M30 8NS"")
RETURN COUNT(DISTINCT x0)","[Location] = M30 8NS
How many regions contain places with the postcode M30 8NS?",How many regions contain places with the postcode [x1.Location.postcode:M30 8NS]?,x1.Location.postcode:M30 8NS = M30 8NS,2,175,count,1
946,"How many calls were received by any phone on August 30, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""30/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 30/08/2017
How many calls were received by any phone on August 30, 2017?",How many calls were received by any phone on [x0.PhoneCall.call_date:30/08/2017]?,"x0.PhoneCall.call_date:30/08/2017 = August 30, 2017",2,124,count,1
3208,What is the number of people whose friends have the last name Taylor and are related to a Fisher?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Taylor"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Fisher"")
RETURN COUNT(DISTINCT x0)","[Person] = Taylor
[Person] = Fisher
What is the number of people whose friends have the last name Taylor and are related to a Fisher?",What is the number of people whose friends have the last name [x1.Person.surname:Taylor] and are related to a [x2.Person.surname:Fisher]?,"x1.Person.surname:Taylor = Taylor
x2.Person.surname:Fisher = Fisher",3,24,count,1
1184,"Can you identify places with the postcode WN6 7AF linked to crimes marked as ""Unable to prosecute suspect""?","MATCH (x0:Location WHERE x0.postcode = ""WN6 7AF"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Location] = WN6 7AF
[Crime] = Unable to prosecute suspect
Can you identify places with the postcode WN6 7AF linked to crimes marked as ""Unable to prosecute suspect""?","Can you identify places with the postcode [x0.Location.postcode:WN6 7AF] linked to crimes marked as ""[x1.Crime.last_outcome:Unable to prosecute suspect]""?","x0.Location.postcode:WN6 7AF = WN6 7AF
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,158,entity_set,2
1378,How many calls came in to the number 2-(980)215-3814?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""2-(980)215-3814"")
RETURN COUNT(DISTINCT x0)","[Phone] = 2-(980)215-3814
How many calls came in to the number 2-(980)215-3814?",How many calls came in to the number [x1.Phone.phoneNo:2-(980)215-3814]?,x1.Phone.phoneNo:2-(980)215-3814 = 2-(980)215-3814,2,181,count,1
4624,When was the initial crime involving a person from postcode M3 4NW?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = M3 4NW
When was the initial crime involving a person from postcode M3 4NW?",When was the initial crime involving a person from postcode [x2.Location.postcode:M3 4NW]?,x2.Location.postcode:M3 4NW = M3 4NW,3,86,argmin,1
42,Can you identify Toyota cars associated with vehicle offenses?,"MATCH (x0:Vehicle WHERE x0.make = ""Toyota"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Toyota
[Crime] = Vehicle crime
Can you identify Toyota cars associated with vehicle offenses?",Can you identify [x0.Vehicle.make:Toyota] cars associated with [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.make:Toyota = Toyota
x1.Crime.type:Vehicle crime = vehicle offenses",2,5,entity_set,48
1104,Which sites in the M40 1RY area are associated with violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""M40 1RY"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Location] = M40 1RY
[Crime] = Violence and sexual offences
Which sites in the M40 1RY area are associated with violence and sexual offences?",Which sites in the [x0.Location.postcode:M40 1RY] area are associated with [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:M40 1RY = M40 1RY
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,146,entity_set,2
1613,What kinds of crimes happened at 190 Edale Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""190 Edale Street"")
RETURN x0.type","[Location] = 190 Edale Street
What kinds of crimes happened at 190 Edale Street?",What kinds of crimes happened at [x1.Location.address:190 Edale Street]?,x1.Location.address:190 Edale Street = 190 Edale Street,2,213,attribute_set,8
318,What is the count of calls to 3-(664)506-0704 on 23rd August 2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(664)506-0704"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(664)506-0704
What is the count of calls to 3-(664)506-0704 on 23rd August 2017?",What is the count of calls to [x1.Phone.phoneNo:3-(664)506-0704] on [x0.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:23/08/2017 = 23rd August 2017 
x1.Phone.phoneNo:3-(664)506-0704 = 3-(664)506-0704",2,40,count,1
3498,Can you tell me the most recent crime at M24 2GP?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M24 2GP"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M24 2GP
Can you tell me the most recent crime at M24 2GP?",Can you tell me the most recent crime at [x2.PostCode.code:M24 2GP]?,x2.PostCode.code:M24 2GP = M24 2GP,3,103,max,1
581,Can you provide the times of calls to the phone number 4-(974)681-7909?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(974)681-7909"")
RETURN x0.call_time","[Phone] = 4-(974)681-7909
Can you provide the times of calls to the phone number 4-(974)681-7909?",Can you provide the times of calls to the phone number [x1.Phone.phoneNo:4-(974)681-7909]?,x1.Phone.phoneNo:4-(974)681-7909 = 4-(974)681-7909,2,77,attribute_set,2
1163,What phones were called at 20:53?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""20:53"")
RETURN x0","[PhoneCall] = 20:53
What phones were called at 20:53?",What phones were called at [x1.PhoneCall.call_time:20:53]?,x1.PhoneCall.call_time:20:53 = 20:53,2,154,entity_set,1
81,Can you identify all Henrys with the email hjacobs91@virginia.edu?,"MATCH (x0:Person WHERE x0.name = ""Henry"")-[:HAS_EMAIL]-(x1:Email WHERE x1.email_address = ""hjacobs91@virginia.edu"")
RETURN x0","[Person] = Henry
[Email] = hjacobs91@virginia.edu
Can you identify all Henrys with the email hjacobs91@virginia.edu?",Can you identify all [x0.Person.name:Henry] with the email [x1.Email.email_address:hjacobs91@virginia.edu]?,"x0.Person.name:Henry = Henrys
x1.Email.email_address:hjacobs91@virginia.edu = hjacobs91@virginia.edu",2,10,entity_set,1
1578,Can you provide a list of crimes at places with the postcode M4 6EW?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M4 6EW"")
RETURN x0","[Location] = M4 6EW
Can you provide a list of crimes at places with the postcode M4 6EW?",Can you provide a list of crimes at places with the postcode [x1.Location.postcode:M4 6EW]?,x1.Location.postcode:M4 6EW = M4 6EW,2,209,entity_set,2
2953,What is the most recent date of an Exige vehicle crime under investigation by officer 02-6848539?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""02-6848539"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Exige"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 02-6848539
[Vehicle] = Exige
What is the most recent date of an Exige vehicle crime under investigation by officer 02-6848539?",What is the most recent date of an [x1.Vehicle.model:Exige] vehicle crime under investigation by officer [x2.Officer.badge_no:02-6848539]?,"x1.Vehicle.model:Exige = Exige
x2.Officer.badge_no:02-6848539 = 02-6848539",3,429,argmax,1
2304,Could you show me the emails of people named Benjamin?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Benjamin"")
RETURN x0","[Person] = Benjamin
Could you show me the emails of people named Benjamin?",Could you show me the emails of people named [x1.Person.name:Benjamin]?,x1.Person.name:Benjamin = Benjamin,2,311,entity_set,2
1256,Can you provide a list of GTI model crimes from 30/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""30/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""GTI"")
RETURN x0","[Crime] = 30/08/2017
[Vehicle] = GTI
Can you provide a list of GTI model crimes from 30/08/2017?",Can you provide a list of [x1.Vehicle.model:GTI] model crimes from [x0.Crime.date:30/08/2017]?,"x0.Crime.date:30/08/2017 = 30/08/2017
x1.Vehicle.model:GTI = GTI",2,167,entity_set,1
1748,In how many places do people with surname Porter live in?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Porter"")
RETURN COUNT(DISTINCT x0)","[Person] = Porter
In how many places do people with surname Porter live in?",In how many places do people with surname [x1.Person.surname:Porter] live in?,x1.Person.surname:Porter = Porter,2,232,count,1
