id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2072,How many vehicle crimes involved Mitsubishi cars?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Mitsubishi"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Mitsubishi
How many vehicle crimes involved Mitsubishi cars?",How many [x0.Crime.type:Vehicle crime] involved [x1.Vehicle.make:Mitsubishi] cars?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Mitsubishi = Mitsubishi",2,278,count,1
1029,When did the last crime occur at an address with the postal code SK2 6PE?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""SK2 6PE"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = SK2 6PE
When did the last crime occur at an address with the postal code SK2 6PE?",When did the last crime occur at an address with the postal code [x2.PostCode.code:SK2 6PE]?,x2.PostCode.code:SK2 6PE = SK2 6PE,3,135,argmax,1
293,Which offences related to violence and sex took place at 183 Naylor Street?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Naylor Street"")
RETURN x0","[Crime] = Violence and sexual offences
[Location] = 183 Naylor Street
Which offences related to violence and sex took place at 183 Naylor Street?",Which offences related to [x0.Crime.type:Violence and sexual offences] took place at [x1.Location.address:183 Naylor Street]?,"x0.Crime.type:Violence and sexual offences = violence and sex 
x1.Location.address:183 Naylor Street = 183 Naylor Street",2,37,entity_set,1
1376,How many calls did 9-(074)489-3512 get?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""9-(074)489-3512"")
RETURN COUNT(DISTINCT x0)","[Phone] = 9-(074)489-3512
How many calls did 9-(074)489-3512 get?",How many calls did [x1.Phone.phoneNo:9-(074)489-3512] get?,x1.Phone.phoneNo:9-(074)489-3512 = 9-(074)489-3512,2,181,count,1
2914,What was the earliest incident at 169 Thynne Street with a Firebird car?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""169 Thynne Street"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Firebird"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 169 Thynne Street
[Vehicle] = Firebird
What was the earliest incident at 169 Thynne Street with a Firebird car?",What was the earliest incident at [x2.Location.address:169 Thynne Street] with a [x1.Vehicle.model:Firebird] car?,"x1.Vehicle.model:Firebird = Firebird
x2.Location.address:169 Thynne Street = 169 Thynne Street",3,422,min,1
2129,Which phone call received by someone surnamed Weaver has the earliest date?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Weaver"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Weaver
Which phone call received by someone surnamed Weaver has the earliest date?",Which phone call received by someone surnamed [x2.Person.surname:Weaver] has the earliest date?,x2.Person.surname:Weaver = Weaver,3,288,min,1
2531,How many officers called Noland looked into any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Noland"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Noland
How many officers called Noland looked into any crimes?",How many officers called [x0.Officer.name:Noland] looked into any crimes?,x0.Officer.name:Noland = Noland,2,354,count,1
1508,What is the first crime linked to people with the surname Harper?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Harper"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Harper
What is the first crime linked to people with the surname Harper?",What is the first crime linked to people with the surname [x1.Person.surname:Harper]?,x1.Person.surname:Harper = Harper,2,200,min,1
2978,When was the initial crime associated with the email npayneau@craigslist.org committed?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""npayneau@craigslist.org"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = npayneau@craigslist.org
When was the initial crime associated with the email npayneau@craigslist.org committed?",When was the initial crime associated with the email [x2.Email.email_address:npayneau@craigslist.org] committed?,x2.Email.email_address:npayneau@craigslist.org = npayneau@craigslist.org,3,431,argmin,1
886,What are the emails of individuals with NHS number 859-40-9947?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""859-40-9947"")
RETURN x0","[Person] = 859-40-9947
What are the emails of individuals with NHS number 859-40-9947?",What are the emails of individuals with NHS number [x1.Person.nhs_no:859-40-9947]?,x1.Person.nhs_no:859-40-9947 = 859-40-9947,2,116,entity_set,1
1377,What is the call count for 9-(074)489-3512?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""9-(074)489-3512"")
RETURN COUNT(DISTINCT x0)","[Phone] = 9-(074)489-3512
What is the call count for 9-(074)489-3512?",What is the call count for [x1.Phone.phoneNo:9-(074)489-3512]?,x1.Phone.phoneNo:9-(074)489-3512 = 9-(074)489-3512,2,181,count,1
1617,Can you provide the various types of crimes that took place at 131 Fern Close?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""131 Fern Close"")
RETURN x0.type","[Location] = 131 Fern Close
Can you provide the various types of crimes that took place at 131 Fern Close?",Can you provide the various types of crimes that took place at [x1.Location.address:131 Fern Close]?,x1.Location.address:131 Fern Close = 131 Fern Close,2,213,attribute_set,3
4629,What is initial crime with a person aware of Melissa's phone number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Melissa"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Melissa
What is initial crime with a person aware of Melissa's phone number?",What is initial crime with a person aware of [x2.Person.name:Melissa]'s phone number?,x2.Person.name:Melissa = Melissa,3,89,min,1
212,How many crimes from 6/08/2017 are being looked into by officers?,"MATCH (x0:Crime WHERE x0.date = ""6/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 6/08/2017
How many crimes from 6/08/2017 are being looked into by officers?",How many crimes from [x0.Crime.date:6/08/2017] are being looked into by officers?,x0.Crime.date:6/08/2017 = 6/08/2017,2,25,count,1
1857,Can you provide the zip code for 73 Longford Street?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""73 Longford Street"")
RETURN x0","[Location] = 73 Longford Street
Can you provide the zip code for 73 Longford Street?",Can you provide the zip code for [x1.Location.address:73 Longford Street]?,x1.Location.address:73 Longford Street = 73 Longford Street,2,247,entity_set,1
805,"What are the badge numbers of officers who investigated crimes on August 14, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""14/08/2017"")
RETURN x0.badge_no","[Crime] = 14/08/2017
What are the badge numbers of officers who investigated crimes on August 14, 2017?",What are the badge numbers of officers who investigated crimes on [x1.Crime.date:14/08/2017]?,"x1.Crime.date:14/08/2017 = August 14, 2017",2,106,attribute_set,959
1470,Which phones are associated with the surname Kennedy?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Kennedy"")
RETURN x0","[Person] = Kennedy
Which phones are associated with the surname Kennedy?",Which phones are associated with the surname [x1.Person.surname:Kennedy]?,x1.Person.surname:Kennedy = Kennedy,2,193,entity_set,1
2141,What is the number of phones that got a call on 11/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""11/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11/08/2017
What is the number of phones that got a call on 11/08/2017?",What is the number of phones that got a call on [x1.PhoneCall.call_date:11/08/2017]?,x1.PhoneCall.call_date:11/08/2017 = 11/08/2017,2,289,count,1
1802,How many Police Constables looked into vehicle crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = Vehicle crime
How many Police Constables looked into vehicle crimes?",How many [x0.Officer.rank:Police Constable] looked into [x1.Crime.type:Vehicle crime]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.type:Vehicle crime = vehicle crimes",2,238,count,1
797,How many offenses took place on 24/08/2017 in locations with the SK14 4DP postcode?,"MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK14 4DP"")
RETURN COUNT(DISTINCT x0)","[Crime] = 24/08/2017
[Location] = SK14 4DP
How many offenses took place on 24/08/2017 in locations with the SK14 4DP postcode?",How many offenses took place on [x0.Crime.date:24/08/2017] in locations with the [x1.Location.postcode:SK14 4DP] postcode?,"x0.Crime.date:24/08/2017 = 24/08/2017
x1.Location.postcode:SK14 4DP = SK14 4DP",2,104,count,1
1276,How many called Diane are friends with someone whose last name is Bennett?,"MATCH (x0:Person WHERE x0.name = ""Diane"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Bennett"")
RETURN COUNT(DISTINCT x0)","[Person] = Diane
[Person] = Bennett
How many called Diane are friends with someone whose last name is Bennett?",How many called [x0.Person.name:Diane] are friends with someone whose last name is [x1.Person.surname:Bennett]?,"x0.Person.name:Diane = Diane
x1.Person.surname:Bennett = Bennett",2,169,count,1
3570,What are the last names of friends of Amy who is linked to a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Amy"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Amy
What are the last names of friends of Amy who is linked to a crime?",What are the last names of friends of [x1.Person.name:Amy] who is linked to a crime?,x1.Person.name:Amy = Amy,3,119,attribute_set,12
2600,When did an officer with last name Slavin first investigate a crime?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Slavin"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Slavin
When did an officer with last name Slavin first investigate a crime?",When did an officer with last name [x1.Officer.surname:Slavin] first investigate a crime?,x1.Officer.surname:Slavin = Slavin,2,367,argmin,1
127,How many emails correspond to the NHS number 591-90-2791?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""591-90-2791"")
RETURN COUNT(DISTINCT x0)","[Person] = 591-90-2791
How many emails correspond to the NHS number 591-90-2791?",How many emails correspond to the NHS number [x1.Person.nhs_no:591-90-2791]?,x1.Person.nhs_no:591-90-2791 = 591-90-2791,2,15,count,1
3238,Can you name those living with someone who has an email address?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:HAS_EMAIL]-(x2:Email)
RETURN x0.name",Can you name those living with someone who has an email address?,Can you name those living with someone who has an email address?,,3,28,attribute_set,153
2427,What is the earliest crime investigated by officers whose last name is Jupp?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Jupp"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Jupp
What is the earliest crime investigated by officers whose last name is Jupp?",What is the earliest crime investigated by officers whose last name is [x1.Officer.surname:Jupp]?,x1.Officer.surname:Jupp = Jupp,2,334,min,1
1586,How many regions include the postcode M11 1AD?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""M11 1AD"")
RETURN COUNT(DISTINCT x0)","[PostCode] = M11 1AD
How many regions include the postcode M11 1AD?",How many regions include the postcode [x1.PostCode.code:M11 1AD]?,x1.PostCode.code:M11 1AD = M11 1AD,2,210,count,1
4530,What is the earliest offense linked to a relative of a person named Jessica?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.name = ""Jessica"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Jessica
What is the earliest offense linked to a relative of a person named Jessica?",What is the earliest offense linked to a relative of a person named [x2.Person.name:Jessica]?,x2.Person.name:Jessica = Jessica,3,51,max,1
3359,How many places with vehicle crimes involved individuals named Amy?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Amy
How many places with vehicle crimes involved individuals named Amy?",How many places with [x1.Crime.type:Vehicle crime] involved individuals named [x2.Person.name:Amy]?,"x1.Crime.type:Vehicle crime = vehicle crimes
x2.Person.name:Amy = Amy",3,47,count,1
1743,How many homes belong to individuals with the surname Black?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Black"")
RETURN COUNT(DISTINCT x0)","[Person] = Black
How many homes belong to individuals with the surname Black?",How many homes belong to individuals with the surname [x1.Person.surname:Black]?,x1.Person.surname:Black = Black,2,232,count,1
3222,What are the NHS numbers of individuals called at 21:07?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""21:07"")
RETURN x0.nhs_no","[PhoneCall] = 21:07
What are the NHS numbers of individuals called at 21:07?",What are the NHS numbers of individuals called at [x2.PhoneCall.call_time:21:07]?,x2.PhoneCall.call_time:21:07 = 21:07,3,26,attribute_set,1
629,Can you provide a list of 2007 vehicles linked to vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2007"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2007
[Crime] = Vehicle crime
Can you provide a list of 2007 vehicles linked to vehicle crimes?",Can you provide a list of [x0.Vehicle.year:2007] vehicles linked to [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2007 = 2007
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,36
3127,Can you provide the lengths of calls on 29/08/2017 received by phones that called on 20/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""20/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 29/08/2017
[PhoneCall] = 20/08/2017
Can you provide the lengths of calls on 29/08/2017 received by phones that called on 20/08/2017?",Can you provide the lengths of calls on [x0.PhoneCall.call_date:29/08/2017] received by phones that called on [x2.PhoneCall.call_date:20/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = 29/08/2017
x2.PhoneCall.call_date:20/08/2017 = 20/08/2017",3,11,attribute_set,2
347,What crimes happened last at 177 Gerald Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""177 Gerald Road"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 177 Gerald Road
What crimes happened last at 177 Gerald Road?",What crimes happened last at [x1.Location.address:177 Gerald Road]?,x1.Location.address:177 Gerald Road = 177 Gerald Road,2,43,max,1
1723,How many individuals named Patricia live alongside those with the last name Mccoy?,"MATCH (x0:Person WHERE x0.name = ""Patricia"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Mccoy"")
RETURN COUNT(DISTINCT x0)","[Person] = Patricia
[Person] = Mccoy
How many individuals named Patricia live alongside those with the last name Mccoy?",How many individuals named [x0.Person.name:Patricia] live alongside those with the last name [x1.Person.surname:Mccoy]?,"x0.Person.name:Patricia = Patricia
x1.Person.surname:Mccoy = Mccoy",2,226,count,1
2306,What are the emails of people named James?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""James"")
RETURN x0","[Person] = James
What are the emails of people named James?",What are the emails of people named [x1.Person.name:James]?,x1.Person.name:James = James,2,311,entity_set,1
183,How many individuals named Joan possess the contact number of a Robertson?,"MATCH (x0:Person WHERE x0.name = ""Joan"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Person] = Joan
[Person] = Robertson
How many individuals named Joan possess the contact number of a Robertson?",How many individuals named [x0.Person.name:Joan] possess the contact number of a [x1.Person.surname:Robertson]?,"x0.Person.name:Joan = Joan
x1.Person.surname:Robertson = Robertson",2,22,count,1
2164,How many burglary investigations involve the officer whose badge is 23-7304886?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""23-7304886"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = 23-7304886
How many burglary investigations involve the officer whose badge is 23-7304886?",How many [x0.Crime.type:Burglary] investigations involve the officer whose badge is [x1.Officer.badge_no:23-7304886]?,"x0.Crime.type:Burglary = burglary
x1.Officer.badge_no:23-7304886 = 23-7304886",2,292,count,1
4543,Which people are familiar with a friend of the person whose NHS number is 276-19-9235?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""276-19-9235"")
RETURN x0","[Person] = 276-19-9235
Which people are familiar with a friend of the person whose NHS number is 276-19-9235?",Which people are familiar with a friend of the person whose NHS number is [x2.Person.nhs_no:276-19-9235]?,x2.Person.nhs_no:276-19-9235 = 276-19-9235,3,54,entity_set,23
1982,Who are the officers named Manuel involved in cases still under investigation?,"MATCH (x0:Officer WHERE x0.name = ""Manuel"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Manuel
[Crime] = Under investigation
Who are the officers named Manuel involved in cases still under investigation?",Who are the officers named [x0.Officer.name:Manuel] involved in cases still [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.name:Manuel = Manuel
x1.Crime.last_outcome:Under investigation = under investigation",2,266,entity_set,5
720,Can you identify crime sites with the postcode SK15 2AL from 10/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""SK15 2AL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN x0","[Location] = SK15 2AL
[Crime] = 10/08/2017
Can you identify crime sites with the postcode SK15 2AL from 10/08/2017?",Can you identify crime sites with the postcode [x0.Location.postcode:SK15 2AL] from [x1.Crime.date:10/08/2017]?,"x0.Location.postcode:SK15 2AL = SK15 2AL
x1.Crime.date:10/08/2017 = 10/08/2017",2,96,entity_set,1
2971,What is the date of the first offense linked to bmoore1g@rediff.com?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""bmoore1g@rediff.com"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = bmoore1g@rediff.com
What is the date of the first offense linked to bmoore1g@rediff.com?",What is the date of the first offense linked to [x2.Email.email_address:bmoore1g@rediff.com]?,x2.Email.email_address:bmoore1g@rediff.com = bmoore1g@rediff.com,3,431,argmin,1
2109,Can you identify those with the phone number 7-(469)440-8216?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""7-(469)440-8216"")
RETURN x0","[Phone] = 7-(469)440-8216
Can you identify those with the phone number 7-(469)440-8216?",Can you identify those with the phone number [x1.Phone.phoneNo:7-(469)440-8216]?,x1.Phone.phoneNo:7-(469)440-8216 = 7-(469)440-8216,2,285,entity_set,1
2764,"How many emails are there for Christopher, who has a family tie to a Murray?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Christopher"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Murray
How many emails are there for Christopher, who has a family tie to a Murray?","How many emails are there for [x1.Person.name:Christopher], who has a family tie to a [x2.Person.surname:Murray]?","x1.Person.name:Christopher = Christopher
x2.Person.surname:Murray = Murray",3,400,count,1
4398,How often do crimes involve a person and a vehicle?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle)
MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How often do crimes involve a person and a vehicle?,How often do crimes involve a person and a vehicle?,,3,5,count,1
1316,How many times was 1-(463)289-5744 called at 01:47?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""01:47"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(463)289-5744"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 01:47
[Phone] = 1-(463)289-5744
How many times was 1-(463)289-5744 called at 01:47?",How many times was [x1.Phone.phoneNo:1-(463)289-5744] called at [x0.PhoneCall.call_time:01:47]?,"x0.PhoneCall.call_time:01:47 = 01:47
x1.Phone.phoneNo:1-(463)289-5744 = 1-(463)289-5744",2,174,count,1
2495,What's the number of people with a phone?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN COUNT(DISTINCT x0)",What's the number of people with a phone?,What's the number of people with a phone?,,2,346,count,1
2845,What was the latest offense associated with a person with the number 0-(752)850-0116?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""0-(752)850-0116"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 0-(752)850-0116
What was the latest offense associated with a person with the number 0-(752)850-0116?",What was the latest offense associated with a person with the number [x2.Phone.phoneNo:0-(752)850-0116]?,x2.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116,3,414,max,1
2208,"How many crimes with the status ""Investigation complete; no suspect identified"" are overseen by Sergeants?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = Sergeant
How many crimes with the status ""Investigation complete; no suspect identified"" are overseen by Sergeants?","How many crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are overseen by [x1.Officer.rank:Sergeant]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Officer.rank:Sergeant = Sergeants",2,298,count,1
3640,Which people share a home with someone familiar with a person whose last name is Barnes?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Barnes"")
RETURN x0","[Person] = Barnes
Which people share a home with someone familiar with a person whose last name is Barnes?",Which people share a home with someone familiar with a person whose last name is [x2.Person.surname:Barnes]?,x2.Person.surname:Barnes = Barnes,3,151,entity_set,3
52,"How many officers named Meara probed crimes that occured on August 28, 2017?","MATCH (x0:Officer WHERE x0.name = ""Meara"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""28/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Meara
[Crime] = 28/08/2017
How many officers named Meara probed crimes that occured on August 28, 2017?",How many officers named [x0.Officer.name:Meara] probed crimes that occured on [x1.Crime.date:28/08/2017]?,"x0.Officer.name:Meara = Meara
x1.Crime.date:28/08/2017 = August 28, 2017",2,6,count,1
1691,"What is the number of crimes reported at 141 Dominic Close on August 17, 2017?","MATCH (x0:Crime WHERE x0.date = ""17/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""141 Dominic Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = 17/08/2017
[Location] = 141 Dominic Close
What is the number of crimes reported at 141 Dominic Close on August 17, 2017?",What is the number of crimes reported at [x1.Location.address:141 Dominic Close] on [x0.Crime.date:17/08/2017]?,"x0.Crime.date:17/08/2017 = August 17, 2017 
x1.Location.address:141 Dominic Close = 141 Dominic Close",2,223,count,1
1383,How many times was 2-(362)925-2397 called?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""2-(362)925-2397"")
RETURN COUNT(DISTINCT x0)","[Phone] = 2-(362)925-2397
How many times was 2-(362)925-2397 called?",How many times was [x1.Phone.phoneNo:2-(362)925-2397] called?,x1.Phone.phoneNo:2-(362)925-2397 = 2-(362)925-2397,2,181,count,1
4521,What is the date of the first crime at 19 Lily Avenue that Officer Havill looked into?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""19 Lily Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Havill"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 19 Lily Avenue
[Officer] = Havill
What is the date of the first crime at 19 Lily Avenue that Officer Havill looked into?",What is the date of the first crime at [x1.Location.address:19 Lily Avenue] that Officer [x2.Officer.surname:Havill] looked into?,"x1.Location.address:19 Lily Avenue = 19 Lily Avenue
x2.Officer.surname:Havill = Havill",3,48,argmin,1
1643,When was the most recent crime at 194 Garth Road that was investigated by an officer with last name Brister?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Brister"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""194 Garth Road"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = Brister
[Location] = 194 Garth Road
When was the most recent crime at 194 Garth Road that was investigated by an officer with last name Brister?",When was the most recent crime at [x1.Location.address:194 Garth Road] that was investigated by an officer with last name [x2.Officer.surname:Brister]?,"x1.Location.address:194 Garth Road = 194 Garth Road
x2.Officer.surname:Brister = Brister",3,216,argmax,1
2603,What's the number of individuals with an email address?,"MATCH (x0:Person)-[:HAS_EMAIL]-(x1:Email)
RETURN COUNT(DISTINCT x0)",What's the number of individuals with an email address?,What's the number of individuals with an email address?,,2,368,count,1
1793,Who is the eldest individual residing with the Hernandez family?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Hernandez
Who is the eldest individual residing with the Hernandez family?",Who is the eldest individual residing with the [x1.Person.surname:Hernandez] family?,x1.Person.surname:Hernandez = Hernandez,2,237,max,1
2921,At what times did the inhabitants of 199 Sandringham Drive engage in criminal acts?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""199 Sandringham Drive"")
RETURN x0.date","[Location] = 199 Sandringham Drive
At what times did the inhabitants of 199 Sandringham Drive engage in criminal acts?",At what times did the inhabitants of [x2.Location.address:199 Sandringham Drive] engage in criminal acts?,x2.Location.address:199 Sandringham Drive = 199 Sandringham Drive,3,424,attribute_set,1
3355,Which email addresses correspond to people living in the M3 4NW postal code?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.email_address","[Location] = M3 4NW
Which email addresses correspond to people living in the M3 4NW postal code?",Which email addresses correspond to people living in the [x2.Location.postcode:M3 4NW] postal code?,x2.Location.postcode:M3 4NW = M3 4NW,3,45,attribute_set,3
1291,How many violent and sexual crimes happened anywhere?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
How many violent and sexual crimes happened anywhere?",How many [x0.Crime.type:Violence and sexual offences] happened anywhere?,x0.Crime.type:Violence and sexual offences = violent and sexual crimes,2,171,count,1
1346,Can you identify Mazda cars connected to any crimes on 3/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Mazda"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""3/08/2017"")
RETURN x0","[Vehicle] = Mazda
[Crime] = 3/08/2017
Can you identify Mazda cars connected to any crimes on 3/08/2017?",Can you identify [x0.Vehicle.make:Mazda] cars connected to any crimes on [x1.Crime.date:3/08/2017]?,"x0.Vehicle.make:Mazda = Mazda
x1.Crime.date:3/08/2017 = 3/08/2017",2,177,entity_set,1
1751,How many crimes included vehicles from 2002?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2002"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2002
How many crimes included vehicles from 2002?",How many crimes included vehicles from [x1.Vehicle.year:2002]?,x1.Vehicle.year:2002 = 2002,2,233,count,1
1763,What areas are linked to postcode OL9 8HD?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL9 8HD"")
RETURN x0","[PostCode] = OL9 8HD
What areas are linked to postcode OL9 8HD?",What areas are linked to postcode [x1.PostCode.code:OL9 8HD]?,x1.PostCode.code:OL9 8HD = OL9 8HD,2,234,entity_set,1
1850,What is the postal code for 116 China Lane?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""116 China Lane"")
RETURN x0","[Location] = 116 China Lane
What is the postal code for 116 China Lane?",What is the postal code for [x1.Location.address:116 China Lane]?,x1.Location.address:116 China Lane = 116 China Lane,2,247,entity_set,1
409,What are all the places with the postcode M16 7WP?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M16 7WP"")
RETURN x0","[PostCode] = M16 7WP
What are all the places with the postcode M16 7WP?",What are all the places with the postcode [x1.PostCode.code:M16 7WP]?,x1.PostCode.code:M16 7WP = M16 7WP,2,54,entity_set,1
1823,Who is the youngest individual residing with someone who knows the phone number of someone with last name Garza?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Garza"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Garza
Who is the youngest individual residing with someone who knows the phone number of someone with last name Garza?",Who is the youngest individual residing with someone who knows the phone number of someone with last name [x2.Person.surname:Garza]?,x2.Person.surname:Garza = Garza,3,243,min,1
631,Which vehicles from 2003 were involved in vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2003"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2003
[Crime] = Vehicle crime
Which vehicles from 2003 were involved in vehicle crimes?",Which vehicles from [x0.Vehicle.year:2003] were involved in [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2003 = 2003
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,44
3353,What are the email addresses of residents in M3 4NW locations?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.email_address","[Location] = M3 4NW
What are the email addresses of residents in M3 4NW locations?",What are the email addresses of residents in [x2.Location.postcode:M3 4NW] locations?,x2.Location.postcode:M3 4NW = M3 4NW,3,45,attribute_set,3
3213,How many individuals have friends with surname Fields who are also kin to someone with last name Austin?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Fields"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Austin"")
RETURN COUNT(DISTINCT x0)","[Person] = Fields
[Person] = Austin
How many individuals have friends with surname Fields who are also kin to someone with last name Austin?",How many individuals have friends with surname [x1.Person.surname:Fields] who are also kin to someone with last name [x2.Person.surname:Austin]?,"x1.Person.surname:Fields = Fields
x2.Person.surname:Austin = Austin",3,24,count,1
