id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1995,Which offenses on 13/08/2017 are under investigation by Police Constables?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 13/08/2017
[Officer] = Police Constable
Which offenses on 13/08/2017 are under investigation by Police Constables?",Which offenses on [x0.Crime.date:13/08/2017] are under investigation by [x1.Officer.rank:Police Constable]?,"x0.Crime.date:13/08/2017 = 13/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,349
2060,Who are the individuals acquainted with someone with surname Boyd?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN x0","[Person] = Boyd
Who are the individuals acquainted with someone with surname Boyd?",Who are the individuals acquainted with someone with surname [x1.Person.surname:Boyd]?,x1.Person.surname:Boyd = Boyd,2,277,entity_set,10
167,Who are the people whose phone numbers are known by someone with NHS number 780-64-7865?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""780-64-7865"")
RETURN x0","[Person] = 780-64-7865
Who are the people whose phone numbers are known by someone with NHS number 780-64-7865?",Who are the people whose phone numbers are known by someone with NHS number [x1.Person.nhs_no:780-64-7865]?,x1.Person.nhs_no:780-64-7865 = 780-64-7865,2,19,entity_set,1
885,Which emails correspond to the NHS number 820-53-4909?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""820-53-4909"")
RETURN x0","[Person] = 820-53-4909
Which emails correspond to the NHS number 820-53-4909?",Which emails correspond to the NHS number [x1.Person.nhs_no:820-53-4909]?,x1.Person.nhs_no:820-53-4909 = 820-53-4909,2,116,entity_set,1
2734,Who is the senior family member linked to a Boyd's friend?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Boyd"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Boyd
Who is the senior family member linked to a Boyd's friend?",Who is the senior family member linked to a [x2.Person.surname:Boyd]'s friend?,x2.Person.surname:Boyd = Boyd,3,396,max,1
2516,What locations are within the M6 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN x0","[Area] = M6
What locations are within the M6 area code?",What locations are within the [x1.Area.areaCode:M6] area code?,x1.Area.areaCode:M6 = M6,2,351,entity_set,200
863,How many people does a person with the surname Hamilton know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Hamilton"")
RETURN COUNT(DISTINCT x0)","[Person] = Hamilton
How many people does a person with the surname Hamilton know?",How many people does a person with the surname [x1.Person.surname:Hamilton] know?,x1.Person.surname:Hamilton = Hamilton,2,114,count,1
2180,How many Cadillacs are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Cadillac
How many Cadillacs are linked to crimes?",How many [x0.Vehicle.make:Cadillac] are linked to crimes?,x0.Vehicle.make:Cadillac = Cadillacs,2,295,count,1
3034,What emails corresponds to the person with phone number 3-(246)177-0272?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(246)177-0272"")
RETURN x0","[Phone] = 3-(246)177-0272
What emails corresponds to the person with phone number 3-(246)177-0272?",What emails corresponds to the person with phone number [x2.Phone.phoneNo:3-(246)177-0272]?,x2.Phone.phoneNo:3-(246)177-0272 = 3-(246)177-0272,3,442,entity_set,1
955,"Who are the officers who looked into crimes on August 31, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN x0","[Crime] = 31/08/2017
Who are the officers who looked into crimes on August 31, 2017?",Who are the officers who looked into crimes on [x1.Crime.date:31/08/2017]?,"x1.Crime.date:31/08/2017 = August 31, 2017",2,125,entity_set,933
3020,What is the date of the latest offense at locations of residence of individuals with the last name Bennett?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Bennett"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Bennett
What is the date of the latest offense at locations of residence of individuals with the last name Bennett?",What is the date of the latest offense at locations of residence of individuals with the last name [x2.Person.surname:Bennett]?,x2.Person.surname:Bennett = Bennett,3,439,argmax,1
4411,Which is the newest vehicle connected to a crime at 35 Back St George's Road North?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""35 Back St George'S Road North"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 35 Back St George'S Road North
Which is the newest vehicle connected to a crime at 35 Back St George's Road North?",Which is the newest vehicle connected to a crime at [x2.Location.address:35 Back St George'S Road North]?,x2.Location.address:35 Back St George'S Road North = 35 Back St George's Road North,3,12,max,1
2446,How many sites fall under the M12 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M12"")
RETURN COUNT(DISTINCT x0)","[Area] = M12
How many sites fall under the M12 area code?",How many sites fall under the [x1.Area.areaCode:M12] area code?,x1.Area.areaCode:M12 = M12,2,337,count,1
2314,How many vehicles are associated with crimes that have been investigated but lack a suspect?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
How many vehicles are associated with crimes that have been investigated but lack a suspect?",How many vehicles are associated with crimes that have been [x1.Crime.last_outcome:Investigation complete; no suspect identified]?,x1.Crime.last_outcome:Investigation complete; no suspect identified = investigated but lack a suspect,2,312,count,1
3125,How long were the calls on 04/08/2017 to phones that placed calls on 30/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""04/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""30/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 04/08/2017
[PhoneCall] = 30/08/2017
How long were the calls on 04/08/2017 to phones that placed calls on 30/08/2017?",How long were the calls on [x0.PhoneCall.call_date:04/08/2017] to phones that placed calls on [x2.PhoneCall.call_date:30/08/2017]?,"x0.PhoneCall.call_date:04/08/2017 = 04/08/2017
x2.PhoneCall.call_date:30/08/2017 = 30/08/2017",3,11,attribute_set,4
2401,What's the first recorded crime with a Williamson and a Continental Mark VII?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Continental Mark VII"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Continental Mark VII
[Person] = Williamson
What's the first recorded crime with a Williamson and a Continental Mark VII?",What's the first recorded crime with a [x1.Person.surname:Williamson] and a [x2.Vehicle.model:Continental Mark VII]?,"x1.Person.surname:Williamson = Williamson
x2.Vehicle.model:Continental Mark VII = Continental Mark VII",3,331,min,1
3289,Which most recent vehicle-related crime happened at M9 6DA?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M9 6DA"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = M9 6DA
Which most recent vehicle-related crime happened at M9 6DA?",Which most recent vehicle-related crime happened at [x1.Location.postcode:M9 6DA]?,x1.Location.postcode:M9 6DA = M9 6DA,3,37,max,1
2155,How many officers handled robbery investigations?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Robbery"")
RETURN COUNT(DISTINCT x0)","[Crime] = Robbery
How many officers handled robbery investigations?",How many officers handled [x1.Crime.type:Robbery] investigations?,x1.Crime.type:Robbery = robbery,2,291,count,1
2938,"How many unresolved investigations with the status ""Investigation complete; no suspect identified"" include suspects with the surname Peters and are conducted by officers with last name Rudwell?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Peters"")
MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Rudwell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Peters
[Officer] = Rudwell
How many unresolved investigations with the status ""Investigation complete; no suspect identified"" include suspects with the surname Peters and are conducted by officers with last name Rudwell?","How many unresolved investigations with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" include suspects with the surname [x2.Person.surname:Peters] and are conducted by officers with last name [x1.Officer.surname:Rudwell]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Officer.surname:Rudwell = Rudwell
x2.Person.surname:Peters = Peters",3,426,count,1
2957,When was the last Safari vehicle crime probed by officer 47-5316983?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""47-5316983"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Safari"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 47-5316983
[Vehicle] = Safari
When was the last Safari vehicle crime probed by officer 47-5316983?",When was the last [x1.Vehicle.model:Safari] vehicle crime probed by officer [x2.Officer.badge_no:47-5316983]?,"x1.Vehicle.model:Safari = Safari
x2.Officer.badge_no:47-5316983 = 47-5316983",3,429,argmax,1
1989,Can you provide the emails of those who have the phone number of a person with the last name Fox?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Fox"")
RETURN x0","[Person] = Fox
Can you provide the emails of those who have the phone number of a person with the last name Fox?",Can you provide the emails of those who have the phone number of a person with the last name [x2.Person.surname:Fox]?,x2.Person.surname:Fox = Fox,3,267,entity_set,2
1494,Would you list the emails of people with last name Austin?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0","[Person] = Austin
Would you list the emails of people with last name Austin?",Would you list the emails of people with last name [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,198,entity_set,5
1112,Can you provide emails of those who know a Robertson?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Robertson"")
RETURN x0","[Person] = Robertson
Can you provide emails of those who know a Robertson?",Can you provide emails of those who know a [x2.Person.surname:Robertson]?,x2.Person.surname:Robertson = Robertson,3,147,entity_set,18
2982,What most recent crime involved friends of the Robinsons?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Robinson"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Robinson
What most recent crime involved friends of the Robinsons?",What most recent crime involved friends of the [x2.Person.surname:Robinson]?,x2.Person.surname:Robinson = Robinsons,3,432,max,1
2534,How many officers called Hansiain looked into any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Hansiain"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Hansiain
How many officers called Hansiain looked into any crimes?",How many officers called [x0.Officer.name:Hansiain] looked into any crimes?,x0.Officer.name:Hansiain = Hansiain,2,354,count,1
4437,How many people are connected to a crime and know someone with last name Wheeler?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Wheeler"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Wheeler
How many people are connected to a crime and know someone with last name Wheeler?",How many people are connected to a crime and know someone with last name [x2.Person.surname:Wheeler]?,x2.Person.surname:Wheeler = Wheeler,3,25,count,1
777,How many devices placed calls at 8:01?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""08:01"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 08:01
How many devices placed calls at 8:01?",How many devices placed calls at [x1.PhoneCall.call_time:08:01]?,x1.PhoneCall.call_time:08:01 = 8:01,2,102,count,1
1092,How many phones were used for a call of 49 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""49"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 49
How many phones were used for a call of 49 seconds?",How many phones were used for a call of [x1.PhoneCall.call_duration:49] seconds?,x1.PhoneCall.call_duration:49 = 49,2,144,count,1
3612,"Which places in the OL12 region experienced crimes marked as ""Unable to prosecute suspect""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Unable to prosecute suspect"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL12"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Area] = OL12
Which places in the OL12 region experienced crimes marked as ""Unable to prosecute suspect""?","Which places in the [x1.Area.areaCode:OL12] region experienced crimes marked as ""[x2.Crime.last_outcome:Unable to prosecute suspect]""?","x1.Area.areaCode:OL12 = OL12
x2.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",3,144,entity_set,111
2703,What was the first incident involving a person at 183 Oakleigh Avenue?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Oakleigh Avenue"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 183 Oakleigh Avenue
What was the first incident involving a person at 183 Oakleigh Avenue?",What was the first incident involving a person at [x1.Location.address:183 Oakleigh Avenue]?,x1.Location.address:183 Oakleigh Avenue = 183 Oakleigh Avenue,3,391,min,1
4601,What are the phones of Brandon's friends?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brandon"")
RETURN x0","[Person] = Brandon
What are the phones of Brandon's friends?",What are the phones of [x2.Person.name:Brandon]'s friends?,x2.Person.name:Brandon = Brandon,3,71,entity_set,7
214,How many incidents from 6/08/2017 are being probed by any officer?,"MATCH (x0:Crime WHERE x0.date = ""6/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 6/08/2017
How many incidents from 6/08/2017 are being probed by any officer?",How many incidents from [x0.Crime.date:6/08/2017] are being probed by any officer?,x0.Crime.date:6/08/2017 = 6/08/2017,2,25,count,1
2732,Who is the eldest relative of a friend of someone with surname Boyd?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Boyd"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Boyd
Who is the eldest relative of a friend of someone with surname Boyd?",Who is the eldest relative of a friend of someone with surname [x2.Person.surname:Boyd]?,x2.Person.surname:Boyd = Boyd,3,396,max,1
324,What is the number of calls to 4-(962)368-0599 on 26/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""26/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(962)368-0599"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 26/08/2017
[Phone] = 4-(962)368-0599
What is the number of calls to 4-(962)368-0599 on 26/08/2017?",What is the number of calls to [x1.Phone.phoneNo:4-(962)368-0599] on [x0.PhoneCall.call_date:26/08/2017]?,"x0.PhoneCall.call_date:26/08/2017 = 26/08/2017
x1.Phone.phoneNo:4-(962)368-0599 = 4-(962)368-0599",2,40,count,1
2609,How many cases do officers surnamed Gurry investigate?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Gurry"")
RETURN COUNT(DISTINCT x0)","[Officer] = Gurry
How many cases do officers surnamed Gurry investigate?",How many cases do officers surnamed [x1.Officer.surname:Gurry] investigate?,x1.Officer.surname:Gurry = Gurry,2,372,count,1
304,In how many places were crimes marked as Unable to prosecute suspect?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
In how many places were crimes marked as Unable to prosecute suspect?",In how many places were crimes marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,38,count,1
1034,What is the number of residences with the postcode M22 9ND?,"MATCH (x0:Location WHERE x0.postcode = ""M22 9ND"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = M22 9ND
What is the number of residences with the postcode M22 9ND?",What is the number of residences with the postcode [x0.Location.postcode:M22 9ND]?,x0.Location.postcode:M22 9ND = M22 9ND,2,136,count,1
