id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
190,How many calls to any phone lasted exactly 11 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
How many calls to any phone lasted exactly 11 seconds?",How many calls to any phone lasted exactly [x0.PhoneCall.call_duration:11] seconds?,x0.PhoneCall.call_duration:11 = 11,2,23,count,1
910,How many individuals have a Boyd as a friend?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN COUNT(DISTINCT x0)","[Person] = Boyd
How many individuals have a Boyd as a friend?",How many individuals have a [x1.Person.surname:Boyd] as a friend?,x1.Person.surname:Boyd = Boyd,2,119,count,1
2640,What is the count of MINI vehicles tied to a vehicle crime case handled by an officer with last name Rings?,"MATCH (x0:Vehicle WHERE x0.model = ""MINI"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Rings"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = MINI
[Crime] = Vehicle crime
[Officer] = Rings
What is the count of MINI vehicles tied to a vehicle crime case handled by an officer with last name Rings?",What is the count of [x0.Vehicle.model:MINI] vehicles tied to a [x1.Crime.type:Vehicle crime] case handled by an officer with last name [x2.Officer.surname:Rings]?,"x0.Vehicle.model:MINI = MINI
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Rings = Rings",3,380,count,1
227,Which phones called the number 0-(711)302-8090?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""0-(711)302-8090"")
RETURN x0","[Phone] = 0-(711)302-8090
Which phones called the number 0-(711)302-8090?",Which phones called the number [x2.Phone.phoneNo:0-(711)302-8090]?,x2.Phone.phoneNo:0-(711)302-8090 = 0-(711)302-8090,3,28,entity_set,6
1419,How many emails are from those with the name Virginia?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Virginia"")
RETURN COUNT(DISTINCT x0)","[Person] = Virginia
How many emails are from those with the name Virginia?",How many emails are from those with the name [x1.Person.name:Virginia]?,x1.Person.name:Virginia = Virginia,2,187,count,1
1168,Which phones got a call at 21:34?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""21:34"")
RETURN x0","[PhoneCall] = 21:34
Which phones got a call at 21:34?",Which phones got a call at [x1.PhoneCall.call_time:21:34]?,x1.PhoneCall.call_time:21:34 = 21:34,2,154,entity_set,2
2766,Which vehicle-related offenses include Phillip and Edge vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Edge"")
RETURN x0","[Crime] = Vehicle crime
[Person] = Phillip
[Vehicle] = Edge
Which vehicle-related offenses include Phillip and Edge vehicles?",Which [x0.Crime.type:Vehicle crime] include [x2.Person.name:Phillip] and [x1.Vehicle.model:Edge] vehicles?,"x0.Crime.type:Vehicle crime = vehicle-related offenses 
x1.Vehicle.model:Edge = Edge
x2.Person.name:Phillip = Phillip",3,401,entity_set,1
1161,How many people with the name Harry have connections to someone named Irene?,"MATCH (x0:Person WHERE x0.name = ""Harry"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Harry
[Person] = Irene
How many people with the name Harry have connections to someone named Irene?",How many people with the name [x0.Person.name:Harry] have connections to someone named [x1.Person.name:Irene]?,"x0.Person.name:Harry = Harry
x1.Person.name:Irene = Irene",2,153,count,1
2146,How many phones were contacted on 25th August 2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""25/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 25/08/2017
How many phones were contacted on 25th August 2017?",How many phones were contacted on [x1.PhoneCall.call_date:25/08/2017]?,x1.PhoneCall.call_date:25/08/2017 = 25th August 2017,2,289,count,1
484,What vehicles were involved in crimes starting from 26/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0","[Crime] = 26/08/2017
What vehicles were involved in crimes starting from 26/08/2017?",What vehicles were involved in crimes starting from [x1.Crime.date:26/08/2017]?,x1.Crime.date:26/08/2017 = 26/08/2017,2,63,entity_set,36
2456,How many people have their phone numbers known by someone?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)
RETURN COUNT(DISTINCT x0)",How many people have their phone numbers known by someone?,How many people have their phone numbers known by someone?,,2,340,count,1
3292,Which most recent vehicle-related crime happened at M16 7FH?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M16 7FH"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = M16 7FH
Which most recent vehicle-related crime happened at M16 7FH?",Which most recent vehicle-related crime happened at [x1.Location.postcode:M16 7FH]?,x1.Location.postcode:M16 7FH = M16 7FH,3,37,max,1
1077,"On 11/08/2017, how many crimes included Nissan vehicles?","MATCH (x0:Crime WHERE x0.date = ""11/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Nissan"")
RETURN COUNT(DISTINCT x0)","[Crime] = 11/08/2017
[Vehicle] = Nissan
On 11/08/2017, how many crimes included Nissan vehicles?","On [x0.Crime.date:11/08/2017], how many crimes included [x1.Vehicle.make:Nissan] vehicles?","x0.Crime.date:11/08/2017 = 11/08/2017
x1.Vehicle.make:Nissan = Nissan",2,143,count,1
95,What are the ages of individuals residing with someone with surname Brown?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Brown"")
RETURN x0.age","[Person] = Brown
What are the ages of individuals residing with someone with surname Brown?",What are the ages of individuals residing with someone with surname [x1.Person.surname:Brown]?,x1.Person.surname:Brown = Brown,2,11,attribute_set,1
4620,What is the date of the first crime linked to a resident of postcode M3 4NW?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = M3 4NW
What is the date of the first crime linked to a resident of postcode M3 4NW?",What is the date of the first crime linked to a resident of postcode [x2.Location.postcode:M3 4NW]?,x2.Location.postcode:M3 4NW = M3 4NW,3,86,argmin,1
3419,What offenses occurred at Phyllis's home?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Phyllis"")
RETURN x0","[Person] = Phyllis
What offenses occurred at Phyllis's home?",What offenses occurred at [x2.Person.name:Phyllis]'s home?,x2.Person.name:Phyllis = Phyllis,3,63,entity_set,1
1198,What crimes are currently under investigation involving individuals with surname Powell?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN x0","[Crime] = Under investigation
[Person] = Powell
What crimes are currently under investigation involving individuals with surname Powell?",What crimes are currently [x0.Crime.last_outcome:Under investigation] involving individuals with surname [x1.Person.surname:Powell]?,"x0.Crime.last_outcome:Under investigation = under investigation
x1.Person.surname:Powell = Powell",2,161,entity_set,3
2125,How many Sergeants examined crimes occurring on 08/03/2017?,"MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""3/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Crime] = 3/08/2017
How many Sergeants examined crimes occurring on 08/03/2017?",How many [x0.Officer.rank:Sergeant] examined crimes occurring on [x1.Crime.date:3/08/2017]?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.date:3/08/2017 = 08/03/2017",2,286,count,1
1766,What areas are linked to postcode M45 8SG?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""M45 8SG"")
RETURN x0","[PostCode] = M45 8SG
What areas are linked to postcode M45 8SG?",What areas are linked to postcode [x1.PostCode.code:M45 8SG]?,x1.PostCode.code:M45 8SG = M45 8SG,2,234,entity_set,1
2116,Which people have the phone number 2-(029)966-6535?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""2-(029)966-6535"")
RETURN x0","[Phone] = 2-(029)966-6535
Which people have the phone number 2-(029)966-6535?",Which people have the phone number [x1.Phone.phoneNo:2-(029)966-6535]?,x1.Phone.phoneNo:2-(029)966-6535 = 2-(029)966-6535,2,285,entity_set,1
547,How many individuals named Irene reside at 53 Trevor Road?,"MATCH (x0:Person WHERE x0.name = ""Irene"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""53 Trevor Road"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
[Location] = 53 Trevor Road
How many individuals named Irene reside at 53 Trevor Road?",How many individuals named [x0.Person.name:Irene] reside at [x1.Location.address:53 Trevor Road]?,"x0.Person.name:Irene = Irene
x1.Location.address:53 Trevor Road = 53 Trevor Road",2,71,count,1
3277,Can you provide the phone number of someone who is friends with the individual holding NHS number 893-63-6176?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""893-63-6176"")
RETURN x0.phoneNo","[Person] = 893-63-6176
Can you provide the phone number of someone who is friends with the individual holding NHS number 893-63-6176?",Can you provide the phone number of someone who is friends with the individual holding NHS number [x2.Person.nhs_no:893-63-6176]?,x2.Person.nhs_no:893-63-6176 = 893-63-6176,3,35,attribute_set,9
1717,How many individuals named Andrea share a home with someone surnamed Reynolds?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Reynolds"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrea
[Person] = Reynolds
How many individuals named Andrea share a home with someone surnamed Reynolds?",How many individuals named [x0.Person.name:Andrea] share a home with someone surnamed [x1.Person.surname:Reynolds]?,"x0.Person.name:Andrea = Andrea
x1.Person.surname:Reynolds = Reynolds",2,226,count,1
2797,What are the emails of residents at 189 Jopson Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0","[Location] = 189 Jopson Street
What are the emails of residents at 189 Jopson Street?",What are the emails of residents at [x2.Location.address:189 Jopson Street]?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,408,entity_set,2
1728,How many cars were part of crimes on 6/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""6/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 6/08/2017
How many cars were part of crimes on 6/08/2017?",How many cars were part of crimes on [x1.Crime.date:6/08/2017]?,x1.Crime.date:6/08/2017 = 6/08/2017,2,228,count,1
117,Can you name everyone who shares a home with Diana?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Diana"")
RETURN x0","[Person] = Diana
Can you name everyone who shares a home with Diana?",Can you name everyone who shares a home with [x1.Person.name:Diana]?,x1.Person.name:Diana = Diana,2,14,entity_set,3
2222,What are the phone calls received by 0-(070)893-3322 on 12/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""12/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(070)893-3322"")
RETURN x0","[PhoneCall] = 12/08/2017
[Phone] = 0-(070)893-3322
What are the phone calls received by 0-(070)893-3322 on 12/08/2017?",What are the phone calls received by [x1.Phone.phoneNo:0-(070)893-3322] on [x0.PhoneCall.call_date:12/08/2017]?,"x0.PhoneCall.call_date:12/08/2017 = 12/08/2017
x1.Phone.phoneNo:0-(070)893-3322 = 0-(070)893-3322",2,300,entity_set,1
724,"What are the crime locations with the postcode SK6 1HE from August 16, 2017?","MATCH (x0:Location WHERE x0.postcode = ""SK6 1HE"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Location] = SK6 1HE
[Crime] = 16/08/2017
What are the crime locations with the postcode SK6 1HE from August 16, 2017?",What are the crime locations with the postcode [x0.Location.postcode:SK6 1HE] from [x1.Crime.date:16/08/2017]?,"x0.Location.postcode:SK6 1HE = SK6 1HE
x1.Crime.date:16/08/2017 = August 16, 2017",2,96,entity_set,1
642,Who has access to the phone numbers of people with the last name Oliver?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Oliver"")
RETURN x0","[Person] = Oliver
Who has access to the phone numbers of people with the last name Oliver?",Who has access to the phone numbers of people with the last name [x1.Person.surname:Oliver]?,x1.Person.surname:Oliver = Oliver,2,84,entity_set,1
1174,Which thefts from the person are investigated by officers with badge number 70-5119724?,"MATCH (x0:Crime WHERE x0.type = ""Theft from the person"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""70-5119724"")
RETURN x0","[Crime] = Theft from the person
[Officer] = 70-5119724
Which thefts from the person are investigated by officers with badge number 70-5119724?",Which [x0.Crime.type:Theft from the person] are investigated by officers with badge number [x1.Officer.badge_no:70-5119724]?,"x0.Crime.type:Theft from the person = thefts from the person 
x1.Officer.badge_no:70-5119724 = 70-5119724",2,156,entity_set,2
656,Can you tell me the crime count for the locations with the postcode M1 1NN?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M1 1NN"")
RETURN COUNT(DISTINCT x0)","[Location] = M1 1NN
Can you tell me the crime count for the locations with the postcode M1 1NN?",Can you tell me the crime count for the locations with the postcode [x1.Location.postcode:M1 1NN]?,x1.Location.postcode:M1 1NN = M1 1NN,2,87,count,1
2965,Can you provide the emails of those who are family members of the Crawford surname?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Crawford"")
RETURN x0","[Person] = Crawford
Can you provide the emails of those who are family members of the Crawford surname?",Can you provide the emails of those who are family members of the [x2.Person.surname:Crawford] surname?,x2.Person.surname:Crawford = Crawford,3,430,entity_set,2
506,"Which officers handled investigations involving ""Other theft"" offenses?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN x0","[Crime] = Other theft
Which officers handled investigations involving ""Other theft"" offenses?","Which officers handled investigations involving ""[x1.Crime.type:Other theft]"" offenses?",x1.Crime.type:Other theft = Other theft,2,65,entity_set,2140
3660,What are the last names of those who know the phone number of someone sharing a home with Jonathan?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jonathan"")
RETURN x0.surname","[Person] = Jonathan
What are the last names of those who know the phone number of someone sharing a home with Jonathan?",What are the last names of those who know the phone number of someone sharing a home with [x2.Person.name:Jonathan]?,x2.Person.name:Jonathan = Jonathan,3,166,attribute_set,4
85,Which people named Christopher have the email address coliver28@biblegateway.com?,"MATCH (x0:Person WHERE x0.name = ""Christopher"")-[:HAS_EMAIL]-(x1:Email WHERE x1.email_address = ""coliver28@biblegateway.com"")
RETURN x0","[Person] = Christopher
[Email] = coliver28@biblegateway.com
Which people named Christopher have the email address coliver28@biblegateway.com?",Which people named [x0.Person.name:Christopher] have the email address [x1.Email.email_address:coliver28@biblegateway.com]?,"x0.Person.name:Christopher = Christopher
x1.Email.email_address:coliver28@biblegateway.com = coliver28@biblegateway.com",2,10,entity_set,1
1146,What are the Other theft crimes under investigation by officers with last name Almeida?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Almeida"")
RETURN x0","[Crime] = Other theft
[Officer] = Almeida
What are the Other theft crimes under investigation by officers with last name Almeida?",What are the [x0.Crime.type:Other theft] crimes under investigation by officers with last name [x1.Officer.surname:Almeida]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Almeida = Almeida",2,152,entity_set,2
48,How many officers with the name Ashleigh investigated crimes that occured on  31/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Ashleigh"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Ashleigh
[Crime] = 31/08/2017
How many officers with the name Ashleigh investigated crimes that occured on  31/08/2017?",How many officers with the name [x0.Officer.name:Ashleigh] investigated crimes that occured on  [x1.Crime.date:31/08/2017]?,"x0.Officer.name:Ashleigh = Ashleigh
x1.Crime.date:31/08/2017 = 31/08/2017",2,6,count,1
4536,What is the earliest offense connected to a relative of a person named Phillip?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Phillip
What is the earliest offense connected to a relative of a person named Phillip?",What is the earliest offense connected to a relative of a person named [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,51,max,1
2001,Which offenses on 31/08/2017 are under investigation by Police Constables?,"MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 31/08/2017
[Officer] = Police Constable
Which offenses on 31/08/2017 are under investigation by Police Constables?",Which offenses on [x0.Crime.date:31/08/2017] are under investigation by [x1.Officer.rank:Police Constable]?,"x0.Crime.date:31/08/2017 = 31/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,346
1828,Who is the youngest person cohabiting with someone who has the phone number of a Hansen?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Hansen"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Hansen
Who is the youngest person cohabiting with someone who has the phone number of a Hansen?",Who is the youngest person cohabiting with someone who has the phone number of a [x2.Person.surname:Hansen]?,x2.Person.surname:Hansen = Hansen,3,243,min,1
77,How many devices got a call at 7:19 PM?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""19:19"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:19
How many devices got a call at 7:19 PM?",How many devices got a call at [x1.PhoneCall.call_time:19:19]?,x1.PhoneCall.call_time:19:19 = 7:19 PM,2,9,count,1
534,Which phone call to 1-(841)295-6536 had the greatest duration?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(841)295-6536"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 1-(841)295-6536
Which phone call to 1-(841)295-6536 had the greatest duration?",Which phone call to [x1.Phone.phoneNo:1-(841)295-6536] had the greatest duration?,x1.Phone.phoneNo:1-(841)295-6536 = 1-(841)295-6536,2,69,max,1
909,How many people have a person with surname Bradley as a friend?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Bradley"")
RETURN COUNT(DISTINCT x0)","[Person] = Bradley
How many people have a person with surname Bradley as a friend?",How many people have a person with surname [x1.Person.surname:Bradley] as a friend?,x1.Person.surname:Bradley = Bradley,2,119,count,1
2013,"How many crimes, marked as ""Investigation complete; no suspect identified,"" included vehicles of the NSX model?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""NSX"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = NSX
How many crimes, marked as ""Investigation complete; no suspect identified,"" included vehicles of the NSX model?","How many crimes, marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" included vehicles of the [x1.Vehicle.model:NSX] model?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:NSX = NSX",2,270,count,1
4603,Could you list the phones of people who are friends of Brandon?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brandon"")
RETURN x0","[Person] = Brandon
Could you list the phones of people who are friends of Brandon?",Could you list the phones of people who are friends of [x2.Person.name:Brandon]?,x2.Person.name:Brandon = Brandon,3,71,entity_set,7
1597,Which post codes correspond to crime sites on 8/08/2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""8/08/2017"")
RETURN x0","[Crime] = 8/08/2017
Which post codes correspond to crime sites on 8/08/2017?",Which post codes correspond to crime sites on [x2.Crime.date:8/08/2017]?,x2.Crime.date:8/08/2017 = 8/08/2017,3,211,entity_set,886
3391,Can you identify the vehicle brands connected to a crime at the address with postcode BL6 5RW?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL6 5RW"")
RETURN x0.make","[Location] = BL6 5RW
Can you identify the vehicle brands connected to a crime at the address with postcode BL6 5RW?",Can you identify the vehicle brands connected to a crime at the address with postcode [x2.Location.postcode:BL6 5RW]?,x2.Location.postcode:BL6 5RW = BL6 5RW,3,54,attribute_set,4
511,"How many crimes were marked as ""Investigation complete; no suspect identified"" in the location with postcode WA3 3AW?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WA3 3AW"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Location] = WA3 3AW
How many crimes were marked as ""Investigation complete; no suspect identified"" in the location with postcode WA3 3AW?","How many crimes were marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" in the location with postcode [x1.Location.postcode:WA3 3AW]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:WA3 3AW = WA3 3AW",2,67,count,1
2779,What is the most recent offense linked to someone at 161 Sawyer Drive?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""161 Sawyer Drive"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 161 Sawyer Drive
What is the most recent offense linked to someone at 161 Sawyer Drive?",What is the most recent offense linked to someone at [x2.Location.address:161 Sawyer Drive]?,x2.Location.address:161 Sawyer Drive = 161 Sawyer Drive,3,402,max,1
1674,What is the count of 45-second phone calls to 9-(184)752-7135?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""45"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(184)752-7135"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 45
[Phone] = 9-(184)752-7135
What is the count of 45-second phone calls to 9-(184)752-7135?",What is the count of [x0.PhoneCall.call_duration:45]-second phone calls to [x1.Phone.phoneNo:9-(184)752-7135]?,"x0.PhoneCall.call_duration:45 = 45
x1.Phone.phoneNo:9-(184)752-7135 = 9-(184)752-7135",2,220,count,1
278,What is the number of shoplifting investigations conducted by Police Constables?,"MATCH (x0:Crime WHERE x0.type = ""Shoplifting"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Shoplifting
[Officer] = Police Constable
What is the number of shoplifting investigations conducted by Police Constables?",What is the number of [x0.Crime.type:Shoplifting] investigations conducted by [x1.Officer.rank:Police Constable]?,"x0.Crime.type:Shoplifting = shoplifting
x1.Officer.rank:Police Constable = Police Constables",2,34,count,1
2512,How many Police Constables conducted crime investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
How many Police Constables conducted crime investigations?",How many [x0.Officer.rank:Police Constable] conducted crime investigations?,x0.Officer.rank:Police Constable = Police Constables,2,350,count,1
4563,What is the count of public order crimes linked to the individual with phone number 9-(494)467-2643?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(494)467-2643"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Phone] = 9-(494)467-2643
What is the count of public order crimes linked to the individual with phone number 9-(494)467-2643?",What is the count of [x0.Crime.type:Public order] crimes linked to the individual with phone number [x2.Phone.phoneNo:9-(494)467-2643]?,"x0.Crime.type:Public order = public order
x2.Phone.phoneNo:9-(494)467-2643 = 9-(494)467-2643",3,66,count,1
1012,Which Police Constables have investigated vehicle crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Police Constable
[Crime] = Vehicle crime
Which Police Constables have investigated vehicle crimes?",Which [x0.Officer.rank:Police Constable] have investigated [x1.Crime.type:Vehicle crime]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.type:Vehicle crime = vehicle crimes",2,133,entity_set,996
27,How many cases of criminal damage and arson do officers named Allianora investigate?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Allianora"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Officer] = Allianora
How many cases of criminal damage and arson do officers named Allianora investigate?",How many cases of [x0.Crime.type:Criminal damage and arson] do officers named [x1.Officer.name:Allianora] investigate?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.name:Allianora = Allianora",2,4,count,1
1455,How many people are related to the person holding NHS number 358-19-2542?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""358-19-2542"")
RETURN COUNT(DISTINCT x0)","[Person] = 358-19-2542
How many people are related to the person holding NHS number 358-19-2542?",How many people are related to the person holding NHS number [x1.Person.nhs_no:358-19-2542]?,x1.Person.nhs_no:358-19-2542 = 358-19-2542,2,191,count,1
437,What is the email count for individuals with the surname Spencer?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Spencer"")
RETURN COUNT(DISTINCT x0)","[Person] = Spencer
What is the email count for individuals with the surname Spencer?",What is the email count for individuals with the surname [x1.Person.surname:Spencer]?,x1.Person.surname:Spencer = Spencer,2,58,count,1
942,How many offenses at 167 Barton Road couldn't proceed due to Unable to prosecute suspect status?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""167 Barton Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = 167 Barton Road
How many offenses at 167 Barton Road couldn't proceed due to Unable to prosecute suspect status?",How many offenses at [x1.Location.address:167 Barton Road] couldn't proceed due to [x0.Crime.last_outcome:Unable to prosecute suspect] status?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.address:167 Barton Road = 167 Barton Road",2,122,count,1
954,Can you name the officers who probed crimes on 24/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN x0","[Crime] = 24/08/2017
Can you name the officers who probed crimes on 24/08/2017?",Can you name the officers who probed crimes on [x1.Crime.date:24/08/2017]?,x1.Crime.date:24/08/2017 = 24/08/2017,2,125,entity_set,957
1650,Can you show the calls lasting 56 seconds to 5-(606)104-0382?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""56"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(606)104-0382"")
RETURN x0","[PhoneCall] = 56
[Phone] = 5-(606)104-0382
Can you show the calls lasting 56 seconds to 5-(606)104-0382?",Can you show the calls lasting [x0.PhoneCall.call_duration:56] seconds to [x1.Phone.phoneNo:5-(606)104-0382]?,"x0.PhoneCall.call_duration:56 = 56
x1.Phone.phoneNo:5-(606)104-0382 = 5-(606)104-0382",2,217,entity_set,2
2214,Can you identify all Sable cars connected to offenses on 4/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""Sable"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Vehicle] = Sable
[Crime] = 4/08/2017
Can you identify all Sable cars connected to offenses on 4/08/2017?",Can you identify all [x0.Vehicle.model:Sable] cars connected to offenses on [x1.Crime.date:4/08/2017]?,"x0.Vehicle.model:Sable = Sable
x1.Crime.date:4/08/2017 = 4/08/2017",2,299,entity_set,1
1247,What is the number of crimes from 31/08/2017 that officers with the surname Taks investigated?,"MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Taks"")
RETURN COUNT(DISTINCT x0)","[Crime] = 31/08/2017
[Officer] = Taks
What is the number of crimes from 31/08/2017 that officers with the surname Taks investigated?",What is the number of crimes from [x0.Crime.date:31/08/2017] that officers with the surname [x1.Officer.surname:Taks] investigated?,"x0.Crime.date:31/08/2017 = 31/08/2017
x1.Officer.surname:Taks = Taks",2,166,count,1
84,Can you identify all individuals named Christopher with the email coliver28@biblegateway.com?,"MATCH (x0:Person WHERE x0.name = ""Christopher"")-[:HAS_EMAIL]-(x1:Email WHERE x1.email_address = ""coliver28@biblegateway.com"")
RETURN x0","[Person] = Christopher
[Email] = coliver28@biblegateway.com
Can you identify all individuals named Christopher with the email coliver28@biblegateway.com?",Can you identify all individuals named [x0.Person.name:Christopher] with the email [x1.Email.email_address:coliver28@biblegateway.com]?,"x0.Person.name:Christopher = Christopher
x1.Email.email_address:coliver28@biblegateway.com = coliver28@biblegateway.com",2,10,entity_set,1
3637,Which individuals share a home with someone familiar with a person with last name Hamilton?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Hamilton"")
RETURN x0","[Person] = Hamilton
Which individuals share a home with someone familiar with a person with last name Hamilton?",Which individuals share a home with someone familiar with a person with last name [x2.Person.surname:Hamilton]?,x2.Person.surname:Hamilton = Hamilton,3,151,entity_set,6
3098,How many criminal acts involve a person with last name Hughes who is friend with Bonnie?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Bonnie"")
RETURN COUNT(DISTINCT x0)","[Person] = Hughes
[Person] = Bonnie
How many criminal acts involve a person with last name Hughes who is friend with Bonnie?",How many criminal acts involve a person with last name [x1.Person.surname:Hughes] who is friend with [x2.Person.name:Bonnie]?,"x1.Person.surname:Hughes = Hughes
x2.Person.name:Bonnie = Bonnie",3,7,count,1
