id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
882,Which emails correspond to the NHS number 680-93-7668?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""680-93-7668"")
RETURN x0","[Person] = 680-93-7668
Which emails correspond to the NHS number 680-93-7668?",Which emails correspond to the NHS number [x1.Person.nhs_no:680-93-7668]?,x1.Person.nhs_no:680-93-7668 = 680-93-7668,2,116,entity_set,1
2917,What was the earliest incident at 103 Bollin Walk with a Mustang car?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""103 Bollin Walk"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Mustang"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 103 Bollin Walk
[Vehicle] = Mustang
What was the earliest incident at 103 Bollin Walk with a Mustang car?",What was the earliest incident at [x2.Location.address:103 Bollin Walk] with a [x1.Vehicle.model:Mustang] car?,"x1.Vehicle.model:Mustang = Mustang
x2.Location.address:103 Bollin Walk = 103 Bollin Walk",3,422,min,1
3408,Which NHS numbers belong to individuals related to a person with the email cknight2k@jiathis.com?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""cknight2k@jiathis.com"")
RETURN x0.nhs_no","[Email] = cknight2k@jiathis.com
Which NHS numbers belong to individuals related to a person with the email cknight2k@jiathis.com?",Which NHS numbers belong to individuals related to a person with the email [x2.Email.email_address:cknight2k@jiathis.com]?,x2.Email.email_address:cknight2k@jiathis.com = cknight2k@jiathis.com,3,59,attribute_set,2
2284,How many cases is officer 31-2542986 currently investigating?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""31-2542986"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = 31-2542986
How many cases is officer 31-2542986 currently investigating?",How many cases is officer [x1.Officer.badge_no:31-2542986] [x0.Crime.last_outcome:Under investigation]?,"x0.Crime.last_outcome:Under investigation = currently investigating 
x1.Officer.badge_no:31-2542986 = 31-2542986",2,307,count,1
2750,Who has the emails of those acquainted with someone having NHS number 247-72-6304?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
Who has the emails of those acquainted with someone having NHS number 247-72-6304?",Who has the emails of those acquainted with someone having NHS number [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,398,entity_set,4
1742,In how many places do people surnamed Black live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Black"")
RETURN COUNT(DISTINCT x0)","[Person] = Black
In how many places do people surnamed Black live?",In how many places do people surnamed [x1.Person.surname:Black] live?,x1.Person.surname:Black = Black,2,232,count,1
785,What's the oldest car tied to an ongoing investigation with a suspect wuth last name Moore?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Moore"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Under investigation
[Person] = Moore
What's the oldest car tied to an ongoing investigation with a suspect wuth last name Moore?",What's the oldest car tied to an [x1.Crime.last_outcome:Under investigation] with a suspect wuth last name [x2.Person.surname:Moore]?,"x1.Crime.last_outcome:Under investigation = ongoing investigation 
x2.Person.surname:Moore = Moore",3,103,max,1
3225,What are the NHS numbers of individuals who got a call at 14:11?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""14:11"")
RETURN x0.nhs_no","[PhoneCall] = 14:11
What are the NHS numbers of individuals who got a call at 14:11?",What are the NHS numbers of individuals who got a call at [x2.PhoneCall.call_time:14:11]?,x2.PhoneCall.call_time:14:11 = 14:11,3,26,attribute_set,2
1825,Who is the youngest resident with a housemate who knows a Garza's phone number?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Garza"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Garza
Who is the youngest resident with a housemate who knows a Garza's phone number?",Who is the youngest resident with a housemate who knows a [x2.Person.surname:Garza]'s phone number?,x2.Person.surname:Garza = Garza,3,243,min,1
841,How old is the youngest person living with a Baker?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Baker"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Baker
How old is the youngest person living with a Baker?",How old is the youngest person living with a [x1.Person.surname:Baker]?,x1.Person.surname:Baker = Baker,2,111,argmin,1
641,Can you identify everyone who has the phone number of a person with surname Oliver?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Oliver"")
RETURN x0","[Person] = Oliver
Can you identify everyone who has the phone number of a person with surname Oliver?",Can you identify everyone who has the phone number of a person with surname [x1.Person.surname:Oliver]?,x1.Person.surname:Oliver = Oliver,2,84,entity_set,1
727,"How many crimes on August 20, 2017, involve someone named Stephanie?","MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Stephanie"")
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
[Person] = Stephanie
How many crimes on August 20, 2017, involve someone named Stephanie?","How many crimes on [x0.Crime.date:20/08/2017], involve someone named [x1.Person.name:Stephanie]?","x0.Crime.date:20/08/2017 = August 20, 2017 
x1.Person.name:Stephanie = Stephanie",2,97,count,1
3214,How many people have friends with the surname Fields whi are also connected to someone with the surname Austin?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Fields"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Austin"")
RETURN COUNT(DISTINCT x0)","[Person] = Fields
[Person] = Austin
How many people have friends with the surname Fields whi are also connected to someone with the surname Austin?",How many people have friends with the surname [x1.Person.surname:Fields] whi are also connected to someone with the surname [x2.Person.surname:Austin]?,"x1.Person.surname:Fields = Fields
x2.Person.surname:Austin = Austin",3,24,count,1
463,What crimes involve individuals with surname Peters?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN x0","[Person] = Peters
What crimes involve individuals with surname Peters?",What crimes involve individuals with surname [x1.Person.surname:Peters]?,x1.Person.surname:Peters = Peters,2,61,entity_set,3
2113,Which people are associated with the phone number 3-(596)340-0868?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""3-(596)340-0868"")
RETURN x0","[Phone] = 3-(596)340-0868
Which people are associated with the phone number 3-(596)340-0868?",Which people are associated with the phone number [x1.Phone.phoneNo:3-(596)340-0868]?,x1.Phone.phoneNo:3-(596)340-0868 = 3-(596)340-0868,2,285,entity_set,1
2466,What is the first crime involving an Tribeca vehicle that an officer with last name Younglove investigated?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Younglove"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Tribeca"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Younglove
[Vehicle] = Tribeca
What is the first crime involving an Tribeca vehicle that an officer with last name Younglove investigated?",What is the first crime involving an [x1.Vehicle.model:Tribeca] vehicle that an officer with last name [x2.Officer.surname:Younglove] investigated?,"x1.Vehicle.model:Tribeca = Tribeca
x2.Officer.surname:Younglove = Younglove",3,341,min,1
4616,What's the briefest call received on the phone that got a call on 18/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 18/08/2017
What's the briefest call received on the phone that got a call on 18/08/2017?",What's the briefest call received on the phone that got a call on [x2.PhoneCall.call_date:18/08/2017]?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,76,min,1
2636,How many Probe cars are linked to a vehicle crime investigated by Officer with last name Cosslett?,"MATCH (x0:Vehicle WHERE x0.model = ""Probe"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cosslett"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Probe
[Crime] = Vehicle crime
[Officer] = Cosslett
How many Probe cars are linked to a vehicle crime investigated by Officer with last name Cosslett?",How many [x0.Vehicle.model:Probe] cars are linked to a [x1.Crime.type:Vehicle crime] investigated by Officer with last name [x2.Officer.surname:Cosslett]?,"x0.Vehicle.model:Probe = Probe
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Cosslett = Cosslett",3,380,count,1
1781,"What crimes with the status ""Investigation complete; no suspect identified"" happened in locations with postcode OL4 5AW?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL4 5AW"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = OL4 5AW
What crimes with the status ""Investigation complete; no suspect identified"" happened in locations with postcode OL4 5AW?","What crimes with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" happened in locations with postcode [x1.Location.postcode:OL4 5AW]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:OL4 5AW = OL4 5AW",2,236,entity_set,1
2274,What's the number of people sharing a home with a person named Phillip?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Phillip"")
RETURN COUNT(DISTINCT x0)","[Person] = Phillip
What's the number of people sharing a home with a person named Phillip?",What's the number of people sharing a home with a person named [x1.Person.name:Phillip]?,x1.Person.name:Phillip = Phillip,2,306,count,1
1658,How many individuals are related to someone with surname Fernandez?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN COUNT(DISTINCT x0)","[Person] = Fernandez
How many individuals are related to someone with surname Fernandez?",How many individuals are related to someone with surname [x1.Person.surname:Fernandez]?,x1.Person.surname:Fernandez = Fernandez,2,218,count,1
1299,How many calls of 37 seconds were received by any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""37"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 37
How many calls of 37 seconds were received by any phone?",How many calls of [x0.PhoneCall.call_duration:37] seconds were received by any phone?,x0.PhoneCall.call_duration:37 = 37,2,172,count,1
1983,Which officers named Manuel are handling crimes currently being investigated?,"MATCH (x0:Officer WHERE x0.name = ""Manuel"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Manuel
[Crime] = Under investigation
Which officers named Manuel are handling crimes currently being investigated?",Which officers named [x0.Officer.name:Manuel] are handling crimes [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.name:Manuel = Manuel
x1.Crime.last_outcome:Under investigation = currently being investigated",2,266,entity_set,5
2236,How many incidents on 24/08/2017 involve a person with the NHS ID 335-71-7747?,"MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""335-71-7747"")
RETURN COUNT(DISTINCT x0)","[Crime] = 24/08/2017
[Person] = 335-71-7747
How many incidents on 24/08/2017 involve a person with the NHS ID 335-71-7747?",How many incidents on [x0.Crime.date:24/08/2017] involve a person with the NHS ID [x1.Person.nhs_no:335-71-7747]?,"x0.Crime.date:24/08/2017 = 24/08/2017
x1.Person.nhs_no:335-71-7747 = 335-71-7747",2,301,count,1
2308,Could you list the emails of those with the name James?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""James"")
RETURN x0","[Person] = James
Could you list the emails of those with the name James?",Could you list the emails of those with the name [x1.Person.name:James]?,x1.Person.name:James = James,2,311,entity_set,1
3711,What is the first recorded crime involving a cohabitant of a Cunningham?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Cunningham"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Cunningham
What is the first recorded crime involving a cohabitant of a Cunningham?",What is the first recorded crime involving a cohabitant of a [x2.Person.surname:Cunningham]?,x2.Person.surname:Cunningham = Cunningham,3,188,min,1
1148,Which crimes involving violence and sexual offences are handled by officers with the surname Braizier?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Braizier"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Braizier
Which crimes involving violence and sexual offences are handled by officers with the surname Braizier?",Which crimes involving [x0.Crime.type:Violence and sexual offences] are handled by officers with the surname [x1.Officer.surname:Braizier]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Officer.surname:Braizier = Braizier",2,152,entity_set,7
2154,What is the number of officers who probed robbery offenses?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Robbery"")
RETURN COUNT(DISTINCT x0)","[Crime] = Robbery
What is the number of officers who probed robbery offenses?",What is the number of officers who probed [x1.Crime.type:Robbery] offenses?,x1.Crime.type:Robbery = robbery,2,291,count,1
1171,Which criminal damage and arson cases are handled by officers with badge number 87-5149886?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""87-5149886"")
RETURN x0","[Crime] = Criminal damage and arson
[Officer] = 87-5149886
Which criminal damage and arson cases are handled by officers with badge number 87-5149886?",Which [x0.Crime.type:Criminal damage and arson] cases are handled by officers with badge number [x1.Officer.badge_no:87-5149886]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.badge_no:87-5149886 = 87-5149886",2,156,entity_set,4
3639,Can you identify those living with someone who knows a Barnes?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Barnes"")
RETURN x0","[Person] = Barnes
Can you identify those living with someone who knows a Barnes?",Can you identify those living with someone who knows a [x2.Person.surname:Barnes]?,x2.Person.surname:Barnes = Barnes,3,151,entity_set,3
951,How many calls did any phone get on 29/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 29/08/2017
How many calls did any phone get on 29/08/2017?",How many calls did any phone get on [x0.PhoneCall.call_date:29/08/2017]?,x0.PhoneCall.call_date:29/08/2017 = 29/08/2017,2,124,count,1
3085,Which vehicles are associated with offenses connected to people holding NHS number 879-22-8665?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""879-22-8665"")
RETURN x0","[Person] = 879-22-8665
Which vehicles are associated with offenses connected to people holding NHS number 879-22-8665?",Which vehicles are associated with offenses connected to people holding NHS number [x2.Person.nhs_no:879-22-8665]?,x2.Person.nhs_no:879-22-8665 = 879-22-8665,3,6,entity_set,1
1931,What are the crime dates involving individuals whose phone numbers are known by people with last name Fox?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Fox"")
RETURN x0.date","[Person] = Fox
What are the crime dates involving individuals whose phone numbers are known by people with last name Fox?",What are the crime dates involving individuals whose phone numbers are known by people with last name [x2.Person.surname:Fox]?,x2.Person.surname:Fox = Fox,3,258,attribute_set,5
198,Can you identify everyone related to someone named Jennifer?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Jennifer"")
RETURN x0","[Person] = Jennifer
Can you identify everyone related to someone named Jennifer?",Can you identify everyone related to someone named [x1.Person.name:Jennifer]?,x1.Person.name:Jennifer = Jennifer,2,24,entity_set,2
365,Can you name the spots at 152 Chestnut Avenue that share the postcode M43 7SA?,"MATCH (x0:Location WHERE x0.address = ""152 Chestnut Avenue"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M43 7SA"")
RETURN x0","[Location] = 152 Chestnut Avenue
[PostCode] = M43 7SA
Can you name the spots at 152 Chestnut Avenue that share the postcode M43 7SA?",Can you name the spots at [x0.Location.address:152 Chestnut Avenue] that share the postcode [x1.PostCode.code:M43 7SA]?,"x0.Location.address:152 Chestnut Avenue = 152 Chestnut Avenue
x1.PostCode.code:M43 7SA = M43 7SA",2,47,entity_set,1
1664,Which are the names of relatives of people with the last name Marshall?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Marshall"")
RETURN x0.name","[Person] = Marshall
Which are the names of relatives of people with the last name Marshall?",Which are the names of relatives of people with the last name [x1.Person.surname:Marshall]?,x1.Person.surname:Marshall = Marshall,2,219,attribute_set,2
4641,Where are the crime scenes that Officer Roglieri investigated?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Roglieri"")
RETURN x0.address","[Officer] = Roglieri
Where are the crime scenes that Officer Roglieri investigated?",Where are the crime scenes that Officer [x2.Officer.surname:Roglieri] investigated?,x2.Officer.surname:Roglieri = Roglieri,3,93,attribute_set,33
596,What is the age of the oldest individual familiar with someone with surname Brooks?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Brooks"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Brooks
What is the age of the oldest individual familiar with someone with surname Brooks?",What is the age of the oldest individual familiar with someone with surname [x1.Person.surname:Brooks]?,x1.Person.surname:Brooks = Brooks,2,78,argmin,1
3,"What crimes occurred on August 20, 2017, involving individuals with surname Murray?","MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN x0","[Crime] = 20/08/2017
[Person] = Murray
What crimes occurred on August 20, 2017, involving individuals with surname Murray?","What crimes occurred on [x0.Crime.date:20/08/2017], involving individuals with surname [x1.Person.surname:Murray]?","x0.Crime.date:20/08/2017 = August 20, 2017 
x1.Person.surname:Murray = Murray",2,1,entity_set,1
1329,How many districts have sites with the postcode M16 9PW?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M16 9PW"")
RETURN COUNT(DISTINCT x0)","[Location] = M16 9PW
How many districts have sites with the postcode M16 9PW?",How many districts have sites with the postcode [x1.Location.postcode:M16 9PW]?,x1.Location.postcode:M16 9PW = M16 9PW,2,175,count,1
4570,How often is the person with phone number 1-(179)787-6778 involved in drug crimes?,"MATCH (x0:Crime WHERE x0.type = ""Drugs"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(179)787-6778"")
RETURN COUNT(DISTINCT x0)","[Crime] = Drugs
[Phone] = 1-(179)787-6778
How often is the person with phone number 1-(179)787-6778 involved in drug crimes?",How often is the person with phone number [x2.Phone.phoneNo:1-(179)787-6778] involved in [x0.Crime.type:Drugs]?,"x0.Crime.type:Drugs = drug crimes 
x2.Phone.phoneNo:1-(179)787-6778 = 1-(179)787-6778",3,66,count,1
4545,Can you identify everyone who knows a friend of the individual with NHS number 563-60-8705?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""563-60-8705"")
RETURN x0","[Person] = 563-60-8705
Can you identify everyone who knows a friend of the individual with NHS number 563-60-8705?",Can you identify everyone who knows a friend of the individual with NHS number [x2.Person.nhs_no:563-60-8705]?,x2.Person.nhs_no:563-60-8705 = 563-60-8705,3,54,entity_set,8
4481,What is the NHS number of Steven who is family related to someone with NHS number 641-55-5639?,"MATCH (x0:Person WHERE x0.name = ""Steven"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""641-55-5639"")
RETURN x0.nhs_no","[Person] = Steven
[Person] = 641-55-5639
What is the NHS number of Steven who is family related to someone with NHS number 641-55-5639?",What is the NHS number of [x0.Person.name:Steven] who is family related to someone with NHS number [x2.Person.nhs_no:641-55-5639]?,"x0.Person.name:Steven = Steven
x2.Person.nhs_no:641-55-5639 = 641-55-5639",3,36,attribute_set,1
3677,Which Mercedes-Benz models are linked to crimes investigated by officer badge 44-0158566?,"MATCH (x0:Vehicle WHERE x0.make = ""Mercedes-Benz"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""44-0158566"")
RETURN x0.model","[Vehicle] = Mercedes-Benz
[Officer] = 44-0158566
Which Mercedes-Benz models are linked to crimes investigated by officer badge 44-0158566?",Which [x0.Vehicle.make:Mercedes-Benz] models are linked to crimes investigated by officer badge [x2.Officer.badge_no:44-0158566]?,"x0.Vehicle.make:Mercedes-Benz = Mercedes-Benz
x2.Officer.badge_no:44-0158566 = 44-0158566",3,176,attribute_set,1
1138,Which phones made calls at 00:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""00:26"")
RETURN x0","[PhoneCall] = 00:26
Which phones made calls at 00:26?",Which phones made calls at [x1.PhoneCall.call_time:00:26]?,x1.PhoneCall.call_time:00:26 = 00:26,2,151,entity_set,1
28,How many investigations into criminal damage and arson are conducted by officers named Allianora?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Allianora"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Officer] = Allianora
How many investigations into criminal damage and arson are conducted by officers named Allianora?",How many investigations into [x0.Crime.type:Criminal damage and arson] are conducted by officers named [x1.Officer.name:Allianora]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.name:Allianora = Allianora",2,4,count,1
3336,Can you identify everyone living in the M14 zone?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M14"")
RETURN x0","[Area] = M14
Can you identify everyone living in the M14 zone?",Can you identify everyone living in the [x2.Area.areaCode:M14] zone?,x2.Area.areaCode:M14 = M14,3,43,entity_set,9
3405,Can you provide the NHS numbers of individuals related to someone with the email wsmith9c@nhs.uk?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""wsmith9c@nhs.uk"")
RETURN x0.nhs_no","[Email] = wsmith9c@nhs.uk
Can you provide the NHS numbers of individuals related to someone with the email wsmith9c@nhs.uk?",Can you provide the NHS numbers of individuals related to someone with the email [x2.Email.email_address:wsmith9c@nhs.uk]?,x2.Email.email_address:wsmith9c@nhs.uk = wsmith9c@nhs.uk,3,59,attribute_set,2
2807,How many emails exist from individuals named Craig who were connected to a crime on 31/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Craig"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Craig
[Crime] = 31/08/2017
How many emails exist from individuals named Craig who were connected to a crime on 31/08/2017?",How many emails exist from individuals named [x1.Person.name:Craig] who were connected to a crime on [x2.Crime.date:31/08/2017]?,"x1.Person.name:Craig = Craig
x2.Crime.date:31/08/2017 = 31/08/2017",3,409,count,1
4496,How many 73-second calls did a phone receive after making a call at 21:35?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""73"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""21:35"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 73
[PhoneCall] = 21:35
How many 73-second calls did a phone receive after making a call at 21:35?",How many [x0.PhoneCall.call_duration:73]-second calls did a phone receive after making a call at [x2.PhoneCall.call_time:21:35]?,"x0.PhoneCall.call_duration:73 = 73
x2.PhoneCall.call_time:21:35 = 21:35",3,41,count,1
373,Who are the officers named Melodie who investigated crimes on 27/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Melodie"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""27/08/2017"")
RETURN x0","[Officer] = Melodie
[Crime] = 27/08/2017
Who are the officers named Melodie who investigated crimes on 27/08/2017?",Who are the officers named [x0.Officer.name:Melodie] who investigated crimes on [x1.Crime.date:27/08/2017]?,"x0.Officer.name:Melodie = Melodie
x1.Crime.date:27/08/2017 = 27/08/2017",2,49,entity_set,2
2438,How many places are in the area with code BL3?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""BL3"")
RETURN COUNT(DISTINCT x0)","[Area] = BL3
How many places are in the area with code BL3?",How many places are in the area with code [x1.Area.areaCode:BL3]?,x1.Area.areaCode:BL3 = BL3,2,337,count,1
3470,What are the surname of people whose phone numbers is known to those knowing someone with NHS number 773-64-9939?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""773-64-9939"")
RETURN x0.surname","[Person] = 773-64-9939
What are the surname of people whose phone numbers is known to those knowing someone with NHS number 773-64-9939?",What are the surname of people whose phone numbers is known to those knowing someone with NHS number [x2.Person.nhs_no:773-64-9939]?,x2.Person.nhs_no:773-64-9939 = 773-64-9939,3,83,attribute_set,4
3575,What are the surnames of the friends of Annie who is involved in a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Annie"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Annie
What are the surnames of the friends of Annie who is involved in a crime?",What are the surnames of the friends of [x1.Person.name:Annie] who is involved in a crime?,x1.Person.name:Annie = Annie,3,119,attribute_set,7
813,What was the count of people involved in crimes on 7/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 7/08/2017
What was the count of people involved in crimes on 7/08/2017?",What was the count of people involved in crimes on [x1.Crime.date:7/08/2017]?,x1.Crime.date:7/08/2017 = 7/08/2017,2,108,count,1
3295,Which vehicle crime happened most recently at BL8 2DA?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""BL8 2DA"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = BL8 2DA
Which vehicle crime happened most recently at BL8 2DA?",Which vehicle crime happened most recently at [x1.Location.postcode:BL8 2DA]?,x1.Location.postcode:BL8 2DA = BL8 2DA,3,37,max,1
4419,Can you provide the address for the individual with the phone number 9-(726)948-9585?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(726)948-9585"")
RETURN x0.address","[Phone] = 9-(726)948-9585
Can you provide the address for the individual with the phone number 9-(726)948-9585?",Can you provide the address for the individual with the phone number [x2.Phone.phoneNo:9-(726)948-9585]?,x2.Phone.phoneNo:9-(726)948-9585 = 9-(726)948-9585,3,16,attribute_set,1
3201,How many emails are linked to individuals involved in crimes?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",How many emails are linked to individuals involved in crimes?,How many emails are linked to individuals involved in crimes?,,3,22,count,1
3209,How many people have friends with the surname Taylor who are also connected to someone with the surname Fisher?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Taylor"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Fisher"")
RETURN COUNT(DISTINCT x0)","[Person] = Taylor
[Person] = Fisher
How many people have friends with the surname Taylor who are also connected to someone with the surname Fisher?",How many people have friends with the surname [x1.Person.surname:Taylor] who are also connected to someone with the surname [x2.Person.surname:Fisher]?,"x1.Person.surname:Taylor = Taylor
x2.Person.surname:Fisher = Fisher",3,24,count,1
2269,How many folks share a home with anyone named Anne?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Anne"")
RETURN COUNT(DISTINCT x0)","[Person] = Anne
How many folks share a home with anyone named Anne?",How many folks share a home with anyone named [x1.Person.name:Anne]?,x1.Person.name:Anne = Anne,2,306,count,1
2981,What is the latest offense connected to friends of people surnamed Weaver?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Weaver"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Weaver
What is the latest offense connected to friends of people surnamed Weaver?",What is the latest offense connected to friends of people surnamed [x2.Person.surname:Weaver]?,x2.Person.surname:Weaver = Weaver,3,432,max,1
2615,How many crimes does an officer investigate?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)",How many crimes does an officer investigate?,How many crimes does an officer investigate?,,2,375,count,1
3370,Can you provide the oldest crime date that Officer Hynam looked into at 73 Gilmerton Drive?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Hynam"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""73 Gilmerton Drive"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Hynam
[Location] = 73 Gilmerton Drive
Can you provide the oldest crime date that Officer Hynam looked into at 73 Gilmerton Drive?",Can you provide the oldest crime date that Officer [x1.Officer.surname:Hynam] looked into at [x2.Location.address:73 Gilmerton Drive]?,"x1.Officer.surname:Hynam = Hynam
x2.Location.address:73 Gilmerton Drive = 73 Gilmerton Drive",3,48,argmin,1
3131,How many can provide the phone number of a Sullivan with the email address fsullivandl@eepurl.com?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Sullivan"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""fsullivandl@eepurl.com"")
RETURN COUNT(DISTINCT x0)","[Person] = Sullivan
[Email] = fsullivandl@eepurl.com
How many can provide the phone number of a Sullivan with the email address fsullivandl@eepurl.com?",How many can provide the phone number of a [x1.Person.surname:Sullivan] with the email address [x2.Email.email_address:fsullivandl@eepurl.com]?,"x1.Person.surname:Sullivan = Sullivan
x2.Email.email_address:fsullivandl@eepurl.com = fsullivandl@eepurl.com",3,12,count,1
