id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
930,How many incidents on 23/08/2017 had a vehicle involved?,"MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
How many incidents on 23/08/2017 had a vehicle involved?",How many incidents on [x0.Crime.date:23/08/2017] had a vehicle involved?,x0.Crime.date:23/08/2017 = 23/08/2017,2,121,count,1
1308,When did officers with the surname Grigoriev last investigate a case featuring Verona vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Verona"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Grigoriev"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Verona
[Officer] = Grigoriev
When did officers with the surname Grigoriev last investigate a case featuring Verona vehicles?",When did officers with the surname [x1.Officer.surname:Grigoriev] last investigate a case featuring [x2.Vehicle.model:Verona] vehicles?,"x1.Officer.surname:Grigoriev = Grigoriev
x2.Vehicle.model:Verona = Verona",3,173,argmax,1
4386,Can you provide the types of crimes from 19/08/2017 that involved a friend of the individual with NHS number 806-49-7942?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""806-49-7942"")
RETURN x0.type","[Crime] = 19/08/2017
[Person] = 806-49-7942
Can you provide the types of crimes from 19/08/2017 that involved a friend of the individual with NHS number 806-49-7942?",Can you provide the types of crimes from [x0.Crime.date:19/08/2017] that involved a friend of the individual with NHS number [x2.Person.nhs_no:806-49-7942]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x2.Person.nhs_no:806-49-7942 = 806-49-7942",3,1,attribute_set,1
2156,How many public order crimes are investigated by officers with badge number 05-3036001?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""05-3036001"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = 05-3036001
How many public order crimes are investigated by officers with badge number 05-3036001?",How many [x0.Crime.type:Public order] crimes are investigated by officers with badge number [x1.Officer.badge_no:05-3036001]?,"x0.Crime.type:Public order = public order
x1.Officer.badge_no:05-3036001 = 05-3036001",2,292,count,1
1019,What number of phones initiated a call on 03/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""03/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 03/08/2017
What number of phones initiated a call on 03/08/2017?",What number of phones initiated a call on [x1.PhoneCall.call_date:03/08/2017]?,x1.PhoneCall.call_date:03/08/2017 = 03/08/2017,2,134,count,1
344,What crimes happened last at 94 Ashworth Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""94 Ashworth Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 94 Ashworth Street
What crimes happened last at 94 Ashworth Street?",What crimes happened last at [x1.Location.address:94 Ashworth Street]?,x1.Location.address:94 Ashworth Street = 94 Ashworth Street,2,43,max,1
1307,What is the most recent date officers with surname Grigoriev probed a crime with Verona model cars involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Verona"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Grigoriev"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Verona
[Officer] = Grigoriev
What is the most recent date officers with surname Grigoriev probed a crime with Verona model cars involved?",What is the most recent date officers with surname [x1.Officer.surname:Grigoriev] probed a crime with [x2.Vehicle.model:Verona] model cars involved?,"x1.Officer.surname:Grigoriev = Grigoriev
x2.Vehicle.model:Verona = Verona",3,173,argmax,1
2316,Can you identify all individuals named Rebecca connected to offenses on 31st August 2017?,"MATCH (x0:Person WHERE x0.name = ""Rebecca"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN x0","[Person] = Rebecca
[Crime] = 31/08/2017
Can you identify all individuals named Rebecca connected to offenses on 31st August 2017?",Can you identify all individuals named [x0.Person.name:Rebecca] connected to offenses on [x1.Crime.date:31/08/2017]?,"x0.Person.name:Rebecca = Rebecca
x1.Crime.date:31/08/2017 = 31st August 2017",2,313,entity_set,1
1585,How many districts contain the postcode OL2 8NR?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL2 8NR"")
RETURN COUNT(DISTINCT x0)","[PostCode] = OL2 8NR
How many districts contain the postcode OL2 8NR?",How many districts contain the postcode [x1.PostCode.code:OL2 8NR]?,x1.PostCode.code:OL2 8NR = OL2 8NR,2,210,count,1
758,Which crime happened first at 150 Hugh Oldham Drive?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""150 Hugh Oldham Drive"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 150 Hugh Oldham Drive
Which crime happened first at 150 Hugh Oldham Drive?",Which crime happened first at [x1.Location.address:150 Hugh Oldham Drive]?,x1.Location.address:150 Hugh Oldham Drive = 150 Hugh Oldham Drive,2,100,min,1
4529,What is the first crime involving a family member of someone named Jessica?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.name = ""Jessica"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Jessica
What is the first crime involving a family member of someone named Jessica?",What is the first crime involving a family member of someone named [x2.Person.name:Jessica]?,x2.Person.name:Jessica = Jessica,3,51,max,1
1821,How often do people with last name Williamson appear in vehicle crime cases?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Williamson
How often do people with last name Williamson appear in vehicle crime cases?",How often do people with last name [x1.Person.surname:Williamson] appear in [x0.Crime.type:Vehicle crime] cases?,"x0.Crime.type:Vehicle crime = vehicle crime
x1.Person.surname:Williamson = Williamson",2,241,count,1
3217,Can you name individuals whose friends also have friends?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:KNOWS_SN]-(x2:Person)
RETURN x0",Can you name individuals whose friends also have friends?,Can you name individuals whose friends also have friends?,,3,25,entity_set,1542
2255,"Where did crimes occur on August 4, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Crime] = 4/08/2017
Where did crimes occur on August 4, 2017?",Where did crimes occur on [x1.Crime.date:4/08/2017]?,"x1.Crime.date:4/08/2017 = August 4, 2017",2,304,entity_set,976
196,How many calls of 91 seconds were placed to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""91"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 91
How many calls of 91 seconds were placed to any phone?",How many calls of [x0.PhoneCall.call_duration:91] seconds were placed to any phone?,x0.PhoneCall.call_duration:91 = 91,2,23,count,1
896,Can you identify all family members connected to someone with last name Palmer?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Palmer"")
RETURN x0","[Person] = Palmer
Can you identify all family members connected to someone with last name Palmer?",Can you identify all family members connected to someone with last name [x1.Person.surname:Palmer]?,x1.Person.surname:Palmer = Palmer,2,117,entity_set,2
225,What phones have dialed the number 1-(111)459-3206?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0","[Phone] = 1-(111)459-3206
What phones have dialed the number 1-(111)459-3206?",What phones have dialed the number [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,28,entity_set,2
1438,How many crimes on 22/08/2017 were probed by officers with badge number 74-9647050?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-9647050"")
RETURN COUNT(DISTINCT x0)","[Crime] = 22/08/2017
[Officer] = 74-9647050
How many crimes on 22/08/2017 were probed by officers with badge number 74-9647050?",How many crimes on [x0.Crime.date:22/08/2017] were probed by officers with badge number [x1.Officer.badge_no:74-9647050]?,"x0.Crime.date:22/08/2017 = 22/08/2017
x1.Officer.badge_no:74-9647050 = 74-9647050",2,190,count,1
881,Can you provide the emails for people whose NHS number is 680-93-7668?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""680-93-7668"")
RETURN x0","[Person] = 680-93-7668
Can you provide the emails for people whose NHS number is 680-93-7668?",Can you provide the emails for people whose NHS number is [x1.Person.nhs_no:680-93-7668]?,x1.Person.nhs_no:680-93-7668 = 680-93-7668,2,116,entity_set,1
229,Can you identify the phones that contacted 0-(711)302-8090?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""0-(711)302-8090"")
RETURN x0","[Phone] = 0-(711)302-8090
Can you identify the phones that contacted 0-(711)302-8090?",Can you identify the phones that contacted [x2.Phone.phoneNo:0-(711)302-8090]?,x2.Phone.phoneNo:0-(711)302-8090 = 0-(711)302-8090,3,28,entity_set,6
119,Who are the individuals residing with Kevin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Kevin"")
RETURN x0","[Person] = Kevin
Who are the individuals residing with Kevin?",Who are the individuals residing with [x1.Person.name:Kevin]?,x1.Person.name:Kevin = Kevin,2,14,entity_set,2
1310,What is the most recent investigation by officers with last name Shakesby that included E250 model cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""E250"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Shakesby"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = E250
[Officer] = Shakesby
What is the most recent investigation by officers with last name Shakesby that included E250 model cars?",What is the most recent investigation by officers with last name [x1.Officer.surname:Shakesby] that included [x2.Vehicle.model:E250] model cars?,"x1.Officer.surname:Shakesby = Shakesby
x2.Vehicle.model:E250 = E250",3,173,argmax,1
306,What is the number of locations where crimes couldn't be prosecuted against the suspect?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
What is the number of locations where crimes couldn't be prosecuted against the suspect?",What is the number of locations where crimes [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = couldn't be prosecuted against the suspect,2,38,count,1
2038,"On 18/08/2017, what was the maximum length of calls to phones that also made calls?","MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 18/08/2017
On 18/08/2017, what was the maximum length of calls to phones that also made calls?","On [x2.PhoneCall.call_date:18/08/2017], what was the maximum length of calls to phones that also made calls?",x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,273,argmax,1
319,"How many calls were placed to 6-(438)031-8267 on August 20, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""20/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(438)031-8267"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20/08/2017
[Phone] = 6-(438)031-8267
How many calls were placed to 6-(438)031-8267 on August 20, 2017?",How many calls were placed to [x1.Phone.phoneNo:6-(438)031-8267] on [x0.PhoneCall.call_date:20/08/2017]?,"x0.PhoneCall.call_date:20/08/2017 = August 20, 2017 
x1.Phone.phoneNo:6-(438)031-8267 = 6-(438)031-8267",2,40,count,1
2975,When was the initial crime associated with the email awarddi@youku.com committed?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""awarddi@youku.com"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = awarddi@youku.com
When was the initial crime associated with the email awarddi@youku.com committed?",When was the initial crime associated with the email [x2.Email.email_address:awarddi@youku.com] committed?,x2.Email.email_address:awarddi@youku.com = awarddi@youku.com,3,431,argmin,1
1881,Can you identify all Andreas related to a person whose surname is Lawrence?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Person] = Andrea
[Person] = Lawrence
Can you identify all Andreas related to a person whose surname is Lawrence?",Can you identify all [x0.Person.name:Andrea] related to a person whose surname is [x1.Person.surname:Lawrence]?,"x0.Person.name:Andrea = Andreas
x1.Person.surname:Lawrence = Lawrence",2,251,entity_set,1
1527,What is the number of crime sites with the postcode M45 6EH on 1/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""M45 6EH"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""1/08/2017"")
RETURN COUNT(DISTINCT x0)","[Location] = M45 6EH
[Crime] = 1/08/2017
What is the number of crime sites with the postcode M45 6EH on 1/08/2017?",What is the number of crime sites with the postcode [x0.Location.postcode:M45 6EH] on [x1.Crime.date:1/08/2017]?,"x0.Location.postcode:M45 6EH = M45 6EH
x1.Crime.date:1/08/2017 = 1/08/2017",2,202,count,1
4448,What are the email addresses of someone living with a person named Rachel?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Rachel"")
RETURN x0.email_address","[Person] = Rachel
What are the email addresses of someone living with a person named Rachel?",What are the email addresses of someone living with a person named [x2.Person.name:Rachel]?,x2.Person.name:Rachel = Rachel,3,29,attribute_set,4
331,Who resides at 182 Elm Road?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""182 Elm Road"")
RETURN x0","[Location] = 182 Elm Road
Who resides at 182 Elm Road?",Who resides at [x1.Location.address:182 Elm Road]?,x1.Location.address:182 Elm Road = 182 Elm Road,2,42,entity_set,1
3712,Which was the earliest crime involving a Cunningham's roommate?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Cunningham"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Cunningham
Which was the earliest crime involving a Cunningham's roommate?",Which was the earliest crime involving a [x2.Person.surname:Cunningham]'s roommate?,x2.Person.surname:Cunningham = Cunningham,3,188,min,1
2919,When were crimes committed by residents of 199 Sandringham Drive?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""199 Sandringham Drive"")
RETURN x0.date","[Location] = 199 Sandringham Drive
When were crimes committed by residents of 199 Sandringham Drive?",When were crimes committed by residents of [x2.Location.address:199 Sandringham Drive]?,x2.Location.address:199 Sandringham Drive = 199 Sandringham Drive,3,424,attribute_set,1
416,Can you provide a list of locations with the postcode M9 8DA?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M9 8DA"")
RETURN x0","[PostCode] = M9 8DA
Can you provide a list of locations with the postcode M9 8DA?",Can you provide a list of locations with the postcode [x1.PostCode.code:M9 8DA]?,x1.PostCode.code:M9 8DA = M9 8DA,2,54,entity_set,2
2159,How many thefts from individuals are probed by officers with badge number 74-2393363?,"MATCH (x0:Crime WHERE x0.type = ""Theft from the person"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-2393363"")
RETURN COUNT(DISTINCT x0)","[Crime] = Theft from the person
[Officer] = 74-2393363
How many thefts from individuals are probed by officers with badge number 74-2393363?",How many [x0.Crime.type:Theft from the person] are probed by officers with badge number [x1.Officer.badge_no:74-2393363]?,"x0.Crime.type:Theft from the person = thefts from individuals 
x1.Officer.badge_no:74-2393363 = 74-2393363",2,292,count,1
1317,"At 01:47, how many calls went to 1-(463)289-5744?","MATCH (x0:PhoneCall WHERE x0.call_time = ""01:47"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(463)289-5744"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 01:47
[Phone] = 1-(463)289-5744
At 01:47, how many calls went to 1-(463)289-5744?","At [x0.PhoneCall.call_time:01:47], how many calls went to [x1.Phone.phoneNo:1-(463)289-5744]?","x0.PhoneCall.call_time:01:47 = 01:47
x1.Phone.phoneNo:1-(463)289-5744 = 1-(463)289-5744",2,174,count,1
730,How many crimes on 25/08/2017 involve individuals named Diana?,"MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Diana"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Diana
How many crimes on 25/08/2017 involve individuals named Diana?",How many crimes on [x0.Crime.date:25/08/2017] involve individuals named [x1.Person.name:Diana]?,"x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.name:Diana = Diana",2,97,count,1
1150,What violent and sexual crimes are investigated by officers with surname Piche?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Piche"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Piche
What violent and sexual crimes are investigated by officers with surname Piche?",What [x0.Crime.type:Violence and sexual offences] are investigated by officers with surname [x1.Officer.surname:Piche]?,"x0.Crime.type:Violence and sexual offences = violent and sexual crimes 
x1.Officer.surname:Piche = Piche",2,152,entity_set,8
2964,What are the emails of individuals related to the Crawfords?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Crawford"")
RETURN x0","[Person] = Crawford
What are the emails of individuals related to the Crawfords?",What are the emails of individuals related to the [x2.Person.surname:Crawford]?,x2.Person.surname:Crawford = Crawfords,3,430,entity_set,2
3055,Can you identify offenses committed by those living with someone else?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0",Can you identify offenses committed by those living with someone else?,Can you identify offenses committed by those living with someone else?,,3,1,entity_set,46
371,Can you identify officers named Kincaid involved in crime investigations on 17/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Kincaid"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN x0","[Officer] = Kincaid
[Crime] = 17/08/2017
Can you identify officers named Kincaid involved in crime investigations on 17/08/2017?",Can you identify officers named [x0.Officer.name:Kincaid] involved in crime investigations on [x1.Crime.date:17/08/2017]?,"x0.Officer.name:Kincaid = Kincaid
x1.Crime.date:17/08/2017 = 17/08/2017",2,49,entity_set,4
662,Can you identify everyone who is friends with someone with last name Martin?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Martin"")
RETURN x0","[Person] = Martin
Can you identify everyone who is friends with someone with last name Martin?",Can you identify everyone who is friends with someone with last name [x1.Person.surname:Martin]?,x1.Person.surname:Martin = Martin,2,88,entity_set,3
1132,"How many calls did phone number 3-(687)257-9759 get on August 23, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""3-(687)257-9759"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(687)257-9759
How many calls did phone number 3-(687)257-9759 get on August 23, 2017?",How many calls did phone number [x1.Phone.phoneNo:3-(687)257-9759] get on [x0.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:23/08/2017 = August 23, 2017 
x1.Phone.phoneNo:3-(687)257-9759 = 3-(687)257-9759",2,150,count,1
4566,What is the count of vehicle crimes linked to the individual with the phone number 9-(730)063-7023?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(730)063-7023"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Phone] = 9-(730)063-7023
What is the count of vehicle crimes linked to the individual with the phone number 9-(730)063-7023?",What is the count of [x0.Crime.type:Vehicle crime] linked to the individual with the phone number [x2.Phone.phoneNo:9-(730)063-7023]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x2.Phone.phoneNo:9-(730)063-7023 = 9-(730)063-7023",3,66,count,1
897,Which people have familial ties to those bearing the surname Palmer?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Palmer"")
RETURN x0","[Person] = Palmer
Which people have familial ties to those bearing the surname Palmer?",Which people have familial ties to those bearing the surname [x1.Person.surname:Palmer]?,x1.Person.surname:Palmer = Palmer,2,117,entity_set,2
1414,How many emails are associated with people named Scott?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Scott"")
RETURN COUNT(DISTINCT x0)","[Person] = Scott
How many emails are associated with people named Scott?",How many emails are associated with people named [x1.Person.name:Scott]?,x1.Person.name:Scott = Scott,2,187,count,1
357,How many criminal acts involve someone with the last name Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Murray
How many criminal acts involve someone with the last name Murray?",How many criminal acts involve someone with the last name [x1.Person.surname:Murray]?,x1.Person.surname:Murray = Murray,2,44,count,1
1724,"What is the number of vehicles linked to crimes on August 13, 2017?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
What is the number of vehicles linked to crimes on August 13, 2017?",What is the number of vehicles linked to crimes on [x1.Crime.date:13/08/2017]?,"x1.Crime.date:13/08/2017 = August 13, 2017",2,228,count,1
1916,Which phones had a call that lasted 32 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""32"")
RETURN x0","[PhoneCall] = 32
Which phones had a call that lasted 32 seconds?",Which phones had a call that lasted [x1.PhoneCall.call_duration:32] seconds?,x1.PhoneCall.call_duration:32 = 32,2,255,entity_set,4
1289,What is the count of 'Other theft' crimes at all locations?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:OCCURRED_AT]-(x1:Location)
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
What is the count of 'Other theft' crimes at all locations?",What is the count of '[x0.Crime.type:Other theft]' crimes at all locations?,x0.Crime.type:Other theft = Other theft,2,171,count,1
895,Who are the relatives of individuals with the last name Palmer?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Palmer"")
RETURN x0","[Person] = Palmer
Who are the relatives of individuals with the last name Palmer?",Who are the relatives of individuals with the last name [x1.Person.surname:Palmer]?,x1.Person.surname:Palmer = Palmer,2,117,entity_set,2
1305,When did officers with the surname Yablsley last investigate a crime involving Element vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Element"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Yablsley"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Element
[Officer] = Yablsley
When did officers with the surname Yablsley last investigate a crime involving Element vehicles?",When did officers with the surname [x1.Officer.surname:Yablsley] last investigate a crime involving [x2.Vehicle.model:Element] vehicles?,"x1.Officer.surname:Yablsley = Yablsley
x2.Vehicle.model:Element = Element",3,173,argmax,1
1892,Which phones made a 14-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""14"")
RETURN x0","[PhoneCall] = 14
Which phones made a 14-second call?",Which phones made a [x1.PhoneCall.call_duration:14]-second call?,x1.PhoneCall.call_duration:14 = 14,2,252,entity_set,2
1759,What number of crimes involved vehicles from 2001?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2001"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
What number of crimes involved vehicles from 2001?",What number of crimes involved vehicles from [x1.Vehicle.year:2001]?,x1.Vehicle.year:2001 = 2001,2,233,count,1
2949,What are the Vehicle crimes at 8 Glade Street involving Silverado 3500s?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""8 Glade Street"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Silverado 3500"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 8 Glade Street
[Vehicle] = Silverado 3500
What are the Vehicle crimes at 8 Glade Street involving Silverado 3500s?",What are the [x0.Crime.type:Vehicle crime] at [x2.Location.address:8 Glade Street] involving [x1.Vehicle.model:Silverado 3500]?,"x0.Crime.type:Vehicle crime = Vehicle crimes
x1.Vehicle.model:Silverado 3500 = Silverado 3500s
x2.Location.address:8 Glade Street = 8 Glade Street",3,428,entity_set,1
3383,What is the most recent crime involving an acquaintance of the person with NHS number 329-25-8167?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""329-25-8167"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 329-25-8167
What is the most recent crime involving an acquaintance of the person with NHS number 329-25-8167?",What is the most recent crime involving an acquaintance of the person with NHS number [x2.Person.nhs_no:329-25-8167]?,x2.Person.nhs_no:329-25-8167 = 329-25-8167,3,49,max,1
2510,How many Police Constables probed crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
How many Police Constables probed crimes?",How many [x0.Officer.rank:Police Constable] probed crimes?,x0.Officer.rank:Police Constable = Police Constables,2,350,count,1
3682,Can you identify Volkswagen models involved in investigations by the officer with badge 13-4982566?,"MATCH (x0:Vehicle WHERE x0.make = ""Volkswagen"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""13-4982566"")
RETURN x0.model","[Vehicle] = Volkswagen
[Officer] = 13-4982566
Can you identify Volkswagen models involved in investigations by the officer with badge 13-4982566?",Can you identify [x0.Vehicle.make:Volkswagen] models involved in investigations by the officer with badge [x2.Officer.badge_no:13-4982566]?,"x0.Vehicle.make:Volkswagen = Volkswagen
x2.Officer.badge_no:13-4982566 = 13-4982566",3,176,attribute_set,1
2519,What locations are within the M30 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M30"")
RETURN x0","[Area] = M30
What locations are within the M30 area code?",What locations are within the [x1.Area.areaCode:M30] area code?,x1.Area.areaCode:M30 = M30,2,351,entity_set,210
1405,How many 66-second calls did phone number 0-(752)850-0116 get?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""66"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(752)850-0116"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
[Phone] = 0-(752)850-0116
How many 66-second calls did phone number 0-(752)850-0116 get?",How many [x0.PhoneCall.call_duration:66]-second calls did phone number [x1.Phone.phoneNo:0-(752)850-0116] get?,"x0.PhoneCall.call_duration:66 = 66
x1.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116",2,184,count,1
590,What's the oldest age of someone acquainted with people surnamed Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Nguyen
What's the oldest age of someone acquainted with people surnamed Nguyen?",What's the oldest age of someone acquainted with people surnamed [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,78,argmin,1
2182,How many Cadillacs are connected to criminal activities?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Cadillac
How many Cadillacs are connected to criminal activities?",How many [x0.Vehicle.make:Cadillac] are connected to criminal activities?,x0.Vehicle.make:Cadillac = Cadillacs,2,295,count,1
4599,Can you provide the phones of individuals who are friends with Brenda?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brenda"")
RETURN x0","[Person] = Brenda
Can you provide the phones of individuals who are friends with Brenda?",Can you provide the phones of individuals who are friends with [x2.Person.name:Brenda]?,x2.Person.name:Brenda = Brenda,3,71,entity_set,8
1755,How many crimes involved 2011 vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2011"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2011
How many crimes involved 2011 vehicles?",How many crimes involved [x1.Vehicle.year:2011] vehicles?,x1.Vehicle.year:2011 = 2011,2,233,count,1
386,Which crime involving Bonneville cars happened last?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Bonneville"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Bonneville
Which crime involving Bonneville cars happened last?",Which crime involving [x1.Vehicle.model:Bonneville] cars happened last?,x1.Vehicle.model:Bonneville = Bonneville,2,51,max,1
380,How many offenses were committed using a vehicle?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)",How many offenses were committed using a vehicle?,How many offenses were committed using a vehicle?,,2,50,count,1
1298,What is the count of 37-second phone calls received?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""37"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 37
What is the count of 37-second phone calls received?",What is the count of [x0.PhoneCall.call_duration:37]-second phone calls received?,x0.PhoneCall.call_duration:37 = 37,2,172,count,1
4632,What is the initial crime with a person aware of Virginia's phone contact?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Virginia"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Virginia
What is the initial crime with a person aware of Virginia's phone contact?",What is the initial crime with a person aware of [x2.Person.name:Virginia]'s phone contact?,x2.Person.name:Virginia = Virginia,3,89,min,1
2770,In what vehicle crimes is Phillip involved with XT vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""XT"")
RETURN x0","[Crime] = Vehicle crime
[Person] = Phillip
[Vehicle] = XT
In what vehicle crimes is Phillip involved with XT vehicles?",In what [x0.Crime.type:Vehicle crime] is [x2.Person.name:Phillip] involved with [x1.Vehicle.model:XT] vehicles?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:XT = XT
x2.Person.name:Phillip = Phillip",3,401,entity_set,1
1450,How many relatives does the person with NHS number 872-88-7149 have?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""872-88-7149"")
RETURN COUNT(DISTINCT x0)","[Person] = 872-88-7149
How many relatives does the person with NHS number 872-88-7149 have?",How many relatives does the person with NHS number [x1.Person.nhs_no:872-88-7149] have?,x1.Person.nhs_no:872-88-7149 = 872-88-7149,2,191,count,1
