id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2161,How many incidents of theft from a person are examined by the officer with badge number 74-2393363?,"MATCH (x0:Crime WHERE x0.type = ""Theft from the person"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-2393363"")
RETURN COUNT(DISTINCT x0)","[Crime] = Theft from the person
[Officer] = 74-2393363
How many incidents of theft from a person are examined by the officer with badge number 74-2393363?",How many incidents of [x0.Crime.type:Theft from the person] are examined by the officer with badge number [x1.Officer.badge_no:74-2393363]?,"x0.Crime.type:Theft from the person = theft from a person 
x1.Officer.badge_no:74-2393363 = 74-2393363",2,292,count,1
4609,How many homes are occupied by people associated with a crime?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",How many homes are occupied by people associated with a crime?,How many homes are occupied by people associated with a crime?,,3,73,count,1
1078,"How many crimes on February 8, 2017, involved Ford vehicles?","MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Ford"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Ford
How many crimes on February 8, 2017, involved Ford vehicles?","How many crimes on [x0.Crime.date:2/08/2017], involved [x1.Vehicle.make:Ford] vehicles?","x0.Crime.date:2/08/2017 = February 8, 2017 
x1.Vehicle.make:Ford = Ford",2,143,count,1
2014,"How many cases, labeled ""Investigation complete; no suspect identified,"" involved NSX vehicles?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""NSX"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = NSX
How many cases, labeled ""Investigation complete; no suspect identified,"" involved NSX vehicles?","How many cases, labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" involved [x1.Vehicle.model:NSX] vehicles?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:NSX = NSX",2,270,count,1
2718,When did crimes involving a Morales family member take place?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Morales"")
RETURN x0.date","[Person] = Morales
When did crimes involving a Morales family member take place?",When did crimes involving a [x2.Person.surname:Morales] family member take place?,x2.Person.surname:Morales = Morales,3,393,attribute_set,7
2203,Who has the contact number of a person with the surname Armstrong?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Armstrong"")
RETURN COUNT(DISTINCT x0)","[Person] = Armstrong
Who has the contact number of a person with the surname Armstrong?",Who has the contact number of a person with the surname [x1.Person.surname:Armstrong]?,x1.Person.surname:Armstrong = Armstrong,2,297,count,1
480,Which calls were received at 7-(995)917-0996?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(995)917-0996"")
RETURN x0","[Phone] = 7-(995)917-0996
Which calls were received at 7-(995)917-0996?",Which calls were received at [x1.Phone.phoneNo:7-(995)917-0996]?,x1.Phone.phoneNo:7-(995)917-0996 = 7-(995)917-0996,2,62,entity_set,2
3148,What is the number of crimes committed by people who have friends?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person)
RETURN COUNT(DISTINCT x0)",What is the number of crimes committed by people who have friends?,What is the number of crimes committed by people who have friends?,,3,14,count,1
2944,Can you provide a list of Escalade-related vehicle crimes at 129 George Street?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Escalade"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 129 George Street
[Vehicle] = Escalade
Can you provide a list of Escalade-related vehicle crimes at 129 George Street?",Can you provide a list of [x1.Vehicle.model:Escalade]-related [x0.Crime.type:Vehicle crime] at [x2.Location.address:129 George Street]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Escalade = Escalade
x2.Location.address:129 George Street = 129 George Street",3,428,entity_set,1
1177,What are the violence and sexual offences investigated by officers with badge number 76-8953443?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""76-8953443"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = 76-8953443
What are the violence and sexual offences investigated by officers with badge number 76-8953443?",What are the [x0.Crime.type:Violence and sexual offences] investigated by officers with badge number [x1.Officer.badge_no:76-8953443]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Officer.badge_no:76-8953443 = 76-8953443",2,156,entity_set,9
204,Can you identify everyone related to someone named Christopher?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Christopher"")
RETURN x0","[Person] = Christopher
Can you identify everyone related to someone named Christopher?",Can you identify everyone related to someone named [x1.Person.name:Christopher]?,x1.Person.name:Christopher = Christopher,2,24,entity_set,8
3369,When did the first crime happen that Officer Hynam investigated at 73 Gilmerton Drive?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Hynam"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""73 Gilmerton Drive"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Hynam
[Location] = 73 Gilmerton Drive
When did the first crime happen that Officer Hynam investigated at 73 Gilmerton Drive?",When did the first crime happen that Officer [x1.Officer.surname:Hynam] investigated at [x2.Location.address:73 Gilmerton Drive]?,"x1.Officer.surname:Hynam = Hynam
x2.Location.address:73 Gilmerton Drive = 73 Gilmerton Drive",3,48,argmin,1
3198,What are the surnames of individuals linked to crimes at post code BL1 6RN?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 6RN"")
RETURN x0.surname","[Location] = BL1 6RN
What are the surnames of individuals linked to crimes at post code BL1 6RN?",What are the surnames of individuals linked to crimes at post code [x2.Location.postcode:BL1 6RN]?,x2.Location.postcode:BL1 6RN = BL1 6RN,3,21,attribute_set,1
3203,How many emails pertain to those engaged in criminal activities?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN COUNT(DISTINCT x0)",How many emails pertain to those engaged in criminal activities?,How many emails pertain to those engaged in criminal activities?,,3,22,count,1
3136,How many individuals are aware of the phone number for a person whose last name is Lee and has the email rlee56@ifeng.com?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Lee"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""rlee56@ifeng.com"")
RETURN COUNT(DISTINCT x0)","[Person] = Lee
[Email] = rlee56@ifeng.com
How many individuals are aware of the phone number for a person whose last name is Lee and has the email rlee56@ifeng.com?",How many individuals are aware of the phone number for a person whose last name is [x1.Person.surname:Lee] and has the email [x2.Email.email_address:rlee56@ifeng.com]?,"x1.Person.surname:Lee = Lee
x2.Email.email_address:rlee56@ifeng.com = rlee56@ifeng.com",3,12,count,1
1339,Which Pontiac cars were linked to crimes on 24/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN x0","[Vehicle] = Pontiac
[Crime] = 24/08/2017
Which Pontiac cars were linked to crimes on 24/08/2017?",Which [x0.Vehicle.make:Pontiac] cars were linked to crimes on [x1.Crime.date:24/08/2017]?,"x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.date:24/08/2017 = 24/08/2017",2,177,entity_set,1
3417,What illegal activities took place at Peter's residence?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Peter"")
RETURN x0","[Person] = Peter
What illegal activities took place at Peter's residence?",What illegal activities took place at [x2.Person.name:Peter]'s residence?,x2.Person.name:Peter = Peter,3,63,entity_set,9
1196,"On 25/08/2017, how many incidents involve a person with the surname Ward?","MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Ward"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Ward
On 25/08/2017, how many incidents involve a person with the surname Ward?","On [x0.Crime.date:25/08/2017], how many incidents involve a person with the surname [x1.Person.surname:Ward]?","x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.surname:Ward = Ward",2,159,count,1
3550,Can you provide the dates for violence and sexual offenses in the M9 region?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M9"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = M9
Can you provide the dates for violence and sexual offenses in the M9 region?",Can you provide the dates for [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:M9] region?,"x0.Crime.type:Violence and sexual offences = violence and sexual offenses 
x2.Area.areaCode:M9 = M9",3,111,attribute_set,187
2311,Which emails correspond to those named Ann?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Ann"")
RETURN x0","[Person] = Ann
Which emails correspond to those named Ann?",Which emails correspond to those named [x1.Person.name:Ann]?,x1.Person.name:Ann = Ann,2,311,entity_set,1
3014,How many crimes on 24/08/2017 involved Buick vehicles in postcode M23 9GB locations?,"MATCH (x0:Vehicle WHERE x0.make = ""Buick"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""24/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M23 9GB"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Buick
[Crime] = 24/08/2017
[Location] = M23 9GB
How many crimes on 24/08/2017 involved Buick vehicles in postcode M23 9GB locations?",How many crimes on [x1.Crime.date:24/08/2017] involved [x0.Vehicle.make:Buick] vehicles in postcode [x2.Location.postcode:M23 9GB] locations?,"x0.Vehicle.make:Buick = Buick
x1.Crime.date:24/08/2017 = 24/08/2017
x2.Location.postcode:M23 9GB = M23 9GB",3,436,count,1
1451,What is the number of family members linked to the individual with NHS number 872-88-7149?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""872-88-7149"")
RETURN COUNT(DISTINCT x0)","[Person] = 872-88-7149
What is the number of family members linked to the individual with NHS number 872-88-7149?",What is the number of family members linked to the individual with NHS number [x1.Person.nhs_no:872-88-7149]?,x1.Person.nhs_no:872-88-7149 = 872-88-7149,2,191,count,1
2870,Do you know the emails of Amanda's friends?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Amanda"")
RETURN x0","[Person] = Amanda
Do you know the emails of Amanda's friends?",Do you know the emails of [x2.Person.name:Amanda]'s friends?,x2.Person.name:Amanda = Amanda,3,417,entity_set,22
107,How many Amys are acquainted with anyone with surname Weaver?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Weaver"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Weaver
How many Amys are acquainted with anyone with surname Weaver?",How many [x0.Person.name:Amy] are acquainted with anyone with surname [x1.Person.surname:Weaver]?,"x0.Person.name:Amy = Amys
x1.Person.surname:Weaver = Weaver",2,13,count,1
1355,"On 06/08/2017, how many phones registered to someone with last name Mason made calls?","MATCH (x0:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""06/08/2017"")
MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Mason"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 06/08/2017
[Person] = Mason
On 06/08/2017, how many phones registered to someone with last name Mason made calls?","On [x2.PhoneCall.call_date:06/08/2017], how many phones registered to someone with last name [x1.Person.surname:Mason] made calls?","x1.Person.surname:Mason = Mason
x2.PhoneCall.call_date:06/08/2017 = 06/08/2017",3,178,count,1
3638,Who are the individuals residing with someone acquainted with a person with surname Barnes?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Barnes"")
RETURN x0","[Person] = Barnes
Who are the individuals residing with someone acquainted with a person with surname Barnes?",Who are the individuals residing with someone acquainted with a person with surname [x2.Person.surname:Barnes]?,x2.Person.surname:Barnes = Barnes,3,151,entity_set,3
99,What is the count of Volkswagen cars tied to crimes on 1st August 2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Volkswagen"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""1/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Volkswagen
[Crime] = 1/08/2017
What is the count of Volkswagen cars tied to crimes on 1st August 2017?",What is the count of [x0.Vehicle.make:Volkswagen] cars tied to crimes on [x1.Crime.date:1/08/2017]?,"x0.Vehicle.make:Volkswagen = Volkswagen
x1.Crime.date:1/08/2017 = 1st August 2017",2,12,count,1
230,Which phones called the number 7-(727)924-9245?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""7-(727)924-9245"")
RETURN x0","[Phone] = 7-(727)924-9245
Which phones called the number 7-(727)924-9245?",Which phones called the number [x2.Phone.phoneNo:7-(727)924-9245]?,x2.Phone.phoneNo:7-(727)924-9245 = 7-(727)924-9245,3,28,entity_set,2
1884,Can you identify every Amy related to a person whose surname is Wood?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Wood"")
RETURN x0","[Person] = Amy
[Person] = Wood
Can you identify every Amy related to a person whose surname is Wood?",Can you identify every [x0.Person.name:Amy] related to a person whose surname is [x1.Person.surname:Wood]?,"x0.Person.name:Amy = Amy
x1.Person.surname:Wood = Wood",2,251,entity_set,1
3054,What crimes involve individuals cohabiting with others?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0",What crimes involve individuals cohabiting with others?,What crimes involve individuals cohabiting with others?,,3,1,entity_set,46
342,What are the newest criminal incidents at 100 St James Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""100 St James Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 100 St James Street
What are the newest criminal incidents at 100 St James Street?",What are the newest criminal incidents at [x1.Location.address:100 St James Street]?,x1.Location.address:100 St James Street = 100 St James Street,2,43,max,1
61,Who does anyone named Douglas know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Douglas"")
RETURN x0","[Person] = Douglas
Who does anyone named Douglas know?",Who does anyone named [x1.Person.name:Douglas] know?,x1.Person.name:Douglas = Douglas,2,7,entity_set,3
2655,What emails are held by those who are friends with a person surnamed Nguyen?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Nguyen"")
RETURN x0","[Person] = Nguyen
What emails are held by those who are friends with a person surnamed Nguyen?",What emails are held by those who are friends with a person surnamed [x2.Person.surname:Nguyen]?,x2.Person.surname:Nguyen = Nguyen,3,382,entity_set,11
783,"Can you identify the oldest vehicle associated with a crime, where the investigation is complete with no suspect found, involving an individual with last name Peters?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Peters"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Peters
Can you identify the oldest vehicle associated with a crime, where the investigation is complete with no suspect found, involving an individual with last name Peters?","Can you identify the oldest vehicle associated with a crime, where the [x1.Crime.last_outcome:Investigation complete; no suspect identified], involving an individual with last name [x2.Person.surname:Peters]?","x1.Crime.last_outcome:Investigation complete; no suspect identified = investigation is complete with no suspect found 
x2.Person.surname:Peters = Peters",3,103,max,1
2463,What is the first crime involving an G37 vehicle that an officer with last name Thornber investigated?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Thornber"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""G37"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Thornber
[Vehicle] = G37
What is the first crime involving an G37 vehicle that an officer with last name Thornber investigated?",What is the first crime involving an [x1.Vehicle.model:G37] vehicle that an officer with last name [x2.Officer.surname:Thornber] investigated?,"x1.Vehicle.model:G37 = G37
x2.Officer.surname:Thornber = Thornber",3,341,min,1
1622,What is the first crime involving Mazda3 vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Mazda3"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Mazda3
What is the first crime involving Mazda3 vehicles?",What is the first crime involving [x1.Vehicle.model:Mazda3] vehicles?,x1.Vehicle.model:Mazda3 = Mazda3,2,214,min,1
722,"Can you provide a list of crime sites on August 20, 2017, with the postcode M9 4NL?","MATCH (x0:Location WHERE x0.postcode = ""M9 4NL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Location] = M9 4NL
[Crime] = 20/08/2017
Can you provide a list of crime sites on August 20, 2017, with the postcode M9 4NL?","Can you provide a list of crime sites on [x1.Crime.date:20/08/2017], with the postcode [x0.Location.postcode:M9 4NL]?","x0.Location.postcode:M9 4NL = M9 4NL
x1.Crime.date:20/08/2017 = August 20, 2017",2,96,entity_set,1
3499,What's the newest crime reported at M24 2GP?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M24 2GP"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M24 2GP
What's the newest crime reported at M24 2GP?",What's the newest crime reported at [x2.PostCode.code:M24 2GP]?,x2.PostCode.code:M24 2GP = M24 2GP,3,103,max,1
3008,How many crimes on 26/08/2017 involved Chevrolet vehicles in the BL4 9HJ location?,"MATCH (x0:Vehicle WHERE x0.make = ""Chevrolet"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL4 9HJ"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Chevrolet
[Crime] = 26/08/2017
[Location] = BL4 9HJ
How many crimes on 26/08/2017 involved Chevrolet vehicles in the BL4 9HJ location?",How many crimes on [x1.Crime.date:26/08/2017] involved [x0.Vehicle.make:Chevrolet] vehicles in the [x2.Location.postcode:BL4 9HJ] location?,"x0.Vehicle.make:Chevrolet = Chevrolet
x1.Crime.date:26/08/2017 = 26/08/2017
x2.Location.postcode:BL4 9HJ = BL4 9HJ",3,436,count,1
2690,In which areas do people surnamed Franklin live?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Franklin"")
RETURN x0","[Person] = Franklin
In which areas do people surnamed Franklin live?",In which areas do people surnamed [x2.Person.surname:Franklin] live?,x2.Person.surname:Franklin = Franklin,3,389,entity_set,3
4413,What was the newest car linked to a crime at 129 George Street?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 129 George Street
What was the newest car linked to a crime at 129 George Street?",What was the newest car linked to a crime at [x2.Location.address:129 George Street]?,x2.Location.address:129 George Street = 129 George Street,3,12,max,1
1719,What is the number of people named Jennifer who share a home with Hawkins family members?,"MATCH (x0:Person WHERE x0.name = ""Jennifer"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hawkins"")
RETURN COUNT(DISTINCT x0)","[Person] = Jennifer
[Person] = Hawkins
What is the number of people named Jennifer who share a home with Hawkins family members?",What is the number of people named [x0.Person.name:Jennifer] who share a home with [x1.Person.surname:Hawkins] family members?,"x0.Person.name:Jennifer = Jennifer
x1.Person.surname:Hawkins = Hawkins",2,226,count,1
1491,Could you list the emails of those who have Montgomery as their last name?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Montgomery"")
RETURN x0","[Person] = Montgomery
Could you list the emails of those who have Montgomery as their last name?",Could you list the emails of those who have [x1.Person.surname:Montgomery] as their last name?,x1.Person.surname:Montgomery = Montgomery,2,198,entity_set,1
4627,When was the earliest crime involving a person from postcode WA14 5BH?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""WA14 5BH"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = WA14 5BH
When was the earliest crime involving a person from postcode WA14 5BH?",When was the earliest crime involving a person from postcode [x2.Location.postcode:WA14 5BH]?,x2.Location.postcode:WA14 5BH = WA14 5BH,3,86,argmin,1
2148,What is the number of officers who probed offences labeled as Other theft?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
What is the number of officers who probed offences labeled as Other theft?",What is the number of officers who probed offences labeled as [x1.Crime.type:Other theft]?,x1.Crime.type:Other theft = Other theft,2,291,count,1
1255,What vehicle-related crimes occurred on 30/08/2017 involving GTI models?,"MATCH (x0:Crime WHERE x0.date = ""30/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""GTI"")
RETURN x0","[Crime] = 30/08/2017
[Vehicle] = GTI
What vehicle-related crimes occurred on 30/08/2017 involving GTI models?",What vehicle-related crimes occurred on [x0.Crime.date:30/08/2017] involving [x1.Vehicle.model:GTI] models?,"x0.Crime.date:30/08/2017 = 30/08/2017
x1.Vehicle.model:GTI = GTI",2,167,entity_set,1
1191,How many criminal acts on 19/08/2017 include individuals with the last name Morales?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN COUNT(DISTINCT x0)","[Crime] = 19/08/2017
[Person] = Morales
How many criminal acts on 19/08/2017 include individuals with the last name Morales?",How many criminal acts on [x0.Crime.date:19/08/2017] include individuals with the last name [x1.Person.surname:Morales]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x1.Person.surname:Morales = Morales",2,159,count,1
1071,How many phones are in the possession of anyone named Gloria?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Gloria"")
RETURN COUNT(DISTINCT x0)","[Person] = Gloria
How many phones are in the possession of anyone named Gloria?",How many phones are in the possession of anyone named [x1.Person.name:Gloria]?,x1.Person.name:Gloria = Gloria,2,142,count,1
1315,How many calls at 01:47 did 1-(463)289-5744 get?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""01:47"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(463)289-5744"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 01:47
[Phone] = 1-(463)289-5744
How many calls at 01:47 did 1-(463)289-5744 get?",How many calls at [x0.PhoneCall.call_time:01:47] did [x1.Phone.phoneNo:1-(463)289-5744] get?,"x0.PhoneCall.call_time:01:47 = 01:47
x1.Phone.phoneNo:1-(463)289-5744 = 1-(463)289-5744",2,174,count,1
752,Where does anyone named Dennis reside within the SK3 8JL postcode?,"MATCH (x0:Location WHERE x0.postcode = ""SK3 8JL"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Dennis"")
RETURN x0","[Location] = SK3 8JL
[Person] = Dennis
Where does anyone named Dennis reside within the SK3 8JL postcode?",Where does anyone named [x1.Person.name:Dennis] reside within the [x0.Location.postcode:SK3 8JL] postcode?,"x0.Location.postcode:SK3 8JL = SK3 8JL
x1.Person.name:Dennis = Dennis",2,99,entity_set,1
1798,How many Sergeants investigated public order violations?,"MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Public order"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Crime] = Public order
How many Sergeants investigated public order violations?",How many [x0.Officer.rank:Sergeant] investigated [x1.Crime.type:Public order] violations?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.type:Public order = public order",2,238,count,1
74,How many devices got a call at 10:26 PM?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""22:26"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 22:26
How many devices got a call at 10:26 PM?",How many devices got a call at [x1.PhoneCall.call_time:22:26]?,x1.PhoneCall.call_time:22:26 = 10:26 PM,2,9,count,1
3121,Can you provide the durations of calls received on 06/08/2017 by phones that dialed out on 23/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""06/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""23/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 06/08/2017
[PhoneCall] = 23/08/2017
Can you provide the durations of calls received on 06/08/2017 by phones that dialed out on 23/08/2017?",Can you provide the durations of calls received on [x0.PhoneCall.call_date:06/08/2017] by phones that dialed out on [x2.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:06/08/2017 = 06/08/2017
x2.PhoneCall.call_date:23/08/2017 = 23/08/2017",3,11,attribute_set,2
3412,Which NHS numbers belong to those with a familial link to someone with the email address egutierrezab@yolasite.com?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""egutierrezab@yolasite.com"")
RETURN x0.nhs_no","[Email] = egutierrezab@yolasite.com
Which NHS numbers belong to those with a familial link to someone with the email address egutierrezab@yolasite.com?",Which NHS numbers belong to those with a familial link to someone with the email address [x2.Email.email_address:egutierrezab@yolasite.com]?,x2.Email.email_address:egutierrezab@yolasite.com = egutierrezab@yolasite.com,3,59,attribute_set,2
2428,Which is the first crime that officers with the surname Jupp looked into?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Jupp"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Jupp
Which is the first crime that officers with the surname Jupp looked into?",Which is the first crime that officers with the surname [x1.Officer.surname:Jupp] looked into?,x1.Officer.surname:Jupp = Jupp,2,334,min,1
3039,Can you provide the email for the individual whose phone number is 3-(259)651-7024?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(259)651-7024"")
RETURN x0","[Phone] = 3-(259)651-7024
Can you provide the email for the individual whose phone number is 3-(259)651-7024?",Can you provide the email for the individual whose phone number is [x2.Phone.phoneNo:3-(259)651-7024]?,x2.Phone.phoneNo:3-(259)651-7024 = 3-(259)651-7024,3,442,entity_set,1
2019,"How many crimes, marked as ""Investigation complete; no suspect identified,"" included vehicles of model C30?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""C30"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = C30
How many crimes, marked as ""Investigation complete; no suspect identified,"" included vehicles of model C30?","How many crimes, marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" included vehicles of model [x1.Vehicle.model:C30]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:C30 = C30",2,270,count,1
738,"What Pontiac models are associated with crimes marked as ""Investigation complete; no suspect identified""?","MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Vehicle] = Pontiac
[Crime] = Investigation complete; no suspect identified
What Pontiac models are associated with crimes marked as ""Investigation complete; no suspect identified""?","What [x0.Vehicle.make:Pontiac] models are associated with crimes marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?","x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",2,98,entity_set,39
1666,Which are the names of individuals connected by family to those with the surname Marshall?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Marshall"")
RETURN x0.name","[Person] = Marshall
Which are the names of individuals connected by family to those with the surname Marshall?",Which are the names of individuals connected by family to those with the surname [x1.Person.surname:Marshall]?,x1.Person.surname:Marshall = Marshall,2,219,attribute_set,2
702,Which calls occurred at 06:07 from the phone number 3-(065)802-7791?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""06:07"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(065)802-7791"")
RETURN x0","[PhoneCall] = 06:07
[Phone] = 3-(065)802-7791
Which calls occurred at 06:07 from the phone number 3-(065)802-7791?",Which calls occurred at [x0.PhoneCall.call_time:06:07] from the phone number [x1.Phone.phoneNo:3-(065)802-7791]?,"x0.PhoneCall.call_time:06:07 = 06:07
x1.Phone.phoneNo:3-(065)802-7791 = 3-(065)802-7791",2,93,entity_set,1
3173,Which is the type of the most recent crime that involve individuals previously linked to vehicle crimes?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.type
ORDER BY x0.date DESC
LIMIT 1","[Crime] = Vehicle crime
Which is the type of the most recent crime that involve individuals previously linked to vehicle crimes?",Which is the type of the most recent crime that involve individuals previously linked to [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = vehicle crimes,3,17,argmax,1
2073,How often were Mitsubishi vehicles part of vehicle crimes?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Mitsubishi"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Mitsubishi
How often were Mitsubishi vehicles part of vehicle crimes?",How often were [x1.Vehicle.make:Mitsubishi] vehicles part of [x0.Crime.type:Vehicle crime]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Mitsubishi = Mitsubishi",2,278,count,1
1662,Can you name everyone related to someone with surname Phillips?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Phillips"")
RETURN x0.name","[Person] = Phillips
Can you name everyone related to someone with surname Phillips?",Can you name everyone related to someone with surname [x1.Person.surname:Phillips]?,x1.Person.surname:Phillips = Phillips,2,219,attribute_set,4
