id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
370,Who are the officers named Kincaid who investigated crimes on 17/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Kincaid"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN x0","[Officer] = Kincaid
[Crime] = 17/08/2017
Who are the officers named Kincaid who investigated crimes on 17/08/2017?",Who are the officers named [x0.Officer.name:Kincaid] who investigated crimes on [x1.Crime.date:17/08/2017]?,"x0.Officer.name:Kincaid = Kincaid
x1.Crime.date:17/08/2017 = 17/08/2017",2,49,entity_set,4
1583,How many regions include the postcode OL2 8NR?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL2 8NR"")
RETURN COUNT(DISTINCT x0)","[PostCode] = OL2 8NR
How many regions include the postcode OL2 8NR?",How many regions include the postcode [x1.PostCode.code:OL2 8NR]?,x1.PostCode.code:OL2 8NR = OL2 8NR,2,210,count,1
1013,Who are the Police Constables that handled vehicle crime cases?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Police Constable
[Crime] = Vehicle crime
Who are the Police Constables that handled vehicle crime cases?",Who are the [x0.Officer.rank:Police Constable] that handled [x1.Crime.type:Vehicle crime] cases?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.type:Vehicle crime = vehicle crime",2,133,entity_set,996
2689,What are the areas where those with the last name Gray are found?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
What are the areas where those with the last name Gray are found?",What are the areas where those with the last name [x2.Person.surname:Gray] are found?,x2.Person.surname:Gray = Gray,3,389,entity_set,2
2317,Which Rebeccas were implicated in criminal activities on 31/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Rebecca"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN x0","[Person] = Rebecca
[Crime] = 31/08/2017
Which Rebeccas were implicated in criminal activities on 31/08/2017?",Which [x0.Person.name:Rebecca] were implicated in criminal activities on [x1.Crime.date:31/08/2017]?,"x0.Person.name:Rebecca = Rebeccas
x1.Crime.date:31/08/2017 = 31/08/2017",2,313,entity_set,1
2241,"Can you identify 2006 vehicles tied to crimes marked as ""Investigation complete; no suspect found""?","MATCH (x0:Vehicle WHERE x0.year = ""2006"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Vehicle] = 2006
[Crime] = Investigation complete; no suspect identified
Can you identify 2006 vehicles tied to crimes marked as ""Investigation complete; no suspect found""?","Can you identify [x0.Vehicle.year:2006] vehicles tied to crimes marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?","x0.Vehicle.year:2006 = 2006
x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect found",2,303,entity_set,53
2532,How many Nolands in law enforcement probed any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Noland"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Noland
How many Nolands in law enforcement probed any crimes?",How many [x0.Officer.name:Noland]s in law enforcement probed any crimes?,x0.Officer.name:Noland = Noland,2,354,count,1
2162,How many burglary cases are handled by officers with badge number 23-7304886?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""23-7304886"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = 23-7304886
How many burglary cases are handled by officers with badge number 23-7304886?",How many [x0.Crime.type:Burglary] cases are handled by officers with badge number [x1.Officer.badge_no:23-7304886]?,"x0.Crime.type:Burglary = burglary
x1.Officer.badge_no:23-7304886 = 23-7304886",2,292,count,1
23,How many places with the postcode M9 7EB experienced crimes?,"MATCH (x0:Location WHERE x0.postcode = ""M9 7EB"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = M9 7EB
How many places with the postcode M9 7EB experienced crimes?",How many places with the postcode [x0.Location.postcode:M9 7EB] experienced crimes?,x0.Location.postcode:M9 7EB = M9 7EB,2,3,count,1
162,Can you identify everyone whose phone numbers are known to the holder of NHS number 821-24-9412?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""821-24-9412"")
RETURN x0","[Person] = 821-24-9412
Can you identify everyone whose phone numbers are known to the holder of NHS number 821-24-9412?",Can you identify everyone whose phone numbers are known to the holder of NHS number [x1.Person.nhs_no:821-24-9412]?,x1.Person.nhs_no:821-24-9412 = 821-24-9412,2,19,entity_set,1
760,What was the first crime at 68 Haigh Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""68 Haigh Road"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 68 Haigh Road
What was the first crime at 68 Haigh Road?",What was the first crime at [x1.Location.address:68 Haigh Road]?,x1.Location.address:68 Haigh Road = 68 Haigh Road,2,100,min,1
3135,How many know the phone number of someone with surname Lee with the email rlee56@ifeng.com?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Lee"")-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""rlee56@ifeng.com"")
RETURN COUNT(DISTINCT x0)","[Person] = Lee
[Email] = rlee56@ifeng.com
How many know the phone number of someone with surname Lee with the email rlee56@ifeng.com?",How many know the phone number of someone with surname [x1.Person.surname:Lee] with the email [x2.Email.email_address:rlee56@ifeng.com]?,"x1.Person.surname:Lee = Lee
x2.Email.email_address:rlee56@ifeng.com = rlee56@ifeng.com",3,12,count,1
1207,How many have the phone number 6-(703)886-7830?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""6-(703)886-7830"")
RETURN COUNT(DISTINCT x0)","[Phone] = 6-(703)886-7830
How many have the phone number 6-(703)886-7830?",How many have the phone number [x1.Phone.phoneNo:6-(703)886-7830]?,x1.Phone.phoneNo:6-(703)886-7830 = 6-(703)886-7830,2,162,count,1
1654,Which calls to 7-(277)735-5232 lasted exactly 20 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""20"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(277)735-5232"")
RETURN x0","[PhoneCall] = 20
[Phone] = 7-(277)735-5232
Which calls to 7-(277)735-5232 lasted exactly 20 seconds?",Which calls to [x1.Phone.phoneNo:7-(277)735-5232] lasted exactly [x0.PhoneCall.call_duration:20] seconds?,"x0.PhoneCall.call_duration:20 = 20
x1.Phone.phoneNo:7-(277)735-5232 = 7-(277)735-5232",2,217,entity_set,2
3464,What is the first call received by a person named Kevin?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Kevin"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Kevin
What is the first call received by a person named Kevin?",What is the first call received by a person named [x2.Person.name:Kevin]?,x2.Person.name:Kevin = Kevin,3,82,min,1
1110,Which places with the postcode M22 4ZB have reported violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""M22 4ZB"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Location] = M22 4ZB
[Crime] = Violence and sexual offences
Which places with the postcode M22 4ZB have reported violence and sexual offences?",Which places with the postcode [x0.Location.postcode:M22 4ZB] have reported [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:M22 4ZB = M22 4ZB
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,146,entity_set,2
2053,How often did criminal damage and arson occur at 58 Wellbank Close?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""58 Wellbank Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Location] = 58 Wellbank Close
How often did criminal damage and arson occur at 58 Wellbank Close?",How often did [x0.Crime.type:Criminal damage and arson] occur at [x1.Location.address:58 Wellbank Close]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Location.address:58 Wellbank Close = 58 Wellbank Close",2,276,count,1
395,Which officers holding the rank of Police Constable were involved in crime investigations on 20th August 2017?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Officer] = Police Constable
[Crime] = 20/08/2017
Which officers holding the rank of Police Constable were involved in crime investigations on 20th August 2017?",Which officers holding the rank of [x0.Officer.rank:Police Constable] were involved in crime investigations on [x1.Crime.date:20/08/2017]?,"x0.Officer.rank:Police Constable = Police Constable
x1.Crime.date:20/08/2017 = 20th August 2017",2,52,entity_set,344
3334,Who are the residents of the BL4 region?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""BL4"")
RETURN x0","[Area] = BL4
Who are the residents of the BL4 region?",Who are the residents of the [x2.Area.areaCode:BL4] region?,x2.Area.areaCode:BL4 = BL4,3,43,entity_set,8
572,"Can you provide the residences for the individual with NHS number 888-09-8856, specifically those with the postcode OL10 1AU?","MATCH (x0:Location WHERE x0.postcode = ""OL10 1AU"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""888-09-8856"")
RETURN x0","[Location] = OL10 1AU
[Person] = 888-09-8856
Can you provide the residences for the individual with NHS number 888-09-8856, specifically those with the postcode OL10 1AU?","Can you provide the residences for the individual with NHS number [x1.Person.nhs_no:888-09-8856], specifically those with the postcode [x0.Location.postcode:OL10 1AU]?","x0.Location.postcode:OL10 1AU = OL10 1AU
x1.Person.nhs_no:888-09-8856 = 888-09-8856",2,76,entity_set,1
530,What was the longest call made to 4-(120)613-7532?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(120)613-7532"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 4-(120)613-7532
What was the longest call made to 4-(120)613-7532?",What was the longest call made to [x1.Phone.phoneNo:4-(120)613-7532]?,x1.Phone.phoneNo:4-(120)613-7532 = 4-(120)613-7532,2,69,max,1
1398,How often was 3-(799)803-9159 called at 07:52?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""07:52"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(799)803-9159"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 07:52
[Phone] = 3-(799)803-9159
How often was 3-(799)803-9159 called at 07:52?",How often was [x1.Phone.phoneNo:3-(799)803-9159] called at [x0.PhoneCall.call_time:07:52]?,"x0.PhoneCall.call_time:07:52 = 07:52
x1.Phone.phoneNo:3-(799)803-9159 = 3-(799)803-9159",2,183,count,1
1121,What was the date of the initial crime at 122 Gingham Park?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""122 Gingham Park"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 122 Gingham Park
What was the date of the initial crime at 122 Gingham Park?",What was the date of the initial crime at [x1.Location.address:122 Gingham Park]?,x1.Location.address:122 Gingham Park = 122 Gingham Park,2,149,argmin,1
2730,Who is the oldest family member of a person who is friends with a Bradley?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Bradley"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Bradley
Who is the oldest family member of a person who is friends with a Bradley?",Who is the oldest family member of a person who is friends with a [x2.Person.surname:Bradley]?,x2.Person.surname:Bradley = Bradley,3,396,max,1
2554,How many offenses include someone?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)",How many offenses include someone?,How many offenses include someone?,,2,357,count,1
3681,What models of Volkswagen are associated with cases handled by the officer with badge number 13-4982566?,"MATCH (x0:Vehicle WHERE x0.make = ""Volkswagen"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""13-4982566"")
RETURN x0.model","[Vehicle] = Volkswagen
[Officer] = 13-4982566
What models of Volkswagen are associated with cases handled by the officer with badge number 13-4982566?",What models of [x0.Vehicle.make:Volkswagen] are associated with cases handled by the officer with badge number [x2.Officer.badge_no:13-4982566]?,"x0.Vehicle.make:Volkswagen = Volkswagen
x2.Officer.badge_no:13-4982566 = 13-4982566",3,176,attribute_set,1
378,Which officers named Even were involved in crime investigations on 30/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Even"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN x0","[Officer] = Even
[Crime] = 30/08/2017
Which officers named Even were involved in crime investigations on 30/08/2017?",Which officers named [x0.Officer.name:Even] were involved in crime investigations on [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Even = Even
x1.Crime.date:30/08/2017 = 30/08/2017",2,49,entity_set,2
976,"On 12/08/2017, at how many places did crimes occur?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""12/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 12/08/2017
On 12/08/2017, at how many places did crimes occur?","On [x1.Crime.date:12/08/2017], at how many places did crimes occur?",x1.Crime.date:12/08/2017 = 12/08/2017,2,127,count,1
608,What was the number of officers who probed crimes on 5th August 2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""5/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 5/08/2017
What was the number of officers who probed crimes on 5th August 2017?",What was the number of officers who probed crimes on [x1.Crime.date:5/08/2017]?,x1.Crime.date:5/08/2017 = 5th August 2017,2,80,count,1
133,What number of emails are tied to the national health service number 694-00-4113?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""694-00-4113"")
RETURN COUNT(DISTINCT x0)","[Person] = 694-00-4113
What number of emails are tied to the national health service number 694-00-4113?",What number of emails are tied to the national health service number [x1.Person.nhs_no:694-00-4113]?,x1.Person.nhs_no:694-00-4113 = 694-00-4113,2,15,count,1
2465,Which is the earliest crime involving an Tribeca model that was investigated by an officer with last name Younglove?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Younglove"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Tribeca"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Younglove
[Vehicle] = Tribeca
Which is the earliest crime involving an Tribeca model that was investigated by an officer with last name Younglove?",Which is the earliest crime involving an [x1.Vehicle.model:Tribeca] model that was investigated by an officer with last name [x2.Officer.surname:Younglove]?,"x1.Vehicle.model:Tribeca = Tribeca
x2.Officer.surname:Younglove = Younglove",3,341,min,1
659,How many offenses took place in locations with post code BL4 7DZ?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""BL4 7DZ"")
RETURN COUNT(DISTINCT x0)","[Location] = BL4 7DZ
How many offenses took place in locations with post code BL4 7DZ?",How many offenses took place in locations with post code [x1.Location.postcode:BL4 7DZ]?,x1.Location.postcode:BL4 7DZ = BL4 7DZ,2,87,count,1
2249,"Where did crimes occur on August 29, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""29/08/2017"")
RETURN x0","[Crime] = 29/08/2017
Where did crimes occur on August 29, 2017?",Where did crimes occur on [x1.Crime.date:29/08/2017]?,"x1.Crime.date:29/08/2017 = August 29, 2017",2,304,entity_set,958
4610,What is the briefest call received on the phone that got a call on 09/08/2017?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""09/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 09/08/2017
What is the briefest call received on the phone that got a call on 09/08/2017?",What is the briefest call received on the phone that got a call on [x2.PhoneCall.call_date:09/08/2017]?,x2.PhoneCall.call_date:09/08/2017 = 09/08/2017,3,76,min,1
582,Could you list the times for calls to 4-(974)681-7909?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(974)681-7909"")
RETURN x0.call_time","[Phone] = 4-(974)681-7909
Could you list the times for calls to 4-(974)681-7909?",Could you list the times for calls to [x1.Phone.phoneNo:4-(974)681-7909]?,x1.Phone.phoneNo:4-(974)681-7909 = 4-(974)681-7909,2,77,attribute_set,2
912,How many people count a Boyd among their friends?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN COUNT(DISTINCT x0)","[Person] = Boyd
How many people count a Boyd among their friends?",How many people count a [x1.Person.surname:Boyd] among their friends?,x1.Person.surname:Boyd = Boyd,2,119,count,1
2773,What is the latest crime linked to a person residing at 184 Sparrow Close?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""184 Sparrow Close"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 184 Sparrow Close
What is the latest crime linked to a person residing at 184 Sparrow Close?",What is the latest crime linked to a person residing at [x2.Location.address:184 Sparrow Close]?,x2.Location.address:184 Sparrow Close = 184 Sparrow Close,3,402,max,1
1912,How many people called Betty share a home with an individual with the NHS number 888-09-8856?,"MATCH (x0:Person WHERE x0.name = ""Betty"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""888-09-8856"")
RETURN COUNT(DISTINCT x0)","[Person] = Betty
[Person] = 888-09-8856
How many people called Betty share a home with an individual with the NHS number 888-09-8856?",How many people called [x0.Person.name:Betty] share a home with an individual with the NHS number [x1.Person.nhs_no:888-09-8856]?,"x0.Person.name:Betty = Betty
x1.Person.nhs_no:888-09-8856 = 888-09-8856",2,254,count,1
237,Which calls on 18/08/2017 were directed to 3-(285)553-8319?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(285)553-8319"")
RETURN x0","[PhoneCall] = 18/08/2017
[Phone] = 3-(285)553-8319
Which calls on 18/08/2017 were directed to 3-(285)553-8319?",Which calls on [x0.PhoneCall.call_date:18/08/2017] were directed to [x1.Phone.phoneNo:3-(285)553-8319]?,"x0.PhoneCall.call_date:18/08/2017 = 18/08/2017
x1.Phone.phoneNo:3-(285)553-8319 = 3-(285)553-8319",2,29,entity_set,1
2151,What is the number of officers who probed criminal damage and arson cases?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Criminal damage and arson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
What is the number of officers who probed criminal damage and arson cases?",What is the number of officers who probed [x1.Crime.type:Criminal damage and arson] cases?,x1.Crime.type:Criminal damage and arson = criminal damage and arson,2,291,count,1
2846,What is the newest crime connected to someone with the phone number 0-(752)850-0116?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""0-(752)850-0116"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 0-(752)850-0116
What is the newest crime connected to someone with the phone number 0-(752)850-0116?",What is the newest crime connected to someone with the phone number [x2.Phone.phoneNo:0-(752)850-0116]?,x2.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116,3,414,max,1
474,Which calls were received at 8-(657)218-7659?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(657)218-7659"")
RETURN x0","[Phone] = 8-(657)218-7659
Which calls were received at 8-(657)218-7659?",Which calls were received at [x1.Phone.phoneNo:8-(657)218-7659]?,x1.Phone.phoneNo:8-(657)218-7659 = 8-(657)218-7659,2,62,entity_set,2
3438,What's the length of Janice's longest received call?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Janice"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Janice
What's the length of Janice's longest received call?",What's the length of [x2.Person.name:Janice]'s longest received call?,x2.Person.name:Janice = Janice,3,66,argmax,1
3291,What is the latest crime involving a vehicle at postcode M16 7FH?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M16 7FH"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = M16 7FH
What is the latest crime involving a vehicle at postcode M16 7FH?",What is the latest crime involving a vehicle at postcode [x1.Location.postcode:M16 7FH]?,x1.Location.postcode:M16 7FH = M16 7FH,3,37,max,1
2389,How many officers handled cases with the status Unable to prosecute suspect?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
How many officers handled cases with the status Unable to prosecute suspect?",How many officers handled cases with the status [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,329,count,1
987,How many incidents featured Safari model cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Safari"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Safari
How many incidents featured Safari model cars?",How many incidents featured [x1.Vehicle.model:Safari] model cars?,x1.Vehicle.model:Safari = Safari,2,128,count,1
4522,When was the earliest crime at 19 Lily Avenue that was probed by Officer Havill?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""19 Lily Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Havill"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 19 Lily Avenue
[Officer] = Havill
When was the earliest crime at 19 Lily Avenue that was probed by Officer Havill?",When was the earliest crime at [x1.Location.address:19 Lily Avenue] that was probed by Officer [x2.Officer.surname:Havill]?,"x1.Location.address:19 Lily Avenue = 19 Lily Avenue
x2.Officer.surname:Havill = Havill",3,48,argmin,1
299,Can you provide a list of burglaries at 111 Colchester Close?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""111 Colchester Close"")
RETURN x0","[Crime] = Burglary
[Location] = 111 Colchester Close
Can you provide a list of burglaries at 111 Colchester Close?",Can you provide a list of [x0.Crime.type:Burglary] at [x1.Location.address:111 Colchester Close]?,"x0.Crime.type:Burglary = burglaries 
x1.Location.address:111 Colchester Close = 111 Colchester Close",2,37,entity_set,1
4459,Can you update me on the processing of the initial crime involving a person whose phone number matches the NHS number 800-46-2184?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""800-46-2184"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 800-46-2184
Can you update me on the processing of the initial crime involving a person whose phone number matches the NHS number 800-46-2184?",Can you update me on the processing of the initial crime involving a person whose phone number matches the NHS number [x2.Person.nhs_no:800-46-2184]?,x2.Person.nhs_no:800-46-2184 = 800-46-2184,3,32,argmin,1
732,How many incidents on 25/08/2017 include anyone named Diana?,"MATCH (x0:Crime WHERE x0.date = ""25/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Diana"")
RETURN COUNT(DISTINCT x0)","[Crime] = 25/08/2017
[Person] = Diana
How many incidents on 25/08/2017 include anyone named Diana?",How many incidents on [x0.Crime.date:25/08/2017] include anyone named [x1.Person.name:Diana]?,"x0.Crime.date:25/08/2017 = 25/08/2017
x1.Person.name:Diana = Diana",2,97,count,1
1281,Who is the eldest person whose contact is known by someone named Carlos with the phone number 8-(555)485-3508?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Carlos"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""8-(555)485-3508"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Carlos
[Phone] = 8-(555)485-3508
Who is the eldest person whose contact is known by someone named Carlos with the phone number 8-(555)485-3508?",Who is the eldest person whose contact is known by someone named [x1.Person.name:Carlos] with the phone number [x2.Phone.phoneNo:8-(555)485-3508]?,"x1.Person.name:Carlos = Carlos
x2.Phone.phoneNo:8-(555)485-3508 = 8-(555)485-3508",3,170,max,1
2733,Who is the oldest family member connected to a friend of a Boyd?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Boyd"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Boyd
Who is the oldest family member connected to a friend of a Boyd?",Who is the oldest family member connected to a friend of a [x2.Person.surname:Boyd]?,x2.Person.surname:Boyd = Boyd,3,396,max,1
2380,What area is linked to the address Petrol Station?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0","[Location] = Petrol Station
What area is linked to the address Petrol Station?",What area is linked to the address [x1.Location.address:Petrol Station]?,x1.Location.address:Petrol Station = Petrol Station,2,328,entity_set,124
750,Which locations have the postcode OL10 2JL and are home to anyone named Raymond?,"MATCH (x0:Location WHERE x0.postcode = ""OL10 2JL"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Raymond"")
RETURN x0","[Location] = OL10 2JL
[Person] = Raymond
Which locations have the postcode OL10 2JL and are home to anyone named Raymond?",Which locations have the postcode [x0.Location.postcode:OL10 2JL] and are home to anyone named [x1.Person.name:Raymond]?,"x0.Location.postcode:OL10 2JL = OL10 2JL
x1.Person.name:Raymond = Raymond",2,99,entity_set,1
1379,What is the total number of calls received at 2-(980)215-3814?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""2-(980)215-3814"")
RETURN COUNT(DISTINCT x0)","[Phone] = 2-(980)215-3814
What is the total number of calls received at 2-(980)215-3814?",What is the total number of calls received at [x1.Phone.phoneNo:2-(980)215-3814]?,x1.Phone.phoneNo:2-(980)215-3814 = 2-(980)215-3814,2,181,count,1
1788,"Among those living with the Porters, who is the oldest?","MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Porter"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Porter
Among those living with the Porters, who is the oldest?","Among those living with the [x1.Person.surname:Porter], who is the oldest?",x1.Person.surname:Porter = Porters,2,237,max,1
1843,How many places with the postcode WN6 7HD are linked to violence and sexual offence crimes?,"MATCH (x0:Location WHERE x0.postcode = ""WN6 7HD"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = WN6 7HD
[Crime] = Violence and sexual offences
How many places with the postcode WN6 7HD are linked to violence and sexual offence crimes?",How many places with the postcode [x0.Location.postcode:WN6 7HD] are linked to [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:WN6 7HD = WN6 7HD
x1.Crime.type:Violence and sexual offences = violence and sexual offence crimes",2,246,count,1
653,How many criminal incidents took place in places identified by postcode WN4 9AH?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WN4 9AH"")
RETURN COUNT(DISTINCT x0)","[Location] = WN4 9AH
How many criminal incidents took place in places identified by postcode WN4 9AH?",How many criminal incidents took place in places identified by postcode [x1.Location.postcode:WN4 9AH]?,x1.Location.postcode:WN4 9AH = WN4 9AH,2,87,count,1
610,"How many officers looked into crimes on August 26, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 26/08/2017
How many officers looked into crimes on August 26, 2017?",How many officers looked into crimes on [x1.Crime.date:26/08/2017]?,"x1.Crime.date:26/08/2017 = August 26, 2017",2,80,count,1
4445,What are the email addresses of someone who resides with a person named Phillip?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0.email_address","[Person] = Phillip
What are the email addresses of someone who resides with a person named Phillip?",What are the email addresses of someone who resides with a person named [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,29,attribute_set,7
692,Can you name everyone acquainted with a Russell?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Russell"")
RETURN x0.name","[Person] = Russell
Can you name everyone acquainted with a Russell?",Can you name everyone acquainted with a [x1.Person.surname:Russell]?,x1.Person.surname:Russell = Russell,2,92,attribute_set,5
4454,What's the status of the first crime involving someone with the phone number of the person whose NHS number is 576-99-9244?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""576-99-9244"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 576-99-9244
What's the status of the first crime involving someone with the phone number of the person whose NHS number is 576-99-9244?",What's the status of the first crime involving someone with the phone number of the person whose NHS number is [x2.Person.nhs_no:576-99-9244]?,x2.Person.nhs_no:576-99-9244 = 576-99-9244,3,32,argmin,1
274,What crimes happened at 29 Scoltock Way?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""29 Scoltock Way"")
RETURN x0","[Location] = 29 Scoltock Way
What crimes happened at 29 Scoltock Way?",What crimes happened at [x1.Location.address:29 Scoltock Way]?,x1.Location.address:29 Scoltock Way = 29 Scoltock Way,2,33,entity_set,4
1523,How many locations with post code M9 0RF had crime scenes on 13/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""M9 0RF"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Location] = M9 0RF
[Crime] = 13/08/2017
How many locations with post code M9 0RF had crime scenes on 13/08/2017?",How many locations with post code [x0.Location.postcode:M9 0RF] had crime scenes on [x1.Crime.date:13/08/2017]?,"x0.Location.postcode:M9 0RF = M9 0RF
x1.Crime.date:13/08/2017 = 13/08/2017",2,202,count,1
1954,How many Accent model cars are associated with crimes?,"MATCH (x0:Vehicle WHERE x0.model = ""Accent"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Accent
How many Accent model cars are associated with crimes?",How many [x0.Vehicle.model:Accent] model cars are associated with crimes?,x0.Vehicle.model:Accent = Accent,2,260,count,1
734,"On 13th August 2017, how many crimes involve people called Carlos?","MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Carlos"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
[Person] = Carlos
On 13th August 2017, how many crimes involve people called Carlos?","On [x0.Crime.date:13/08/2017], how many crimes involve people called [x1.Person.name:Carlos]?","x0.Crime.date:13/08/2017 = 13th August 2017 
x1.Person.name:Carlos = Carlos",2,97,count,1
2128,Who are the people cohabiting with others?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)
RETURN x0",Who are the people cohabiting with others?,Who are the people cohabiting with others?,,2,287,entity_set,160
