id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2291,When was the most recent crime at 129 Rock Terrace involving anyone surnamed Patterson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Patterson"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""129 Rock Terrace"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Patterson
[Location] = 129 Rock Terrace
When was the most recent crime at 129 Rock Terrace involving anyone surnamed Patterson?",When was the most recent crime at [x1.Location.address:129 Rock Terrace] involving anyone surnamed [x2.Person.surname:Patterson]?,"x1.Location.address:129 Rock Terrace = 129 Rock Terrace
x2.Person.surname:Patterson = Patterson",3,309,argmax,1
508,How many crimes marked as Unable to prosecute suspect happened in a location with post code SK3 8NP?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK3 8NP"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = SK3 8NP
How many crimes marked as Unable to prosecute suspect happened in a location with post code SK3 8NP?",How many crimes marked as [x0.Crime.last_outcome:Unable to prosecute suspect] happened in a location with post code [x1.Location.postcode:SK3 8NP]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.postcode:SK3 8NP = SK3 8NP",2,67,count,1
1604,How many phones got a 13-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""13"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 13
How many phones got a 13-second call?",How many phones got a [x1.PhoneCall.call_duration:13]-second call?,x1.PhoneCall.call_duration:13 = 13,2,212,count,1
29,How many public order crimes are investigated by officers named Gay?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Gay"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = Gay
How many public order crimes are investigated by officers named Gay?",How many [x0.Crime.type:Public order] crimes are investigated by officers named [x1.Officer.name:Gay]?,"x0.Crime.type:Public order = public order
x1.Officer.name:Gay = Gay",2,4,count,1
424,What are the residence of people with surname Lawrence in locations with WA14 1NG postcode?,"MATCH (x0:Location WHERE x0.postcode = ""WA14 1NG"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Location] = WA14 1NG
[Person] = Lawrence
What are the residence of people with surname Lawrence in locations with WA14 1NG postcode?",What are the residence of people with surname [x1.Person.surname:Lawrence] in locations with [x0.Location.postcode:WA14 1NG] postcode?,"x0.Location.postcode:WA14 1NG = WA14 1NG
x1.Person.surname:Lawrence = Lawrence",2,55,entity_set,1
2498,What is the number of postcodes in the M32 area code?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M32"")
RETURN COUNT(DISTINCT x0)","[Area] = M32
What is the number of postcodes in the M32 area code?",What is the number of postcodes in the [x1.Area.areaCode:M32] area code?,x1.Area.areaCode:M32 = M32,2,348,count,1
351,How often do crimes involve people whose last name is Robinson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robinson"")
RETURN COUNT(DISTINCT x0)","[Person] = Robinson
How often do crimes involve people whose last name is Robinson?",How often do crimes involve people whose last name is [x1.Person.surname:Robinson]?,x1.Person.surname:Robinson = Robinson,2,44,count,1
2555,Which is the earliest crime involving an F150 and someone with last name Kelly?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Kelly"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""F150"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Kelly
[Vehicle] = F150
Which is the earliest crime involving an F150 and someone with last name Kelly?",Which is the earliest crime involving an [x1.Vehicle.model:F150] and someone with last name [x2.Person.surname:Kelly]?,"x1.Vehicle.model:F150 = F150
x2.Person.surname:Kelly = Kelly",3,358,min,1
2158,How many public order violations does officer 05-3036001 investigate?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""05-3036001"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = 05-3036001
How many public order violations does officer 05-3036001 investigate?",How many [x0.Crime.type:Public order] violations does officer [x1.Officer.badge_no:05-3036001] investigate?,"x0.Crime.type:Public order = public order
x1.Officer.badge_no:05-3036001 = 05-3036001",2,292,count,1
2338,How many 'Other theft' offenses are probed by officers whose last name is Iddison?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Iddison"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
[Officer] = Iddison
How many 'Other theft' offenses are probed by officers whose last name is Iddison?",How many '[x0.Crime.type:Other theft]' offenses are probed by officers whose last name is [x1.Officer.surname:Iddison]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Iddison = Iddison",2,318,count,1
948,What is the total number of calls received by any phone on 30/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""30/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 30/08/2017
What is the total number of calls received by any phone on 30/08/2017?",What is the total number of calls received by any phone on [x0.PhoneCall.call_date:30/08/2017]?,x0.PhoneCall.call_date:30/08/2017 = 30/08/2017,2,124,count,1
4462,Can you update me on the progress of the initial crime case involving a person with the phone number of the individual with NHS number 383-09-0127?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""383-09-0127"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 383-09-0127
Can you update me on the progress of the initial crime case involving a person with the phone number of the individual with NHS number 383-09-0127?",Can you update me on the progress of the initial crime case involving a person with the phone number of the individual with NHS number [x2.Person.nhs_no:383-09-0127]?,x2.Person.nhs_no:383-09-0127 = 383-09-0127,3,32,argmin,1
2257,Can you provide the places where crimes took place on 4/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Crime] = 4/08/2017
Can you provide the places where crimes took place on 4/08/2017?",Can you provide the places where crimes took place on [x1.Crime.date:4/08/2017]?,x1.Crime.date:4/08/2017 = 4/08/2017,2,304,entity_set,976
3200,What are the last names of people tied to crimes at the location BL1 6RN?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 6RN"")
RETURN x0.surname","[Location] = BL1 6RN
What are the last names of people tied to crimes at the location BL1 6RN?",What are the last names of people tied to crimes at the location [x2.Location.postcode:BL1 6RN]?,x2.Location.postcode:BL1 6RN = BL1 6RN,3,21,attribute_set,1
194,How many 91-second calls were made to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""91"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 91
How many 91-second calls were made to any phone?",How many [x0.PhoneCall.call_duration:91]-second calls were made to any phone?,x0.PhoneCall.call_duration:91 = 91,2,23,count,1
1790,Who is the eldest individual residing with the Murrays?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Murray
Who is the eldest individual residing with the Murrays?",Who is the eldest individual residing with the [x1.Person.surname:Murray]?,x1.Person.surname:Murray = Murrays,2,237,max,1
4644,Where are the locations of crimes investigated by Officer Tollerton?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Tollerton"")
RETURN x0.address","[Officer] = Tollerton
Where are the locations of crimes investigated by Officer Tollerton?",Where are the locations of crimes investigated by Officer [x2.Officer.surname:Tollerton]?,x2.Officer.surname:Tollerton = Tollerton,3,93,attribute_set,38
431,Who are the Police Constables involved in cases labeled 'Investigation complete; no suspect identified'?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Officer] = Police Constable
[Crime] = Investigation complete; no suspect identified
Who are the Police Constables involved in cases labeled 'Investigation complete; no suspect identified'?",Who are the [x0.Officer.rank:Police Constable] involved in cases labeled '[x1.Crime.last_outcome:Investigation complete; no suspect identified]'?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",2,57,entity_set,6413
4380,Can you provide the types of crimes from 7/08/2017 that involved a friend of the individual with NHS number 804-54-6976?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""804-54-6976"")
RETURN x0.type","[Crime] = 7/08/2017
[Person] = 804-54-6976
Can you provide the types of crimes from 7/08/2017 that involved a friend of the individual with NHS number 804-54-6976?",Can you provide the types of crimes from [x0.Crime.date:7/08/2017] that involved a friend of the individual with NHS number [x2.Person.nhs_no:804-54-6976]?,"x0.Crime.date:7/08/2017 = 7/08/2017
x2.Person.nhs_no:804-54-6976 = 804-54-6976",3,1,attribute_set,2
2415,What phones placed calls on 26/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""26/08/2017"")
RETURN x0","[PhoneCall] = 26/08/2017
What phones placed calls on 26/08/2017?",What phones placed calls on [x1.PhoneCall.call_date:26/08/2017]?,x1.PhoneCall.call_date:26/08/2017 = 26/08/2017,2,333,entity_set,26
1879,Which individuals named Emily have a family relation to individuals bearing the last name Day?,"MATCH (x0:Person WHERE x0.name = ""Emily"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Day"")
RETURN x0","[Person] = Emily
[Person] = Day
Which individuals named Emily have a family relation to individuals bearing the last name Day?",Which individuals named [x0.Person.name:Emily] have a family relation to individuals bearing the last name [x1.Person.surname:Day]?,"x0.Person.name:Emily = Emily
x1.Person.surname:Day = Day",2,251,entity_set,1
3044,"What's the latest incident involving offenders from August 19, 2017?","MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""19/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 19/08/2017
What's the latest incident involving offenders from August 19, 2017?",What's the latest incident involving offenders from [x2.Crime.date:19/08/2017]?,"x2.Crime.date:19/08/2017 = August 19, 2017",3,444,max,1
2441,How many places are in the M6 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN COUNT(DISTINCT x0)","[Area] = M6
How many places are in the M6 area code?",How many places are in the [x1.Area.areaCode:M6] area code?,x1.Area.areaCode:M6 = M6,2,337,count,1
601,"What is the total number of calls made to any phone on August 19, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""19/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19/08/2017
What is the total number of calls made to any phone on August 19, 2017?",What is the total number of calls made to any phone on [x0.PhoneCall.call_date:19/08/2017]?,"x0.PhoneCall.call_date:19/08/2017 = August 19, 2017",2,79,count,1
789,"Can you identify the oldest vehicle associated with a crime, where the investigation is complete with no suspect found, involving a Williamson?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Williamson"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Williamson
Can you identify the oldest vehicle associated with a crime, where the investigation is complete with no suspect found, involving a Williamson?","Can you identify the oldest vehicle associated with a crime, where the [x1.Crime.last_outcome:Investigation complete; no suspect identified], involving a [x2.Person.surname:Williamson]?","x1.Crime.last_outcome:Investigation complete; no suspect identified = investigation is complete with no suspect found 
x2.Person.surname:Williamson = Williamson",3,103,max,1
2100,Can you show me calls to 9-(016)868-6919 that lasted 10 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""10"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(016)868-6919"")
RETURN x0","[PhoneCall] = 10
[Phone] = 9-(016)868-6919
Can you show me calls to 9-(016)868-6919 that lasted 10 seconds?",Can you show me calls to [x1.Phone.phoneNo:9-(016)868-6919] that lasted [x0.PhoneCall.call_duration:10] seconds?,"x0.PhoneCall.call_duration:10 = 10
x1.Phone.phoneNo:9-(016)868-6919 = 9-(016)868-6919",2,283,entity_set,2
510,How many incidents labeled Unable to prosecute suspect took place at the location with post code SK3 8NP?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK3 8NP"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = SK3 8NP
How many incidents labeled Unable to prosecute suspect took place at the location with post code SK3 8NP?",How many incidents labeled [x0.Crime.last_outcome:Unable to prosecute suspect] took place at the location with post code [x1.Location.postcode:SK3 8NP]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.postcode:SK3 8NP = SK3 8NP",2,67,count,1
1158,How many individuals named Bonnie are familiar with someone named Rachel?,"MATCH (x0:Person WHERE x0.name = ""Bonnie"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Rachel"")
RETURN COUNT(DISTINCT x0)","[Person] = Bonnie
[Person] = Rachel
How many individuals named Bonnie are familiar with someone named Rachel?",How many individuals named [x0.Person.name:Bonnie] are familiar with someone named [x1.Person.name:Rachel]?,"x0.Person.name:Bonnie = Bonnie
x1.Person.name:Rachel = Rachel",2,153,count,1
3337,Which individuals reside in the M14 region?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M14"")
RETURN x0","[Area] = M14
Which individuals reside in the M14 region?",Which individuals reside in the [x2.Area.areaCode:M14] region?,x2.Area.areaCode:M14 = M14,3,43,entity_set,9
3440,Who lives with a person linked to a crime?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Who lives with a person linked to a crime?,Who lives with a person linked to a crime?,,3,67,entity_set,46
2911,What was the first incident at 199 Ogden Lane with a vehicle from Echo?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""199 Ogden Lane"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Echo"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 199 Ogden Lane
[Vehicle] = Echo
What was the first incident at 199 Ogden Lane with a vehicle from Echo?",What was the first incident at [x2.Location.address:199 Ogden Lane] with a vehicle from [x1.Vehicle.model:Echo]?,"x1.Vehicle.model:Echo = Echo
x2.Location.address:199 Ogden Lane = 199 Ogden Lane",3,422,min,1
443,What is the email count for individuals with the surname Cooper?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Cooper"")
RETURN COUNT(DISTINCT x0)","[Person] = Cooper
What is the email count for individuals with the surname Cooper?",What is the email count for individuals with the surname [x1.Person.surname:Cooper]?,x1.Person.surname:Cooper = Cooper,2,58,count,1
3319,Which are the last names of people that live in regions experiencing criminal damage and arson incidents?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Criminal damage and arson"")
RETURN x0.surname","[Crime] = Criminal damage and arson
Which are the last names of people that live in regions experiencing criminal damage and arson incidents?",Which are the last names of people that live in regions experiencing [x2.Crime.type:Criminal damage and arson] incidents?,x2.Crime.type:Criminal damage and arson = criminal damage and arson,3,41,attribute_set,102
1576,Which offenses took place in locations identified by the postcode WA15 9DZ?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WA15 9DZ"")
RETURN x0","[Location] = WA15 9DZ
Which offenses took place in locations identified by the postcode WA15 9DZ?",Which offenses took place in locations identified by the postcode [x1.Location.postcode:WA15 9DZ]?,x1.Location.postcode:WA15 9DZ = WA15 9DZ,2,209,entity_set,1
2758,"How many emails are there for Eric, who has a family tie to a Jackson?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Eric"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Jackson"")
RETURN COUNT(DISTINCT x0)","[Person] = Eric
[Person] = Jackson
How many emails are there for Eric, who has a family tie to a Jackson?","How many emails are there for [x1.Person.name:Eric], who has a family tie to a [x2.Person.surname:Jackson]?","x1.Person.name:Eric = Eric
x2.Person.surname:Jackson = Jackson",3,400,count,1
3476,What are the last names of those who have the phone numbers of people connected to someone with NHS number 272-95-2412?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""272-95-2412"")
RETURN x0.surname","[Person] = 272-95-2412
What are the last names of those who have the phone numbers of people connected to someone with NHS number 272-95-2412?",What are the last names of those who have the phone numbers of people connected to someone with NHS number [x2.Person.nhs_no:272-95-2412]?,x2.Person.nhs_no:272-95-2412 = 272-95-2412,3,83,attribute_set,3
842,What's the age of the youngest individual residing with a Baker?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Baker"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Baker
What's the age of the youngest individual residing with a Baker?",What's the age of the youngest individual residing with a [x1.Person.surname:Baker]?,x1.Person.surname:Baker = Baker,2,111,argmin,1
2499,How many postal codes exist within the M32 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M32"")
RETURN COUNT(DISTINCT x0)","[Area] = M32
How many postal codes exist within the M32 area?",How many postal codes exist within the [x1.Area.areaCode:M32] area?,x1.Area.areaCode:M32 = M32,2,348,count,1
1082,What number of crimes on 2/08/2017 included Suzuki vehicles?,"MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Suzuki"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Vehicle] = Suzuki
What number of crimes on 2/08/2017 included Suzuki vehicles?",What number of crimes on [x0.Crime.date:2/08/2017] included [x1.Vehicle.make:Suzuki] vehicles?,"x0.Crime.date:2/08/2017 = 2/08/2017
x1.Vehicle.make:Suzuki = Suzuki",2,143,count,1
3019,What is the date of the most recent crime at residences of those with the surname Bennett?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Bennett"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Bennett
What is the date of the most recent crime at residences of those with the surname Bennett?",What is the date of the most recent crime at residences of those with the surname [x2.Person.surname:Bennett]?,x2.Person.surname:Bennett = Bennett,3,439,argmax,1
279,How many shoplifting offenses are looked into by officers ranked as Police Constables?,"MATCH (x0:Crime WHERE x0.type = ""Shoplifting"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Shoplifting
[Officer] = Police Constable
How many shoplifting offenses are looked into by officers ranked as Police Constables?",How many [x0.Crime.type:Shoplifting] offenses are looked into by officers ranked as [x1.Officer.rank:Police Constable]?,"x0.Crime.type:Shoplifting = shoplifting
x1.Officer.rank:Police Constable = Police Constables",2,34,count,1
868,How many individuals does someone with surname Garcia know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Garcia"")
RETURN COUNT(DISTINCT x0)","[Person] = Garcia
How many individuals does someone with surname Garcia know?",How many individuals does someone with surname [x1.Person.surname:Garcia] know?,x1.Person.surname:Garcia = Garcia,2,114,count,1
3673,Which NHS numbers belong to those related with a person residing in OL12 6TA postcode locations?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL12 6TA"")
RETURN x0.nhs_no","[Location] = OL12 6TA
Which NHS numbers belong to those related with a person residing in OL12 6TA postcode locations?",Which NHS numbers belong to those related with a person residing in [x2.Location.postcode:OL12 6TA] postcode locations?,x2.Location.postcode:OL12 6TA = OL12 6TA,3,172,attribute_set,2
2873,Do you know the emails of Arthur's friends?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Arthur"")
RETURN x0","[Person] = Arthur
Do you know the emails of Arthur's friends?",Do you know the emails of [x2.Person.name:Arthur]'s friends?,x2.Person.name:Arthur = Arthur,3,417,entity_set,8
3241,Which individuals are friends with people who have roommates?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0",Which individuals are friends with people who have roommates?,Which individuals are friends with people who have roommates?,,3,29,entity_set,206
4538,Who are the individuals acquainted with a friend of the person holding NHS number 298-36-6290?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""298-36-6290"")
RETURN x0","[Person] = 298-36-6290
Who are the individuals acquainted with a friend of the person holding NHS number 298-36-6290?",Who are the individuals acquainted with a friend of the person holding NHS number [x2.Person.nhs_no:298-36-6290]?,x2.Person.nhs_no:298-36-6290 = 298-36-6290,3,54,entity_set,10
2247,"Can you provide a list of 1994 vehicles tied to crimes marked as ""Investigation complete; no suspect identified""?","MATCH (x0:Vehicle WHERE x0.year = ""1994"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Vehicle] = 1994
[Crime] = Investigation complete; no suspect identified
Can you provide a list of 1994 vehicles tied to crimes marked as ""Investigation complete; no suspect identified""?","Can you provide a list of [x0.Vehicle.year:1994] vehicles tied to crimes marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?","x0.Vehicle.year:1994 = 1994
x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",2,303,entity_set,21
588,Could you list the times for calls to 1-(060)256-9720?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(060)256-9720"")
RETURN x0.call_time","[Phone] = 1-(060)256-9720
Could you list the times for calls to 1-(060)256-9720?",Could you list the times for calls to [x1.Phone.phoneNo:1-(060)256-9720]?,x1.Phone.phoneNo:1-(060)256-9720 = 1-(060)256-9720,2,77,attribute_set,2
1096,What is the total number of calls to 3-(965)714-5374?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(965)714-5374"")
RETURN COUNT(DISTINCT x0)","[Phone] = 3-(965)714-5374
What is the total number of calls to 3-(965)714-5374?",What is the total number of calls to [x1.Phone.phoneNo:3-(965)714-5374]?,x1.Phone.phoneNo:3-(965)714-5374 = 3-(965)714-5374,2,145,count,1
600,"On 09/08/2017, how many phone calls were received by any phone?","MATCH (x0:PhoneCall WHERE x0.call_date = ""09/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 09/08/2017
On 09/08/2017, how many phone calls were received by any phone?","On [x0.PhoneCall.call_date:09/08/2017], how many phone calls were received by any phone?",x0.PhoneCall.call_date:09/08/2017 = 09/08/2017,2,79,count,1
4600,Could you list the phones of people who are friend of Brenda?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brenda"")
RETURN x0","[Person] = Brenda
Could you list the phones of people who are friend of Brenda?",Could you list the phones of people who are friend of [x2.Person.name:Brenda]?,x2.Person.name:Brenda = Brenda,3,71,entity_set,8
3182,Can you provide the ranks of officers who looked into crimes involving Touareg models?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Touareg"")
RETURN x0.rank","[Vehicle] = Touareg
Can you provide the ranks of officers who looked into crimes involving Touareg models?",Can you provide the ranks of officers who looked into crimes involving [x2.Vehicle.model:Touareg] models?,x2.Vehicle.model:Touareg = Touareg,3,19,attribute_set,2
1136,What phones dialed out at 14:59?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""14:59"")
RETURN x0","[PhoneCall] = 14:59
What phones dialed out at 14:59?",What phones dialed out at [x1.PhoneCall.call_time:14:59]?,x1.PhoneCall.call_time:14:59 = 14:59,2,151,entity_set,2
1037,What is the number of residences with the postcode SK7 4HY?,"MATCH (x0:Location WHERE x0.postcode = ""SK7 4HY"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = SK7 4HY
What is the number of residences with the postcode SK7 4HY?",What is the number of residences with the postcode [x0.Location.postcode:SK7 4HY]?,x0.Location.postcode:SK7 4HY = SK7 4HY,2,136,count,1
1122,On what date did the earliest crime take place at 122 Gingham Park?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""122 Gingham Park"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 122 Gingham Park
On what date did the earliest crime take place at 122 Gingham Park?",On what date did the earliest crime take place at [x1.Location.address:122 Gingham Park]?,x1.Location.address:122 Gingham Park = 122 Gingham Park,2,149,argmin,1
2954,When was the last Exige vehicle crime investigated by officer 02-6848539?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""02-6848539"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Exige"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 02-6848539
[Vehicle] = Exige
When was the last Exige vehicle crime investigated by officer 02-6848539?",When was the last [x1.Vehicle.model:Exige] vehicle crime investigated by officer [x2.Officer.badge_no:02-6848539]?,"x1.Vehicle.model:Exige = Exige
x2.Officer.badge_no:02-6848539 = 02-6848539",3,429,argmax,1
4540,Which people are connected to a friend of the individual with NHS number 298-36-6290?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""298-36-6290"")
RETURN x0","[Person] = 298-36-6290
Which people are connected to a friend of the individual with NHS number 298-36-6290?",Which people are connected to a friend of the individual with NHS number [x2.Person.nhs_no:298-36-6290]?,x2.Person.nhs_no:298-36-6290 = 298-36-6290,3,54,entity_set,10
927,How many vehicle-related crimes occurred on 20/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
How many vehicle-related crimes occurred on 20/08/2017?",How many vehicle-related crimes occurred on [x0.Crime.date:20/08/2017]?,x0.Crime.date:20/08/2017 = 20/08/2017,2,121,count,1
2421,What is the first crime investigated by officers with surname Stoltz?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Stoltz"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stoltz
What is the first crime investigated by officers with surname Stoltz?",What is the first crime investigated by officers with surname [x1.Officer.surname:Stoltz]?,x1.Officer.surname:Stoltz = Stoltz,2,334,min,1
1114,What are the emails of people acquainted with someone with surname Rice?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Rice"")
RETURN x0","[Person] = Rice
What are the emails of people acquainted with someone with surname Rice?",What are the emails of people acquainted with someone with surname [x2.Person.surname:Rice]?,x2.Person.surname:Rice = Rice,3,147,entity_set,14
3071,Can you identify the phones of those implicated in a crime?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Can you identify the phones of those implicated in a crime?,Can you identify the phones of those implicated in a crime?,,3,4,entity_set,53
751,What are the locations with the postcode SK3 8JL where someone named Dennis lives?,"MATCH (x0:Location WHERE x0.postcode = ""SK3 8JL"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Dennis"")
RETURN x0","[Location] = SK3 8JL
[Person] = Dennis
What are the locations with the postcode SK3 8JL where someone named Dennis lives?",What are the locations with the postcode [x0.Location.postcode:SK3 8JL] where someone named [x1.Person.name:Dennis] lives?,"x0.Location.postcode:SK3 8JL = SK3 8JL
x1.Person.name:Dennis = Dennis",2,99,entity_set,1
652,What is the number of crimes reported in locations with postcode WN4 9AH?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WN4 9AH"")
RETURN COUNT(DISTINCT x0)","[Location] = WN4 9AH
What is the number of crimes reported in locations with postcode WN4 9AH?",What is the number of crimes reported in locations with postcode [x1.Location.postcode:WN4 9AH]?,x1.Location.postcode:WN4 9AH = WN4 9AH,2,87,count,1
505,"Who are the officers who investigated crimes classified as ""Other theft""?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN x0","[Crime] = Other theft
Who are the officers who investigated crimes classified as ""Other theft""?","Who are the officers who investigated crimes classified as ""[x1.Crime.type:Other theft]""?",x1.Crime.type:Other theft = Other theft,2,65,entity_set,2140
3688,Which persons with a phone are implicated in a crime?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
MATCH (x0:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Which persons with a phone are implicated in a crime?,Which persons with a phone are implicated in a crime?,,3,178,entity_set,53
2889,Which is the oldest vehicle linked to a vehicle crime investigated by a Police Constable?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Police Constable"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Vehicle crime
[Officer] = Police Constable
Which is the oldest vehicle linked to a vehicle crime investigated by a Police Constable?",Which is the oldest vehicle linked to a [x1.Crime.type:Vehicle crime] investigated by a [x2.Officer.rank:Police Constable]?,"x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.rank:Police Constable = Police Constable",3,419,max,1
