id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1111,What are the emails of people acquainted with someone with surname Robertson?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Robertson"")
RETURN x0","[Person] = Robertson
What are the emails of people acquainted with someone with surname Robertson?",What are the emails of people acquainted with someone with surname [x2.Person.surname:Robertson]?,x2.Person.surname:Robertson = Robertson,3,147,entity_set,18
597,What's the oldest age of someone acquainted with people surnamed Brooks?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Brooks"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Brooks
What's the oldest age of someone acquainted with people surnamed Brooks?",What's the oldest age of someone acquainted with people surnamed [x1.Person.surname:Brooks]?,x1.Person.surname:Brooks = Brooks,2,78,argmin,1
3644,"Who live with someone named Jessica and is linked to a crime with the status ""Investigation complete; no suspect identified""?","MATCH (x0:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jessica"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Person] = Jessica
[Crime] = Investigation complete; no suspect identified
Who live with someone named Jessica and is linked to a crime with the status ""Investigation complete; no suspect identified""?","Who live with someone named [x2.Person.name:Jessica] and is linked to a crime with the status ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.name:Jessica = Jessica",3,153,entity_set,5
418,What are the residence of people with surname Hughes in locations with SK3 8NA postcode?,"MATCH (x0:Location WHERE x0.postcode = ""SK3 8NA"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Hughes"")
RETURN x0","[Location] = SK3 8NA
[Person] = Hughes
What are the residence of people with surname Hughes in locations with SK3 8NA postcode?",What are the residence of people with surname [x1.Person.surname:Hughes] in locations with [x0.Location.postcode:SK3 8NA] postcode?,"x0.Location.postcode:SK3 8NA = SK3 8NA
x1.Person.surname:Hughes = Hughes",2,55,entity_set,1
1042,How many Christophers share a home with Amys?,"MATCH (x0:Person WHERE x0.name = ""Christopher"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Amy
How many Christophers share a home with Amys?",How many [x0.Person.name:Christopher] share a home with [x1.Person.name:Amy]?,"x0.Person.name:Christopher = Christophers
x1.Person.name:Amy = Amys",2,138,count,1
152,What crimes occurred on 3/08/2017 that Officer Porty is investigating?,"MATCH (x0:Crime WHERE x0.date = ""3/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Porty"")
RETURN x0","[Crime] = 3/08/2017
[Officer] = Porty
What crimes occurred on 3/08/2017 that Officer Porty is investigating?",What crimes occurred on [x0.Crime.date:3/08/2017] that Officer [x1.Officer.name:Porty] is investigating?,"x0.Crime.date:3/08/2017 = 3/08/2017
x1.Officer.name:Porty = Porty",2,18,entity_set,4
2557,Which crime involving an F150 and a person with last name Kelly happened first?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Kelly"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""F150"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Kelly
[Vehicle] = F150
Which crime involving an F150 and a person with last name Kelly happened first?",Which crime involving an [x1.Vehicle.model:F150] and a person with last name [x2.Person.surname:Kelly] happened first?,"x1.Vehicle.model:F150 = F150
x2.Person.surname:Kelly = Kelly",3,358,min,1
2616,What is the number of crimes an officer investigates?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)",What is the number of crimes an officer investigates?,What is the number of crimes an officer investigates?,,2,375,count,1
444,How many emails belong to people whose last name is Cooper?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Cooper"")
RETURN COUNT(DISTINCT x0)","[Person] = Cooper
How many emails belong to people whose last name is Cooper?",How many emails belong to people whose last name is [x1.Person.surname:Cooper]?,x1.Person.surname:Cooper = Cooper,2,58,count,1
800,Can you provide the badge numbers of officers involved in investigations on 26th August 2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0.badge_no","[Crime] = 26/08/2017
Can you provide the badge numbers of officers involved in investigations on 26th August 2017?",Can you provide the badge numbers of officers involved in investigations on [x1.Crime.date:26/08/2017]?,x1.Crime.date:26/08/2017 = 26th August 2017,2,106,attribute_set,903
1861,How many phones are possessed by those whose last name is Rose?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Rose"")
RETURN COUNT(DISTINCT x0)","[Person] = Rose
How many phones are possessed by those whose last name is Rose?",How many phones are possessed by those whose last name is [x1.Person.surname:Rose]?,x1.Person.surname:Rose = Rose,2,249,count,1
649,Who is the eldest family member of someone who knows a Ruiz's phone number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Ruiz"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Ruiz
Who is the eldest family member of someone who knows a Ruiz's phone number?",Who is the eldest family member of someone who knows a [x2.Person.surname:Ruiz]'s phone number?,x2.Person.surname:Ruiz = Ruiz,3,86,max,1
472,What are all the calls received by the number 8-(657)218-7659?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(657)218-7659"")
RETURN x0","[Phone] = 8-(657)218-7659
What are all the calls received by the number 8-(657)218-7659?",What are all the calls received by the number [x1.Phone.phoneNo:8-(657)218-7659]?,x1.Phone.phoneNo:8-(657)218-7659 = 8-(657)218-7659,2,62,entity_set,2
540,How often were Kia vehicles part of crimes?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Kia"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Kia
How often were Kia vehicles part of crimes?",How often were [x1.Vehicle.make:Kia] vehicles part of crimes?,x1.Vehicle.make:Kia = Kia,2,70,count,1
3114,Which calls to a phone that got a call at 00:32 have the earliest date?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""00:32"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 00:32
Which calls to a phone that got a call at 00:32 have the earliest date?",Which calls to a phone that got a call at [x2.PhoneCall.call_time:00:32] have the earliest date?,x2.PhoneCall.call_time:00:32 = 00:32,3,10,min,1
3506,What are the postal codes for where the friends of the person with NHS number 692-42-9948 live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""692-42-9948"")
RETURN x0.postcode","[Person] = 692-42-9948
What are the postal codes for where the friends of the person with NHS number 692-42-9948 live?",What are the postal codes for where the friends of the person with NHS number [x2.Person.nhs_no:692-42-9948] live?,x2.Person.nhs_no:692-42-9948 = 692-42-9948,3,104,attribute_set,7
2234,"How many offenses on August 24, 2017, include individuals with NHS number 335-71-7747?","MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""335-71-7747"")
RETURN COUNT(DISTINCT x0)","[Crime] = 24/08/2017
[Person] = 335-71-7747
How many offenses on August 24, 2017, include individuals with NHS number 335-71-7747?","How many offenses on [x0.Crime.date:24/08/2017], include individuals with NHS number [x1.Person.nhs_no:335-71-7747]?","x0.Crime.date:24/08/2017 = August 24, 2017 
x1.Person.nhs_no:335-71-7747 = 335-71-7747",2,301,count,1
2960,"When was the latest crime with a Sonata, handled by officer 16-2620347, reported?","MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""16-2620347"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Sonata"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 16-2620347
[Vehicle] = Sonata
When was the latest crime with a Sonata, handled by officer 16-2620347, reported?","When was the latest crime with a [x1.Vehicle.model:Sonata], handled by officer [x2.Officer.badge_no:16-2620347], reported?","x1.Vehicle.model:Sonata = Sonata
x2.Officer.badge_no:16-2620347 = 16-2620347",3,429,argmax,1
1360,"Which vehicles from 2011 were linked to a crime on August 20, 2017?","MATCH (x0:Vehicle WHERE x0.year = ""2011"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Vehicle] = 2011
[Crime] = 20/08/2017
Which vehicles from 2011 were linked to a crime on August 20, 2017?",Which vehicles from [x0.Vehicle.year:2011] were linked to a crime on [x1.Crime.date:20/08/2017]?,"x0.Vehicle.year:2011 = 2011
x1.Crime.date:20/08/2017 = August 20, 2017",2,179,entity_set,1
238,"What calls were made to 6-(513)403-4733 on August 15, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""15/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(513)403-4733"")
RETURN x0","[PhoneCall] = 15/08/2017
[Phone] = 6-(513)403-4733
What calls were made to 6-(513)403-4733 on August 15, 2017?",What calls were made to [x1.Phone.phoneNo:6-(513)403-4733] on [x0.PhoneCall.call_date:15/08/2017]?,"x0.PhoneCall.call_date:15/08/2017 = August 15, 2017 
x1.Phone.phoneNo:6-(513)403-4733 = 6-(513)403-4733",2,29,entity_set,1
1606,How many phones took a call for 13 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""13"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 13
How many phones took a call for 13 seconds?",How many phones took a call for [x1.PhoneCall.call_duration:13] seconds?,x1.PhoneCall.call_duration:13 = 13,2,212,count,1
2814,How many emails are from people named Carlos who were implicated in a crime on 13/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Carlos"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Carlos
[Crime] = 13/08/2017
How many emails are from people named Carlos who were implicated in a crime on 13/08/2017?",How many emails are from people named [x1.Person.name:Carlos] who were implicated in a crime on [x2.Crime.date:13/08/2017]?,"x1.Person.name:Carlos = Carlos
x2.Crime.date:13/08/2017 = 13/08/2017",3,409,count,1
3070,Which phones are associated with people connected to a crime?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Which phones are associated with people connected to a crime?,Which phones are associated with people connected to a crime?,,3,4,entity_set,53
580,What are the call times for calls made to the number 4-(974)681-7909?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(974)681-7909"")
RETURN x0.call_time","[Phone] = 4-(974)681-7909
What are the call times for calls made to the number 4-(974)681-7909?",What are the call times for calls made to the number [x1.Phone.phoneNo:4-(974)681-7909]?,x1.Phone.phoneNo:4-(974)681-7909 = 4-(974)681-7909,2,77,attribute_set,2
3623,What are the last names of friends of individuals linked to a Robbery crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Robbery"")
RETURN x0.surname","[Crime] = Robbery
What are the last names of friends of individuals linked to a Robbery crime?",What are the last names of friends of individuals linked to a [x2.Crime.type:Robbery] crime?,x2.Crime.type:Robbery = Robbery,3,148,attribute_set,5
3242,Can you identify friends of individuals who share their homes with others?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0",Can you identify friends of individuals who share their homes with others?,Can you identify friends of individuals who share their homes with others?,,3,29,entity_set,206
4372,When was the latest crime involving a person who shares a home with someone named Jessica?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jessica"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Jessica
When was the latest crime involving a person who shares a home with someone named Jessica?",When was the latest crime involving a person who shares a home with someone named [x2.Person.name:Jessica]?,x2.Person.name:Jessica = Jessica,3,0,argmax,1
502,Who are the officers that investigated violence and sexual offences?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Crime] = Violence and sexual offences
Who are the officers that investigated violence and sexual offences?",Who are the officers that investigated [x1.Crime.type:Violence and sexual offences]?,x1.Crime.type:Violence and sexual offences = violence and sexual offences,2,65,entity_set,8765
34,How many burglary offenses are looked into by officers named Catherin?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Catherin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = Catherin
How many burglary offenses are looked into by officers named Catherin?",How many [x0.Crime.type:Burglary] offenses are looked into by officers named [x1.Officer.name:Catherin]?,"x0.Crime.type:Burglary = burglary
x1.Officer.name:Catherin = Catherin",2,4,count,1
1344,What Hyundai models were implicated in crimes on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Hyundai"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN x0","[Vehicle] = Hyundai
[Crime] = 11/08/2017
What Hyundai models were implicated in crimes on 11/08/2017?",What [x0.Vehicle.make:Hyundai] models were implicated in crimes on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.make:Hyundai = Hyundai
x1.Crime.date:11/08/2017 = 11/08/2017",2,177,entity_set,2
2695,What are the areas where those with the last name White are found?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""White"")
RETURN x0","[Person] = White
What are the areas where those with the last name White are found?",What are the areas where those with the last name [x2.Person.surname:White] are found?,x2.Person.surname:White = White,3,389,entity_set,2
4539,Can you identify everyone who knows someone who is friends with the person having NHS number 298-36-6290?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""298-36-6290"")
RETURN x0","[Person] = 298-36-6290
Can you identify everyone who knows someone who is friends with the person having NHS number 298-36-6290?",Can you identify everyone who knows someone who is friends with the person having NHS number [x2.Person.nhs_no:298-36-6290]?,x2.Person.nhs_no:298-36-6290 = 298-36-6290,3,54,entity_set,10
3168,What is the type of the latest crime committed by individuals already involved in drug offenses?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Drugs"")
RETURN x0.type
ORDER BY x0.date DESC
LIMIT 1","[Crime] = Drugs
What is the type of the latest crime committed by individuals already involved in drug offenses?",What is the type of the latest crime committed by individuals already involved in [x2.Crime.type:Drugs] offenses?,x2.Crime.type:Drugs = drug,3,17,argmax,1
2149,How many officers examined cases under the Other theft category?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
How many officers examined cases under the Other theft category?",How many officers examined cases under the [x1.Crime.type:Other theft] category?,x1.Crime.type:Other theft = Other theft,2,291,count,1
1068,How many phones are in the possession of anyone named Amy?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
How many phones are in the possession of anyone named Amy?",How many phones are in the possession of anyone named [x1.Person.name:Amy]?,x1.Person.name:Amy = Amy,2,142,count,1
1143,Can you identify the phones that called at 20:26?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""20:26"")
RETURN x0","[PhoneCall] = 20:26
Can you identify the phones that called at 20:26?",Can you identify the phones that called at [x1.PhoneCall.call_time:20:26]?,x1.PhoneCall.call_time:20:26 = 20:26,2,151,entity_set,1
335,Can you name everyone living at 63 Princess Avenue?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""63 Princess Avenue"")
RETURN x0","[Location] = 63 Princess Avenue
Can you name everyone living at 63 Princess Avenue?",Can you name everyone living at [x1.Location.address:63 Princess Avenue]?,x1.Location.address:63 Princess Avenue = 63 Princess Avenue,2,42,entity_set,1
1058,Which offenses at 157 Seatoller Place have been investigated but lack a suspect?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""157 Seatoller Place"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = 157 Seatoller Place
Which offenses at 157 Seatoller Place have been investigated but lack a suspect?",Which offenses at [x1.Location.address:157 Seatoller Place] have been [x0.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Crime.last_outcome:Investigation complete; no suspect identified = investigated but lack a suspect 
x1.Location.address:157 Seatoller Place = 157 Seatoller Place",2,140,entity_set,3
1832,What calls were made at 10:29 to the number 5-(094)022-8985?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""10:29"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(094)022-8985"")
RETURN x0","[PhoneCall] = 10:29
[Phone] = 5-(094)022-8985
What calls were made at 10:29 to the number 5-(094)022-8985?",What calls were made at [x0.PhoneCall.call_time:10:29] to the number [x1.Phone.phoneNo:5-(094)022-8985]?,"x0.PhoneCall.call_time:10:29 = 10:29
x1.Phone.phoneNo:5-(094)022-8985 = 5-(094)022-8985",2,244,entity_set,1
1172,Can you provide a list of criminal damage and arson offenses investigated by officers with badge number 87-5149886?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""87-5149886"")
RETURN x0","[Crime] = Criminal damage and arson
[Officer] = 87-5149886
Can you provide a list of criminal damage and arson offenses investigated by officers with badge number 87-5149886?",Can you provide a list of [x0.Crime.type:Criminal damage and arson] offenses investigated by officers with badge number [x1.Officer.badge_no:87-5149886]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.badge_no:87-5149886 = 87-5149886",2,156,entity_set,4
1725,How many cars were part of criminal activities on 13th August 2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
How many cars were part of criminal activities on 13th August 2017?",How many cars were part of criminal activities on [x1.Crime.date:13/08/2017]?,x1.Crime.date:13/08/2017 = 13th August 2017,2,228,count,1
1286,Who is the oldest person that has their phone number known by a Karen with the contact 3-(255)675-6727?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Karen"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(255)675-6727"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Karen
[Phone] = 3-(255)675-6727
Who is the oldest person that has their phone number known by a Karen with the contact 3-(255)675-6727?",Who is the oldest person that has their phone number known by a [x1.Person.name:Karen] with the contact [x2.Phone.phoneNo:3-(255)675-6727]?,"x1.Person.name:Karen = Karen
x2.Phone.phoneNo:3-(255)675-6727 = 3-(255)675-6727",3,170,max,1
1878,Can you identify all Emilys related to a person whose surname is Day?,"MATCH (x0:Person WHERE x0.name = ""Emily"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Day"")
RETURN x0","[Person] = Emily
[Person] = Day
Can you identify all Emilys related to a person whose surname is Day?",Can you identify all [x0.Person.name:Emily] related to a person whose surname is [x1.Person.surname:Day]?,"x0.Person.name:Emily = Emilys
x1.Person.surname:Day = Day",2,251,entity_set,1
542,What is the number of crimes with Lincoln vehicles involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Lincoln"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Lincoln
What is the number of crimes with Lincoln vehicles involved?",What is the number of crimes with [x1.Vehicle.make:Lincoln] vehicles involved?,x1.Vehicle.make:Lincoln = Lincoln,2,70,count,1
3320,What are the surnames of individuals residing in areas with Vehicle crime incidents?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.surname","[Crime] = Vehicle crime
What are the surnames of individuals residing in areas with Vehicle crime incidents?",What are the surnames of individuals residing in areas with [x2.Crime.type:Vehicle crime] incidents?,x2.Crime.type:Vehicle crime = Vehicle crime,3,41,attribute_set,58
2114,Who are the individuals with the phone number 2-(029)966-6535?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""2-(029)966-6535"")
RETURN x0","[Phone] = 2-(029)966-6535
Who are the individuals with the phone number 2-(029)966-6535?",Who are the individuals with the phone number [x1.Phone.phoneNo:2-(029)966-6535]?,x1.Phone.phoneNo:2-(029)966-6535 = 2-(029)966-6535,2,285,entity_set,1
4490,How many 54-second calls did a phone receive after making a call at 08:11?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""54"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""08:11"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 54
[PhoneCall] = 08:11
How many 54-second calls did a phone receive after making a call at 08:11?",How many [x0.PhoneCall.call_duration:54]-second calls did a phone receive after making a call at [x2.PhoneCall.call_time:08:11]?,"x0.PhoneCall.call_duration:54 = 54
x2.PhoneCall.call_time:08:11 = 08:11",3,41,count,1
2506,Can you tell me the count of postcodes in the SK8 zone?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""SK8"")
RETURN COUNT(DISTINCT x0)","[Area] = SK8
Can you tell me the count of postcodes in the SK8 zone?",Can you tell me the count of postcodes in the [x1.Area.areaCode:SK8] zone?,x1.Area.areaCode:SK8 = SK8,2,348,count,1
91,What ages do people have who share a home with an Austin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0.age","[Person] = Austin
What ages do people have who share a home with an Austin?",What ages do people have who share a home with an [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,11,attribute_set,4
3205,Can you provide the NHS numbers for people who cohabit and participate in crime?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)
MATCH (x0:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0.nhs_no",Can you provide the NHS numbers for people who cohabit and participate in crime?,Can you provide the NHS numbers for people who cohabit and participate in crime?,,3,23,attribute_set,46
2279,"How many cases marked as ""Investigation complete; no suspect"" are handled by officer badge 63-3360135?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""63-3360135"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = 63-3360135
How many cases marked as ""Investigation complete; no suspect"" are handled by officer badge 63-3360135?","How many cases marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" are handled by officer badge [x1.Officer.badge_no:63-3360135]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect 
x1.Officer.badge_no:63-3360135 = 63-3360135",2,307,count,1
3542,What are the dates of violence and sexual offences in the BL2 area?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""BL2"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = BL2
What are the dates of violence and sexual offences in the BL2 area?",What are the dates of [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:BL2] area?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x2.Area.areaCode:BL2 = BL2",3,111,attribute_set,197
497,How many cases marked Unable to prosecute suspect involve a person with the surname Robertson?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Person] = Robertson
How many cases marked Unable to prosecute suspect involve a person with the surname Robertson?",How many cases marked [x0.Crime.last_outcome:Unable to prosecute suspect] involve a person with the surname [x1.Person.surname:Robertson]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Person.surname:Robertson = Robertson",2,64,count,1
1695,How many criminal incidents happened at 46 Dunkery Road on 27th August 2017?,"MATCH (x0:Crime WHERE x0.date = ""27/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""46 Dunkery Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = 27/08/2017
[Location] = 46 Dunkery Road
How many criminal incidents happened at 46 Dunkery Road on 27th August 2017?",How many criminal incidents happened at [x1.Location.address:46 Dunkery Road] on [x0.Crime.date:27/08/2017]?,"x0.Crime.date:27/08/2017 = 27th August 2017 
x1.Location.address:46 Dunkery Road = 46 Dunkery Road",2,223,count,1
3687,Can you identify the people possessing a phone who are connected to a crime?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
MATCH (x0:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",Can you identify the people possessing a phone who are connected to a crime?,Can you identify the people possessing a phone who are connected to a crime?,,3,178,entity_set,53
1636,Can you identify areas with locations that have the post code SK16 4JZ?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""SK16 4JZ"")
RETURN x0","[Location] = SK16 4JZ
Can you identify areas with locations that have the post code SK16 4JZ?",Can you identify areas with locations that have the post code [x1.Location.postcode:SK16 4JZ]?,x1.Location.postcode:SK16 4JZ = SK16 4JZ,2,215,entity_set,1
1026,When did the latest crime happen at a place with the postcode SK7 6LQ?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""SK7 6LQ"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = SK7 6LQ
When did the latest crime happen at a place with the postcode SK7 6LQ?",When did the latest crime happen at a place with the postcode [x2.PostCode.code:SK7 6LQ]?,x2.PostCode.code:SK7 6LQ = SK7 6LQ,3,135,argmax,1
2765,What vehicle crimes involve someone named Phillip and Edge vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Edge"")
RETURN x0","[Crime] = Vehicle crime
[Person] = Phillip
[Vehicle] = Edge
What vehicle crimes involve someone named Phillip and Edge vehicles?",What [x0.Crime.type:Vehicle crime] involve someone named [x2.Person.name:Phillip] and [x1.Vehicle.model:Edge] vehicles?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Edge = Edge
x2.Person.name:Phillip = Phillip",3,401,entity_set,1
2186,How many officers called Eimile worked on cases marked as Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Eimile"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Officer] = Eimile
[Crime] = Unable to prosecute suspect
How many officers called Eimile worked on cases marked as Unable to prosecute suspect?",How many officers called [x0.Officer.name:Eimile] worked on cases marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Eimile = Eimile
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,296,count,1
377,Can you provide a list of officers called Even who worked on cases dated 30/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Even"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN x0","[Officer] = Even
[Crime] = 30/08/2017
Can you provide a list of officers called Even who worked on cases dated 30/08/2017?",Can you provide a list of officers called [x0.Officer.name:Even] who worked on cases dated [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Even = Even
x1.Crime.date:30/08/2017 = 30/08/2017",2,49,entity_set,2
4491,How many calls lasting 54 seconds were received by a phone that dialed out at 08:11?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""54"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""08:11"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 54
[PhoneCall] = 08:11
How many calls lasting 54 seconds were received by a phone that dialed out at 08:11?",How many calls lasting [x0.PhoneCall.call_duration:54] seconds were received by a phone that dialed out at [x2.PhoneCall.call_time:08:11]?,"x0.PhoneCall.call_duration:54 = 54
x2.PhoneCall.call_time:08:11 = 08:11",3,41,count,1
477,Which calls were received at 1-(963)530-6466?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(963)530-6466"")
RETURN x0","[Phone] = 1-(963)530-6466
Which calls were received at 1-(963)530-6466?",Which calls were received at [x1.Phone.phoneNo:1-(963)530-6466]?,x1.Phone.phoneNo:1-(963)530-6466 = 1-(963)530-6466,2,62,entity_set,2
2925,When were crimes committed by residents of 11 Warwick Road?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""11 Warwick Road"")
RETURN x0.date","[Location] = 11 Warwick Road
When were crimes committed by residents of 11 Warwick Road?",When were crimes committed by residents of [x2.Location.address:11 Warwick Road]?,x2.Location.address:11 Warwick Road = 11 Warwick Road,3,424,attribute_set,1
3626,What are the last names of friends of individuals linked to a public order crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Public order"")
RETURN x0.surname","[Crime] = Public order
What are the last names of friends of individuals linked to a public order crime?",What are the last names of friends of individuals linked to a [x2.Crime.type:Public order] crime?,x2.Crime.type:Public order = public order,3,148,attribute_set,11
3672,Can you provide the NHS numbers for people related to a resident of the OL12 6TA postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL12 6TA"")
RETURN x0.nhs_no","[Location] = OL12 6TA
Can you provide the NHS numbers for people related to a resident of the OL12 6TA postcode?",Can you provide the NHS numbers for people related to a resident of the [x2.Location.postcode:OL12 6TA] postcode?,x2.Location.postcode:OL12 6TA = OL12 6TA,3,172,attribute_set,2
