id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
893,Can you identify everyone related to someone with last name Hanson?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Hanson"")
RETURN x0","[Person] = Hanson
Can you identify everyone related to someone with last name Hanson?",Can you identify everyone related to someone with last name [x1.Person.surname:Hanson]?,x1.Person.surname:Hanson = Hanson,2,117,entity_set,6
2153,How many officers looked into robbery cases?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Robbery"")
RETURN COUNT(DISTINCT x0)","[Crime] = Robbery
How many officers looked into robbery cases?",How many officers looked into [x1.Crime.type:Robbery] cases?,x1.Crime.type:Robbery = robbery,2,291,count,1
2290,When did the last crime happen at 197 Mason Street with a person with last name George involved?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""George"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""197 Mason Street"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = George
[Location] = 197 Mason Street
When did the last crime happen at 197 Mason Street with a person with last name George involved?",When did the last crime happen at [x1.Location.address:197 Mason Street] with a person with last name [x2.Person.surname:George] involved?,"x1.Location.address:197 Mason Street = 197 Mason Street
x2.Person.surname:George = George",3,309,argmax,1
1557,What is the number of 1989 vehicles connected to crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""1989"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1989
What is the number of 1989 vehicles connected to crimes?",What is the number of [x0.Vehicle.year:1989] vehicles connected to crimes?,x0.Vehicle.year:1989 = 1989,2,207,count,1
1510,What is the earliest crime involving individuals with last name Williamson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Williamson
What is the earliest crime involving individuals with last name Williamson?",What is the earliest crime involving individuals with last name [x1.Person.surname:Williamson]?,x1.Person.surname:Williamson = Williamson,2,200,min,1
970,How many places experienced crimes on 23/08/2017?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
How many places experienced crimes on 23/08/2017?",How many places experienced crimes on [x1.Crime.date:23/08/2017]?,x1.Crime.date:23/08/2017 = 23/08/2017,2,127,count,1
114,How many individuals named Lillian are acquainted with anyone surnamed Cunningham?,"MATCH (x0:Person WHERE x0.name = ""Lillian"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Cunningham"")
RETURN COUNT(DISTINCT x0)","[Person] = Lillian
[Person] = Cunningham
How many individuals named Lillian are acquainted with anyone surnamed Cunningham?",How many individuals named [x0.Person.name:Lillian] are acquainted with anyone surnamed [x1.Person.surname:Cunningham]?,"x0.Person.name:Lillian = Lillian
x1.Person.surname:Cunningham = Cunningham",2,13,count,1
4447,What email addresses belong to a person sharing a home with someone called Phillip?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0.email_address","[Person] = Phillip
What email addresses belong to a person sharing a home with someone called Phillip?",What email addresses belong to a person sharing a home with someone called [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,29,attribute_set,7
1624,What's the earliest incident with Mazda3 models?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Mazda3"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Mazda3
What's the earliest incident with Mazda3 models?",What's the earliest incident with [x1.Vehicle.model:Mazda3] models?,x1.Vehicle.model:Mazda3 = Mazda3,2,214,min,1
4636,What's the earliest offense linked to someone aware of Ann's contact number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Ann"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Ann
What's the earliest offense linked to someone aware of Ann's contact number?",What's the earliest offense linked to someone aware of [x2.Person.name:Ann]'s contact number?,x2.Person.name:Ann = Ann,3,89,min,1
2031,What was the longest duration for calls from phones that called on 18/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 18/08/2017
What was the longest duration for calls from phones that called on 18/08/2017?",What was the longest duration for calls from phones that called on [x2.PhoneCall.call_date:18/08/2017]?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,273,argmax,1
2614,How many investigations are conducted by officers whose last name is Tzarkov?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tzarkov"")
RETURN COUNT(DISTINCT x0)","[Officer] = Tzarkov
How many investigations are conducted by officers whose last name is Tzarkov?",How many investigations are conducted by officers whose last name is [x1.Officer.surname:Tzarkov]?,x1.Officer.surname:Tzarkov = Tzarkov,2,372,count,1
1271,How many individuals named Scott have a friend with the surname Alexander?,"MATCH (x0:Person WHERE x0.name = ""Scott"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Alexander"")
RETURN COUNT(DISTINCT x0)","[Person] = Scott
[Person] = Alexander
How many individuals named Scott have a friend with the surname Alexander?",How many individuals named [x0.Person.name:Scott] have a friend with the surname [x1.Person.surname:Alexander]?,"x0.Person.name:Scott = Scott
x1.Person.surname:Alexander = Alexander",2,169,count,1
116,Who lives with Diana?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Diana"")
RETURN x0","[Person] = Diana
Who lives with Diana?",Who lives with [x1.Person.name:Diana]?,x1.Person.name:Diana = Diana,2,14,entity_set,3
2505,How many postal codes exist within the SK8 region?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""SK8"")
RETURN COUNT(DISTINCT x0)","[Area] = SK8
How many postal codes exist within the SK8 region?",How many postal codes exist within the [x1.Area.areaCode:SK8] region?,x1.Area.areaCode:SK8 = SK8,2,348,count,1
1213,How many have the phone number 5-(711)674-4929?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""5-(711)674-4929"")
RETURN COUNT(DISTINCT x0)","[Phone] = 5-(711)674-4929
How many have the phone number 5-(711)674-4929?",How many have the phone number [x1.Phone.phoneNo:5-(711)674-4929]?,x1.Phone.phoneNo:5-(711)674-4929 = 5-(711)674-4929,2,162,count,1
2137,Which call to a Hamilton's phone came first by date?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Hamilton"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Hamilton
Which call to a Hamilton's phone came first by date?",Which call to a [x2.Person.surname:Hamilton]'s phone came first by date?,x2.Person.surname:Hamilton = Hamilton,3,288,min,1
1244,How many incidents on 26/08/2017 are under investigation by officers with the surname Goneau?,"MATCH (x0:Crime WHERE x0.date = ""26/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Goneau"")
RETURN COUNT(DISTINCT x0)","[Crime] = 26/08/2017
[Officer] = Goneau
How many incidents on 26/08/2017 are under investigation by officers with the surname Goneau?",How many incidents on [x0.Crime.date:26/08/2017] are under investigation by officers with the surname [x1.Officer.surname:Goneau]?,"x0.Crime.date:26/08/2017 = 26/08/2017
x1.Officer.surname:Goneau = Goneau",2,166,count,1
2974,What is the date of the first offense linked to the email address awarddi@youku.com?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""awarddi@youku.com"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = awarddi@youku.com
What is the date of the first offense linked to the email address awarddi@youku.com?",What is the date of the first offense linked to the email address [x2.Email.email_address:awarddi@youku.com]?,x2.Email.email_address:awarddi@youku.com = awarddi@youku.com,3,431,argmin,1
2700,Which was the initial crime with a person at 60 Deakins Mill Way?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Deakins Mill Way"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Deakins Mill Way
Which was the initial crime with a person at 60 Deakins Mill Way?",Which was the initial crime with a person at [x1.Location.address:60 Deakins Mill Way]?,x1.Location.address:60 Deakins Mill Way = 60 Deakins Mill Way,3,391,min,1
636,Who are the individuals with access to a Campbell's phone number?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Campbell"")
RETURN x0","[Person] = Campbell
Who are the individuals with access to a Campbell's phone number?",Who are the individuals with access to a [x1.Person.surname:Campbell]'s phone number?,x1.Person.surname:Campbell = Campbell,2,84,entity_set,2
2940,How many penalty notice crimes involve Morales and are investigated by officers named with last name Death?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given penalty notice"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Morales"")
MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given penalty notice"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Death"")
RETURN COUNT(DISTINCT x0)","[Crime] = Offender given penalty notice
[Person] = Morales
[Officer] = Death
How many penalty notice crimes involve Morales and are investigated by officers named with last name Death?",How many [x0.Crime.last_outcome:Offender given penalty notice] involve [x2.Person.surname:Morales] and are investigated by officers named with last name [x1.Officer.surname:Death]?,"x0.Crime.last_outcome:Offender given penalty notice = penalty notice crimes 
x1.Officer.surname:Death = Death
x2.Person.surname:Morales = Morales",3,426,count,1
1593,Which post codes correspond to crime sites from 25/08/2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""25/08/2017"")
RETURN x0","[Crime] = 25/08/2017
Which post codes correspond to crime sites from 25/08/2017?",Which post codes correspond to crime sites from [x2.Crime.date:25/08/2017]?,x2.Crime.date:25/08/2017 = 25/08/2017,3,211,entity_set,927
2470,What count of postcodes exists in any area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area)
RETURN COUNT(DISTINCT x0)",What count of postcodes exists in any area?,What count of postcodes exists in any area?,,2,342,count,1
3513,Can you provide the postal codes for the residences of the friends of the person whose NHS number is 664-34-9245?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""664-34-9245"")
RETURN x0.postcode","[Person] = 664-34-9245
Can you provide the postal codes for the residences of the friends of the person whose NHS number is 664-34-9245?",Can you provide the postal codes for the residences of the friends of the person whose NHS number is [x2.Person.nhs_no:664-34-9245]?,x2.Person.nhs_no:664-34-9245 = 664-34-9245,3,104,attribute_set,6
788,Which is the oldest vehicle tied to a crime marked as 'Investigation complete; no suspect identified' that involves a person with the surname Williamson?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Williamson"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Williamson
Which is the oldest vehicle tied to a crime marked as 'Investigation complete; no suspect identified' that involves a person with the surname Williamson?",Which is the oldest vehicle tied to a crime marked as '[x1.Crime.last_outcome:Investigation complete; no suspect identified]' that involves a person with the surname [x2.Person.surname:Williamson]?,"x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.surname:Williamson = Williamson",3,103,max,1
1690,"On August 3, 2017, how many crimes were committed at 128 Waddington Close?","MATCH (x0:Crime WHERE x0.date = ""3/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""128 Waddington Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = 3/08/2017
[Location] = 128 Waddington Close
On August 3, 2017, how many crimes were committed at 128 Waddington Close?","On [x0.Crime.date:3/08/2017], how many crimes were committed at [x1.Location.address:128 Waddington Close]?","x0.Crime.date:3/08/2017 = August 3, 2017 
x1.Location.address:128 Waddington Close = 128 Waddington Close",2,223,count,1
1531,How many crimes on 15/08/2017 involved a Suburban 2500?,"MATCH (x0:Vehicle WHERE x0.model = ""Suburban 2500"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""15/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Suburban 2500
[Crime] = 15/08/2017
How many crimes on 15/08/2017 involved a Suburban 2500?",How many crimes on [x1.Crime.date:15/08/2017] involved a [x0.Vehicle.model:Suburban 2500]?,"x0.Vehicle.model:Suburban 2500 = Suburban 2500
x1.Crime.date:15/08/2017 = 15/08/2017",2,203,count,1
271,What crimes happened at Pedestrian Subway?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Pedestrian Subway"")
RETURN x0","[Location] = Pedestrian Subway
What crimes happened at Pedestrian Subway?",What crimes happened at [x1.Location.address:Pedestrian Subway]?,x1.Location.address:Pedestrian Subway = Pedestrian Subway,2,33,entity_set,115
2300,Can you provide a list of all calls made using the number 8-(697)626-3419?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(697)626-3419"")
RETURN x0","[Phone] = 8-(697)626-3419
Can you provide a list of all calls made using the number 8-(697)626-3419?",Can you provide a list of all calls made using the number [x1.Phone.phoneNo:8-(697)626-3419]?,x1.Phone.phoneNo:8-(697)626-3419 = 8-(697)626-3419,2,310,entity_set,2
147,What is the first call to phones that called on 04/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""04/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 04/08/2017
What is the first call to phones that called on 04/08/2017?",What is the first call to phones that called on [x2.PhoneCall.call_date:04/08/2017]?,x2.PhoneCall.call_date:04/08/2017 = 04/08/2017,3,17,min,1
2801,Can you provide the emails of those living at 63 Princess Avenue?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""63 Princess Avenue"")
RETURN x0","[Location] = 63 Princess Avenue
Can you provide the emails of those living at 63 Princess Avenue?",Can you provide the emails of those living at [x2.Location.address:63 Princess Avenue]?,x2.Location.address:63 Princess Avenue = 63 Princess Avenue,3,408,entity_set,1
3327,Can you provide the residential addresses of people familiar to anyone named Bobby?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Bobby"")
RETURN x0.address","[Person] = Bobby
Can you provide the residential addresses of people familiar to anyone named Bobby?",Can you provide the residential addresses of people familiar to anyone named [x2.Person.name:Bobby]?,x2.Person.name:Bobby = Bobby,3,42,attribute_set,7
3503,What most recent crime happened at postcode M33 4ND?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M33 4ND"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M33 4ND
What most recent crime happened at postcode M33 4ND?",What most recent crime happened at postcode [x2.PostCode.code:M33 4ND]?,x2.PostCode.code:M33 4ND = M33 4ND,3,103,max,1
2948,Which vehicle crimes involving Escalade ESVs occurred at 67 Speyside Close?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""67 Speyside Close"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Escalade ESV"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 67 Speyside Close
[Vehicle] = Escalade ESV
Which vehicle crimes involving Escalade ESVs occurred at 67 Speyside Close?",Which [x0.Crime.type:Vehicle crime] involving [x1.Vehicle.model:Escalade ESV]s occurred at [x2.Location.address:67 Speyside Close]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Escalade ESV = Escalade ESV
x2.Location.address:67 Speyside Close = 67 Speyside Close",3,428,entity_set,1
4555,Could you list the NHS numbers of people connected to a Walker's relative?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Walker"")
RETURN x0.nhs_no","[Person] = Walker
Could you list the NHS numbers of people connected to a Walker's relative?",Could you list the NHS numbers of people connected to a [x2.Person.surname:Walker]'s relative?,x2.Person.surname:Walker = Walker,3,56,attribute_set,9
1858,What's the postcode linked to 73 Longford Street?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""73 Longford Street"")
RETURN x0","[Location] = 73 Longford Street
What's the postcode linked to 73 Longford Street?",What's the postcode linked to [x1.Location.address:73 Longford Street]?,x1.Location.address:73 Longford Street = 73 Longford Street,2,247,entity_set,1
1169,What phones were called at 21:34?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""21:34"")
RETURN x0","[PhoneCall] = 21:34
What phones were called at 21:34?",What phones were called at [x1.PhoneCall.call_time:21:34]?,x1.PhoneCall.call_time:21:34 = 21:34,2,154,entity_set,2
2442,What is the number of locations within area code M6?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN COUNT(DISTINCT x0)","[Area] = M6
What is the number of locations within area code M6?",What is the number of locations within area code [x1.Area.areaCode:M6]?,x1.Area.areaCode:M6 = M6,2,337,count,1
3641,"Who lives with Phillip and is linked to a crime with the status ""Investigation complete; no suspect identified""?","MATCH (x0:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Person] = Phillip
[Crime] = Investigation complete; no suspect identified
Who lives with Phillip and is linked to a crime with the status ""Investigation complete; no suspect identified""?","Who lives with [x2.Person.name:Phillip] and is linked to a crime with the status ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.name:Phillip = Phillip",3,153,entity_set,6
838,How old is the youngest person living with a Jordan?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Jordan"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Jordan
How old is the youngest person living with a Jordan?",How old is the youngest person living with a [x1.Person.surname:Jordan]?,x1.Person.surname:Jordan = Jordan,2,111,argmin,1
4486,What are the NHS numbers of Carls who are family of the person with NHS number 446-63-4367?,"MATCH (x0:Person WHERE x0.name = ""Carl"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""446-63-4367"")
RETURN x0.nhs_no","[Person] = Carl
[Person] = 446-63-4367
What are the NHS numbers of Carls who are family of the person with NHS number 446-63-4367?",What are the NHS numbers of [x0.Person.name:Carl]s who are family of the person with NHS number [x2.Person.nhs_no:446-63-4367]?,"x0.Person.name:Carl = Carl
x2.Person.nhs_no:446-63-4367 = 446-63-4367",3,36,attribute_set,1
3390,Which vehicle brands were linked to a crime at the site with postcode BL6 5RW?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL6 5RW"")
RETURN x0.make","[Location] = BL6 5RW
Which vehicle brands were linked to a crime at the site with postcode BL6 5RW?",Which vehicle brands were linked to a crime at the site with postcode [x2.Location.postcode:BL6 5RW]?,x2.Location.postcode:BL6 5RW = BL6 5RW,3,54,attribute_set,4
3179,Can you provide the ranks of officers who looked into crimes involving Grand Prix model vehicles?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Grand Prix"")
RETURN x0.rank","[Vehicle] = Grand Prix
Can you provide the ranks of officers who looked into crimes involving Grand Prix model vehicles?",Can you provide the ranks of officers who looked into crimes involving [x2.Vehicle.model:Grand Prix] model vehicles?,x2.Vehicle.model:Grand Prix = Grand Prix,3,19,attribute_set,7
845,Can you provide a list of crimes with Daihatsu cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Daihatsu"")
RETURN x0","[Vehicle] = Daihatsu
Can you provide a list of crimes with Daihatsu cars?",Can you provide a list of crimes with [x1.Vehicle.make:Daihatsu] cars?,x1.Vehicle.make:Daihatsu = Daihatsu,2,112,entity_set,2
2535,How many officers with the name Hansiain probed any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Hansiain"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Hansiain
How many officers with the name Hansiain probed any crimes?",How many officers with the name [x0.Officer.name:Hansiain] probed any crimes?,x0.Officer.name:Hansiain = Hansiain,2,354,count,1
4385,What are the types of crimes that occurred on 19/08/2017 involving a friend of the person with NHS number 806-49-7942?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""806-49-7942"")
RETURN x0.type","[Crime] = 19/08/2017
[Person] = 806-49-7942
What are the types of crimes that occurred on 19/08/2017 involving a friend of the person with NHS number 806-49-7942?",What are the types of crimes that occurred on [x0.Crime.date:19/08/2017] involving a friend of the person with NHS number [x2.Person.nhs_no:806-49-7942]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x2.Person.nhs_no:806-49-7942 = 806-49-7942",3,1,attribute_set,1
4633,What was the earliest offense linked to someone familiar with Virginia's phone details?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Virginia"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Virginia
What was the earliest offense linked to someone familiar with Virginia's phone details?",What was the earliest offense linked to someone familiar with [x2.Person.name:Virginia]'s phone details?,x2.Person.name:Virginia = Virginia,3,89,min,1
1100,How often was 7-(434)993-0161 dialed?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""7-(434)993-0161"")
RETURN COUNT(DISTINCT x0)","[Phone] = 7-(434)993-0161
How often was 7-(434)993-0161 dialed?",How often was [x1.Phone.phoneNo:7-(434)993-0161] dialed?,x1.Phone.phoneNo:7-(434)993-0161 = 7-(434)993-0161,2,145,count,1
102,What is the count of Mercedes-Benz vehicles tied to criminal activities on 13th August 2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Mercedes-Benz"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Mercedes-Benz
[Crime] = 13/08/2017
What is the count of Mercedes-Benz vehicles tied to criminal activities on 13th August 2017?",What is the count of [x0.Vehicle.make:Mercedes-Benz] vehicles tied to criminal activities on [x1.Crime.date:13/08/2017]?,"x0.Vehicle.make:Mercedes-Benz = Mercedes-Benz
x1.Crime.date:13/08/2017 = 13th August 2017",2,12,count,1
4382,What are the types of the crimes that occurred on 22/08/2017 involving a friend of the individual with NHS number 543-43-9738?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""543-43-9738"")
RETURN x0.type","[Crime] = 22/08/2017
[Person] = 543-43-9738
What are the types of the crimes that occurred on 22/08/2017 involving a friend of the individual with NHS number 543-43-9738?",What are the types of the crimes that occurred on [x0.Crime.date:22/08/2017] involving a friend of the individual with NHS number [x2.Person.nhs_no:543-43-9738]?,"x0.Crime.date:22/08/2017 = 22/08/2017
x2.Person.nhs_no:543-43-9738 = 543-43-9738",3,1,attribute_set,1
26,How many criminal damage and arson cases are investigated by officers named Allianora?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Allianora"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Officer] = Allianora
How many criminal damage and arson cases are investigated by officers named Allianora?",How many [x0.Crime.type:Criminal damage and arson] cases are investigated by officers named [x1.Officer.name:Allianora]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.name:Allianora = Allianora",2,4,count,1
3569,What are the surnames of the friends of Amy who is involved in a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Amy"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Amy
What are the surnames of the friends of Amy who is involved in a crime?",What are the surnames of the friends of [x1.Person.name:Amy] who is involved in a crime?,x1.Person.name:Amy = Amy,3,119,attribute_set,12
488,Can you provide a list of vehicles linked to crimes since 6/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""6/08/2017"")
RETURN x0","[Crime] = 6/08/2017
Can you provide a list of vehicles linked to crimes since 6/08/2017?",Can you provide a list of vehicles linked to crimes since [x1.Crime.date:6/08/2017]?,x1.Crime.date:6/08/2017 = 6/08/2017,2,63,entity_set,36
2847,What is the most recent offense linked to a person with the phone number 2-(821)181-6941?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""2-(821)181-6941"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 2-(821)181-6941
What is the most recent offense linked to a person with the phone number 2-(821)181-6941?",What is the most recent offense linked to a person with the phone number [x2.Phone.phoneNo:2-(821)181-6941]?,x2.Phone.phoneNo:2-(821)181-6941 = 2-(821)181-6941,3,414,max,1
398,Which Inspectors were involved in crime investigations on 4/08/2017?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Officer] = Inspector
[Crime] = 4/08/2017
Which Inspectors were involved in crime investigations on 4/08/2017?",Which [x0.Officer.rank:Inspector] were involved in crime investigations on [x1.Crime.date:4/08/2017]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.date:4/08/2017 = 4/08/2017",2,52,entity_set,182
3409,Can you identify NHS numbers of those related to someone with the email cknight2k@jiathis.com?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""cknight2k@jiathis.com"")
RETURN x0.nhs_no","[Email] = cknight2k@jiathis.com
Can you identify NHS numbers of those related to someone with the email cknight2k@jiathis.com?",Can you identify NHS numbers of those related to someone with the email [x2.Email.email_address:cknight2k@jiathis.com]?,x2.Email.email_address:cknight2k@jiathis.com = cknight2k@jiathis.com,3,59,attribute_set,2
1581,Can you provide a list of crimes at places with the postcode M6 5HW?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M6 5HW"")
RETURN x0","[Location] = M6 5HW
Can you provide a list of crimes at places with the postcode M6 5HW?",Can you provide a list of crimes at places with the postcode [x1.Location.postcode:M6 5HW]?,x1.Location.postcode:M6 5HW = M6 5HW,2,209,entity_set,15
1440,How many incidents on 22/08/2017 did officers with badge number 74-9647050 investigate?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""74-9647050"")
RETURN COUNT(DISTINCT x0)","[Crime] = 22/08/2017
[Officer] = 74-9647050
How many incidents on 22/08/2017 did officers with badge number 74-9647050 investigate?",How many incidents on [x0.Crime.date:22/08/2017] did officers with badge number [x1.Officer.badge_no:74-9647050] investigate?,"x0.Crime.date:22/08/2017 = 22/08/2017
x1.Officer.badge_no:74-9647050 = 74-9647050",2,190,count,1
4387,Which are the types of crimes on 19/08/2017 that involved a friend of the person holding NHS number 806-49-7942?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""806-49-7942"")
RETURN x0.type","[Crime] = 19/08/2017
[Person] = 806-49-7942
Which are the types of crimes on 19/08/2017 that involved a friend of the person holding NHS number 806-49-7942?",Which are the types of crimes on [x0.Crime.date:19/08/2017] that involved a friend of the person holding NHS number [x2.Person.nhs_no:806-49-7942]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x2.Person.nhs_no:806-49-7942 = 806-49-7942",3,1,attribute_set,1
1406,How many calls of 66 seconds were made to 0-(752)850-0116?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""66"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(752)850-0116"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
[Phone] = 0-(752)850-0116
How many calls of 66 seconds were made to 0-(752)850-0116?",How many calls of [x0.PhoneCall.call_duration:66] seconds were made to [x1.Phone.phoneNo:0-(752)850-0116]?,"x0.PhoneCall.call_duration:66 = 66
x1.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116",2,184,count,1
676,What is the crime count for 124 Clegg Place?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""124 Clegg Place"")
RETURN COUNT(DISTINCT x0)","[Location] = 124 Clegg Place
What is the crime count for 124 Clegg Place?",What is the crime count for [x1.Location.address:124 Clegg Place]?,x1.Location.address:124 Clegg Place = 124 Clegg Place,2,89,count,1
2051,How many criminal damage and arson incidents happened at 58 Wellbank Close?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""58 Wellbank Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
[Location] = 58 Wellbank Close
How many criminal damage and arson incidents happened at 58 Wellbank Close?",How many [x0.Crime.type:Criminal damage and arson] incidents happened at [x1.Location.address:58 Wellbank Close]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Location.address:58 Wellbank Close = 58 Wellbank Close",2,276,count,1
1493,Could you gather emails for everyone whose surname is Austin?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0","[Person] = Austin
Could you gather emails for everyone whose surname is Austin?",Could you gather emails for everyone whose surname is [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,198,entity_set,5
3420,What illegal acts took place at the house of someone named Phyllis?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Phyllis"")
RETURN x0","[Person] = Phyllis
What illegal acts took place at the house of someone named Phyllis?",What illegal acts took place at the house of someone named [x2.Person.name:Phyllis]?,x2.Person.name:Phyllis = Phyllis,3,63,entity_set,1
