id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
60,Can you name everyone acquainted with a person called Douglas?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Douglas"")
RETURN x0","[Person] = Douglas
Can you name everyone acquainted with a person called Douglas?",Can you name everyone acquainted with a person called [x1.Person.name:Douglas]?,x1.Person.name:Douglas = Douglas,2,7,entity_set,3
2206,How many crimes are Sergeants investigating that are still Awaiting court outcome?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Awaiting court outcome"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN COUNT(DISTINCT x0)","[Crime] = Awaiting court outcome
[Officer] = Sergeant
How many crimes are Sergeants investigating that are still Awaiting court outcome?",How many crimes are [x1.Officer.rank:Sergeant] investigating that are still [x0.Crime.last_outcome:Awaiting court outcome]?,"x0.Crime.last_outcome:Awaiting court outcome = Awaiting court outcome
x1.Officer.rank:Sergeant = Sergeants",2,298,count,1
457,What are the emails of people living with someone with last name Gray?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
What are the emails of people living with someone with last name Gray?",What are the emails of people living with someone with last name [x2.Person.surname:Gray]?,x2.Person.surname:Gray = Gray,3,60,entity_set,2
808,"What is the number of individuals involved in crimes on August 17, 2017?","MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""17/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 17/08/2017
What is the number of individuals involved in crimes on August 17, 2017?",What is the number of individuals involved in crimes on [x1.Crime.date:17/08/2017]?,"x1.Crime.date:17/08/2017 = August 17, 2017",2,108,count,1
3017,What is the date of the latest offense at locations of residence of individuals with the last name Peters?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Peters"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Peters
What is the date of the latest offense at locations of residence of individuals with the last name Peters?",What is the date of the latest offense at locations of residence of individuals with the last name [x2.Person.surname:Peters]?,x2.Person.surname:Peters = Peters,3,439,argmax,1
1668,Can you name everyone related to someone with last name Fuller?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Fuller"")
RETURN x0.name","[Person] = Fuller
Can you name everyone related to someone with last name Fuller?",Can you name everyone related to someone with last name [x1.Person.surname:Fuller]?,x1.Person.surname:Fuller = Fuller,2,219,attribute_set,6
3321,Can you provide the last names of those living in places where Vehicle crime has happened?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.surname","[Crime] = Vehicle crime
Can you provide the last names of those living in places where Vehicle crime has happened?",Can you provide the last names of those living in places where [x2.Crime.type:Vehicle crime] has happened?,x2.Crime.type:Vehicle crime = Vehicle crime,3,41,attribute_set,58
1452,How many people are related to the holder of NHS number 872-88-7149?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""872-88-7149"")
RETURN COUNT(DISTINCT x0)","[Person] = 872-88-7149
How many people are related to the holder of NHS number 872-88-7149?",How many people are related to the holder of NHS number [x1.Person.nhs_no:872-88-7149]?,x1.Person.nhs_no:872-88-7149 = 872-88-7149,2,191,count,1
801,"Which officers' badge numbers are linked to investigations from August 26, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0.badge_no","[Crime] = 26/08/2017
Which officers' badge numbers are linked to investigations from August 26, 2017?",Which officers' badge numbers are linked to investigations from [x1.Crime.date:26/08/2017]?,"x1.Crime.date:26/08/2017 = August 26, 2017",2,106,attribute_set,903
263,"On 28/08/2017, how many crimes included Esprit model vehicles?","MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Esprit"")
RETURN COUNT(DISTINCT x0)","[Crime] = 28/08/2017
[Vehicle] = Esprit
On 28/08/2017, how many crimes included Esprit model vehicles?","On [x0.Crime.date:28/08/2017], how many crimes included [x1.Vehicle.model:Esprit] model vehicles?","x0.Crime.date:28/08/2017 = 28/08/2017
x1.Vehicle.model:Esprit = Esprit",2,32,count,1
980,What is the number of crimes that involved 3000GT vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""3000GT"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 3000GT
What is the number of crimes that involved 3000GT vehicles?",What is the number of crimes that involved [x1.Vehicle.model:3000GT] vehicles?,x1.Vehicle.model:3000GT = 3000GT,2,128,count,1
3011,How many crimes on 25/08/2017 involved Pontiac vehicles in the M20 2QZ location?,"MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""25/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M20 2QZ"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Pontiac
[Crime] = 25/08/2017
[Location] = M20 2QZ
How many crimes on 25/08/2017 involved Pontiac vehicles in the M20 2QZ location?",How many crimes on [x1.Crime.date:25/08/2017] involved [x0.Vehicle.make:Pontiac] vehicles in the [x2.Location.postcode:M20 2QZ] location?,"x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.date:25/08/2017 = 25/08/2017
x2.Location.postcode:M20 2QZ = M20 2QZ",3,436,count,1
1069,How many phones does someone named Gloria own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Gloria"")
RETURN COUNT(DISTINCT x0)","[Person] = Gloria
How many phones does someone named Gloria own?",How many phones does someone named [x1.Person.name:Gloria] own?,x1.Person.name:Gloria = Gloria,2,142,count,1
3452,When did someone with surname Edwards receive a call on 08/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Edwards"")
RETURN x0.call_time","[PhoneCall] = 08/08/2017
[Person] = Edwards
When did someone with surname Edwards receive a call on 08/08/2017?",When did someone with surname [x2.Person.surname:Edwards] receive a call on [x0.PhoneCall.call_date:08/08/2017]?,"x0.PhoneCall.call_date:08/08/2017 = 08/08/2017
x2.Person.surname:Edwards = Edwards",3,77,attribute_set,1
2699,What was the first crime involving a person at 60 Deakins Mill Way?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Deakins Mill Way"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Deakins Mill Way
What was the first crime involving a person at 60 Deakins Mill Way?",What was the first crime involving a person at [x1.Location.address:60 Deakins Mill Way]?,x1.Location.address:60 Deakins Mill Way = 60 Deakins Mill Way,3,391,min,1
450,Can you identify the officers involved in ongoing investigations?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Crime] = Under investigation
Can you identify the officers involved in ongoing investigations?",Can you identify the officers involved in [x1.Crime.last_outcome:Under investigation]?,x1.Crime.last_outcome:Under investigation = ongoing investigations,2,59,entity_set,3421
2443,How many sites fall under the M6 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN COUNT(DISTINCT x0)","[Area] = M6
How many sites fall under the M6 area code?",How many sites fall under the [x1.Area.areaCode:M6] area code?,x1.Area.areaCode:M6 = M6,2,337,count,1
3197,What are the last names of people tied to crimes at the location BL1 8PZ?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 8PZ"")
RETURN x0.surname","[Location] = BL1 8PZ
What are the last names of people tied to crimes at the location BL1 8PZ?",What are the last names of people tied to crimes at the location [x2.Location.postcode:BL1 8PZ]?,x2.Location.postcode:BL1 8PZ = BL1 8PZ,3,21,attribute_set,1
1949,How many Discovery vehicles are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.model = ""Discovery"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Discovery
How many Discovery vehicles are linked to crimes?",How many [x0.Vehicle.model:Discovery] vehicles are linked to crimes?,x0.Vehicle.model:Discovery = Discovery,2,260,count,1
1614,Can you provide a list of types of offenses that took place at 190 Edale Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""190 Edale Street"")
RETURN x0.type","[Location] = 190 Edale Street
Can you provide a list of types of offenses that took place at 190 Edale Street?",Can you provide a list of types of offenses that took place at [x1.Location.address:190 Edale Street]?,x1.Location.address:190 Edale Street = 190 Edale Street,2,213,attribute_set,8
120,Can you name everyone who shares a home with Kevin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Kevin"")
RETURN x0","[Person] = Kevin
Can you name everyone who shares a home with Kevin?",Can you name everyone who shares a home with [x1.Person.name:Kevin]?,x1.Person.name:Kevin = Kevin,2,14,entity_set,2
1090,How many phones completed a 49-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""49"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 49
How many phones completed a 49-second call?",How many phones completed a [x1.PhoneCall.call_duration:49]-second call?,x1.PhoneCall.call_duration:49 = 49,2,144,count,1
3625,Which friends' last names belong to people associated with a Robbery offense?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Robbery"")
RETURN x0.surname","[Crime] = Robbery
Which friends' last names belong to people associated with a Robbery offense?",Which friends' last names belong to people associated with a [x2.Crime.type:Robbery] offense?,x2.Crime.type:Robbery = Robbery,3,148,attribute_set,5
4489,What is the NHS number of Ryan who is family related to someone with NHS number 873-28-7561?,"MATCH (x0:Person WHERE x0.name = ""Ryan"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0.nhs_no","[Person] = Ryan
[Person] = 873-28-7561
What is the NHS number of Ryan who is family related to someone with NHS number 873-28-7561?",What is the NHS number of [x0.Person.name:Ryan] who is family related to someone with NHS number [x2.Person.nhs_no:873-28-7561]?,"x0.Person.name:Ryan = Ryan
x2.Person.nhs_no:873-28-7561 = 873-28-7561",3,36,attribute_set,1
3567,Can you provide the addresses of crime scenes linked to someone named Brian?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0.address","[Person] = Brian
Can you provide the addresses of crime scenes linked to someone named Brian?",Can you provide the addresses of crime scenes linked to someone named [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,115,attribute_set,4
963,How many individuals named Brian possess a friend?,"MATCH (x0:Person WHERE x0.name = ""Brian"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Brian
How many individuals named Brian possess a friend?",How many individuals named [x0.Person.name:Brian] possess a friend?,x0.Person.name:Brian = Brian,2,126,count,1
1257,Which crimes on 30/08/2017 involved GTI vehicles?,"MATCH (x0:Crime WHERE x0.date = ""30/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""GTI"")
RETURN x0","[Crime] = 30/08/2017
[Vehicle] = GTI
Which crimes on 30/08/2017 involved GTI vehicles?",Which crimes on [x0.Crime.date:30/08/2017] involved [x1.Vehicle.model:GTI] vehicles?,"x0.Crime.date:30/08/2017 = 30/08/2017
x1.Vehicle.model:GTI = GTI",2,167,entity_set,1
1855,What's the postcode linked to 110 Sheard Avenue?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""110 Sheard Avenue"")
RETURN x0","[Location] = 110 Sheard Avenue
What's the postcode linked to 110 Sheard Avenue?",What's the postcode linked to [x1.Location.address:110 Sheard Avenue]?,x1.Location.address:110 Sheard Avenue = 110 Sheard Avenue,2,247,entity_set,1
667,Who are the friends of individuals with the last name Robertson?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN x0","[Person] = Robertson
Who are the friends of individuals with the last name Robertson?",Who are the friends of individuals with the last name [x1.Person.surname:Robertson]?,x1.Person.surname:Robertson = Robertson,2,88,entity_set,14
2074,In how many vehicle crimes were Mitsubishi cars involved?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Mitsubishi"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Vehicle] = Mitsubishi
In how many vehicle crimes were Mitsubishi cars involved?",In how many [x0.Crime.type:Vehicle crime] were [x1.Vehicle.make:Mitsubishi] cars involved?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.make:Mitsubishi = Mitsubishi",2,278,count,1
2385,What region is linked to 53 Shaw Street?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""53 Shaw Street"")
RETURN x0","[Location] = 53 Shaw Street
What region is linked to 53 Shaw Street?",What region is linked to [x1.Location.address:53 Shaw Street]?,x1.Location.address:53 Shaw Street = 53 Shaw Street,2,328,entity_set,1
3572,What are the surnames of the friends of Amanda who is involved in a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Amanda"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Amanda
What are the surnames of the friends of Amanda who is involved in a crime?",What are the surnames of the friends of [x1.Person.name:Amanda] who is involved in a crime?,x1.Person.name:Amanda = Amanda,3,119,attribute_set,7
5,Can you identify crimes from 20/08/2017 linked to anyone with the last name Murray?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN x0","[Crime] = 20/08/2017
[Person] = Murray
Can you identify crimes from 20/08/2017 linked to anyone with the last name Murray?",Can you identify crimes from [x0.Crime.date:20/08/2017] linked to anyone with the last name [x1.Person.surname:Murray]?,"x0.Crime.date:20/08/2017 = 20/08/2017
x1.Person.surname:Murray = Murray",2,1,entity_set,1
646,Who is the eldest family member connected to someone who knows a Harper's phone number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Harper"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Harper
Who is the eldest family member connected to someone who knows a Harper's phone number?",Who is the eldest family member connected to someone who knows a [x2.Person.surname:Harper]'s phone number?,x2.Person.surname:Harper = Harper,3,86,max,1
3035,What is the email of the person linked to the phone number 3-(246)177-0272?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(246)177-0272"")
RETURN x0","[Phone] = 3-(246)177-0272
What is the email of the person linked to the phone number 3-(246)177-0272?",What is the email of the person linked to the phone number [x2.Phone.phoneNo:3-(246)177-0272]?,x2.Phone.phoneNo:3-(246)177-0272 = 3-(246)177-0272,3,442,entity_set,1
4442,How many individuals are acquainted with a Williamson and linked to a crime?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Williamson"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Williamson
How many individuals are acquainted with a Williamson and linked to a crime?",How many individuals are acquainted with a [x2.Person.surname:Williamson] and linked to a crime?,x2.Person.surname:Williamson = Williamson,3,25,count,1
269,Can you provide a list of crimes at 170 Forest Avenue?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""170 Forest Avenue"")
RETURN x0","[Location] = 170 Forest Avenue
Can you provide a list of crimes at 170 Forest Avenue?",Can you provide a list of crimes at [x1.Location.address:170 Forest Avenue]?,x1.Location.address:170 Forest Avenue = 170 Forest Avenue,2,33,entity_set,7
316,"How many calls were placed to 3-(664)506-0704 on August 23, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(664)506-0704"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(664)506-0704
How many calls were placed to 3-(664)506-0704 on August 23, 2017?",How many calls were placed to [x1.Phone.phoneNo:3-(664)506-0704] on [x0.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:23/08/2017 = August 23, 2017 
x1.Phone.phoneNo:3-(664)506-0704 = 3-(664)506-0704",2,40,count,1
242,Can you show me the phones that had calls on 02/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""02/08/2017"")
RETURN x0","[PhoneCall] = 02/08/2017
Can you show me the phones that had calls on 02/08/2017?",Can you show me the phones that had calls on [x1.PhoneCall.call_date:02/08/2017]?,x1.PhoneCall.call_date:02/08/2017 = 02/08/2017,2,30,entity_set,34
2,Can you identify crimes from 1/08/2017 linked to those with the last name Walker?,"MATCH (x0:Crime WHERE x0.date = ""1/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Walker"")
RETURN x0","[Crime] = 1/08/2017
[Person] = Walker
Can you identify crimes from 1/08/2017 linked to those with the last name Walker?",Can you identify crimes from [x0.Crime.date:1/08/2017] linked to those with the last name [x1.Person.surname:Walker]?,"x0.Crime.date:1/08/2017 = 1/08/2017
x1.Person.surname:Walker = Walker",2,1,entity_set,1
852,Which crimes have Suzuki vehicles been part of?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Suzuki"")
RETURN x0","[Vehicle] = Suzuki
Which crimes have Suzuki vehicles been part of?",Which crimes have [x1.Vehicle.make:Suzuki] vehicles been part of?,x1.Vehicle.make:Suzuki = Suzuki,2,112,entity_set,15
241,Which phones got calls on 02/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""02/08/2017"")
RETURN x0","[PhoneCall] = 02/08/2017
Which phones got calls on 02/08/2017?",Which phones got calls on [x1.PhoneCall.call_date:02/08/2017]?,x1.PhoneCall.call_date:02/08/2017 = 02/08/2017,2,30,entity_set,34
2457,What is the number of individuals whose phone numbers are known by others?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)
RETURN COUNT(DISTINCT x0)",What is the number of individuals whose phone numbers are known by others?,What is the number of individuals whose phone numbers are known by others?,,2,340,count,1
3059,How many addresses are of people who have friends?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many addresses are of people who have friends?,How many addresses are of people who have friends?,,3,2,count,1
1151,Which violence and sexual offences are handled by officers with the surname Piche?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Piche"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Piche
Which violence and sexual offences are handled by officers with the surname Piche?",Which [x0.Crime.type:Violence and sexual offences] are handled by officers with the surname [x1.Officer.surname:Piche]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Officer.surname:Piche = Piche",2,152,entity_set,8
2507,How many Inspectors probed crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Inspector
How many Inspectors probed crimes?",How many [x0.Officer.rank:Inspector] probed crimes?,x0.Officer.rank:Inspector = Inspectors,2,350,count,1
257,What are the addresses of Williams family members?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Williams"")
RETURN x0","[Person] = Williams
What are the addresses of Williams family members?",What are the addresses of [x1.Person.surname:Williams] family members?,x1.Person.surname:Williams = Williams,2,31,entity_set,1
2808,How many emails associated with people named Craig  who were part of a crime on 31/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Craig"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Craig
[Crime] = 31/08/2017
How many emails associated with people named Craig  who were part of a crime on 31/08/2017?",How many emails associated with people named [x1.Person.name:Craig]  who were part of a crime on [x2.Crime.date:31/08/2017]?,"x1.Person.name:Craig = Craig
x2.Crime.date:31/08/2017 = 31/08/2017",3,409,count,1
670,What is the crime count at 116 China Lane?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""116 China Lane"")
RETURN COUNT(DISTINCT x0)","[Location] = 116 China Lane
What is the crime count at 116 China Lane?",What is the crime count at [x1.Location.address:116 China Lane]?,x1.Location.address:116 China Lane = 116 China Lane,2,89,count,1
894,Who has family ties to people whose surname is Hanson?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Hanson"")
RETURN x0","[Person] = Hanson
Who has family ties to people whose surname is Hanson?",Who has family ties to people whose surname is [x1.Person.surname:Hanson]?,x1.Person.surname:Hanson = Hanson,2,117,entity_set,6
846,Which crimes included the use of Daihatsu vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Daihatsu"")
RETURN x0","[Vehicle] = Daihatsu
Which crimes included the use of Daihatsu vehicles?",Which crimes included the use of [x1.Vehicle.make:Daihatsu] vehicles?,x1.Vehicle.make:Daihatsu = Daihatsu,2,112,entity_set,2
3505,What was the last crime reported at M33 4ND?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M33 4ND"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M33 4ND
What was the last crime reported at M33 4ND?",What was the last crime reported at [x2.PostCode.code:M33 4ND]?,x2.PostCode.code:M33 4ND = M33 4ND,3,103,max,1
209,How many crimes on 10/08/2017 were investigated by officers?,"MATCH (x0:Crime WHERE x0.date = ""10/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 10/08/2017
How many crimes on 10/08/2017 were investigated by officers?",How many crimes on [x0.Crime.date:10/08/2017] were investigated by officers?,x0.Crime.date:10/08/2017 = 10/08/2017,2,25,count,1
529,Which call lasted the longest to the number 4-(120)613-7532?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(120)613-7532"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 4-(120)613-7532
Which call lasted the longest to the number 4-(120)613-7532?",Which call lasted the longest to the number [x1.Phone.phoneNo:4-(120)613-7532]?,x1.Phone.phoneNo:4-(120)613-7532 = 4-(120)613-7532,2,69,max,1
1727,What is the number of vehicles linked to crimes on 6/08/2017?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""6/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 6/08/2017
What is the number of vehicles linked to crimes on 6/08/2017?",What is the number of vehicles linked to crimes on [x1.Crime.date:6/08/2017]?,x1.Crime.date:6/08/2017 = 6/08/2017,2,228,count,1
59,Who are all the people known by someone named Douglas?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Douglas"")
RETURN x0","[Person] = Douglas
Who are all the people known by someone named Douglas?",Who are all the people known by someone named [x1.Person.name:Douglas]?,x1.Person.name:Douglas = Douglas,2,7,entity_set,3
3037,What's the email of the person who has the phone number 4-(223)417-6164?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""4-(223)417-6164"")
RETURN x0","[Phone] = 4-(223)417-6164
What's the email of the person who has the phone number 4-(223)417-6164?",What's the email of the person who has the phone number [x2.Phone.phoneNo:4-(223)417-6164]?,x2.Phone.phoneNo:4-(223)417-6164 = 4-(223)417-6164,3,442,entity_set,1
383,Which is the latest crime case with Sigma vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Sigma"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Sigma
Which is the latest crime case with Sigma vehicles?",Which is the latest crime case with [x1.Vehicle.model:Sigma] vehicles?,x1.Vehicle.model:Sigma = Sigma,2,51,max,1
1095,Can you tell me the call count for 9-(488)105-0765?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(488)105-0765"")
RETURN COUNT(DISTINCT x0)","[Phone] = 9-(488)105-0765
Can you tell me the call count for 9-(488)105-0765?",Can you tell me the call count for [x1.Phone.phoneNo:9-(488)105-0765]?,x1.Phone.phoneNo:9-(488)105-0765 = 9-(488)105-0765,2,145,count,1
2133,Which phone call received among those with the last name Gilbert was the earliest?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gilbert"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[Person] = Gilbert
Which phone call received among those with the last name Gilbert was the earliest?",Which phone call received among those with the last name [x2.Person.surname:Gilbert] was the earliest?,x2.Person.surname:Gilbert = Gilbert,3,288,min,1
3563,What are the addresses of places where a crime occurred involving a person named Gary?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Gary"")
RETURN x0.address","[Person] = Gary
What are the addresses of places where a crime occurred involving a person named Gary?",What are the addresses of places where a crime occurred involving a person named [x2.Person.name:Gary]?,x2.Person.name:Gary = Gary,3,115,attribute_set,1
726,"Which places with the postcode SK6 1HE were crime scenes on August 16, 2017?","MATCH (x0:Location WHERE x0.postcode = ""SK6 1HE"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Location] = SK6 1HE
[Crime] = 16/08/2017
Which places with the postcode SK6 1HE were crime scenes on August 16, 2017?",Which places with the postcode [x0.Location.postcode:SK6 1HE] were crime scenes on [x1.Crime.date:16/08/2017]?,"x0.Location.postcode:SK6 1HE = SK6 1HE
x1.Crime.date:16/08/2017 = August 16, 2017",2,96,entity_set,1
2364,Which areas experienced crimes on 6/08/2017?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""6/08/2017"")
RETURN x0","[Crime] = 6/08/2017
Which areas experienced crimes on 6/08/2017?",Which areas experienced crimes on [x2.Crime.date:6/08/2017]?,x2.Crime.date:6/08/2017 = 6/08/2017,3,323,entity_set,897
2538,How many officers with the name Edd probed any crimes?,"MATCH (x0:Officer WHERE x0.name = ""Edd"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Edd
How many officers with the name Edd probed any crimes?",How many officers with the name [x0.Officer.name:Edd] probed any crimes?,x0.Officer.name:Edd = Edd,2,354,count,1
2108,Who are the individuals with the phone number 7-(469)440-8216?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""7-(469)440-8216"")
RETURN x0","[Phone] = 7-(469)440-8216
Who are the individuals with the phone number 7-(469)440-8216?",Who are the individuals with the phone number [x1.Phone.phoneNo:7-(469)440-8216]?,x1.Phone.phoneNo:7-(469)440-8216 = 7-(469)440-8216,2,285,entity_set,1
952,"Who were the officers investigating crimes on August 24, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN x0","[Crime] = 24/08/2017
Who were the officers investigating crimes on August 24, 2017?",Who were the officers investigating crimes on [x1.Crime.date:24/08/2017]?,"x1.Crime.date:24/08/2017 = August 24, 2017",2,125,entity_set,957
4519,When was the earliest crime at Piccadilly that Boydell looked into?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Piccadilly"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Boydell"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = Piccadilly
[Officer] = Boydell
When was the earliest crime at Piccadilly that Boydell looked into?",When was the earliest crime at [x1.Location.address:Piccadilly] that [x2.Officer.surname:Boydell] looked into?,"x1.Location.address:Piccadilly = Piccadilly
x2.Officer.surname:Boydell = Boydell",3,48,argmin,1
348,Which crimes occurred most recently at 177 Gerald Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""177 Gerald Road"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 177 Gerald Road
Which crimes occurred most recently at 177 Gerald Road?",Which crimes occurred most recently at [x1.Location.address:177 Gerald Road]?,x1.Location.address:177 Gerald Road = 177 Gerald Road,2,43,max,1
2093,What are the 71-second calls to 6-(957)226-3476?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""71"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""6-(957)226-3476"")
RETURN x0","[PhoneCall] = 71
[Phone] = 6-(957)226-3476
What are the 71-second calls to 6-(957)226-3476?",What are the [x0.PhoneCall.call_duration:71]-second calls to [x1.Phone.phoneNo:6-(957)226-3476]?,"x0.PhoneCall.call_duration:71 = 71
x1.Phone.phoneNo:6-(957)226-3476 = 6-(957)226-3476",2,283,entity_set,2
2748,Can you provide the emails of individuals familiar with a person whose NHS number is 756-76-4958?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""756-76-4958"")
RETURN x0","[Person] = 756-76-4958
Can you provide the emails of individuals familiar with a person whose NHS number is 756-76-4958?",Can you provide the emails of individuals familiar with a person whose NHS number is [x2.Person.nhs_no:756-76-4958]?,x2.Person.nhs_no:756-76-4958 = 756-76-4958,3,398,entity_set,2
2731,Who is the senior-most family member linked to a friend of a Bradley?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Bradley"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Bradley
Who is the senior-most family member linked to a friend of a Bradley?",Who is the senior-most family member linked to a friend of a [x2.Person.surname:Bradley]?,x2.Person.surname:Bradley = Bradley,3,396,max,1
3339,Can you identify everyone living in the WN5 region?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""WN5"")
RETURN x0","[Area] = WN5
Can you identify everyone living in the WN5 region?",Can you identify everyone living in the [x2.Area.areaCode:WN5] region?,x2.Area.areaCode:WN5 = WN5,3,43,entity_set,5
3675,Can you provide the NHS numbers for people related to a resident of the M33 3WE postcode?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M33 3WE"")
RETURN x0.nhs_no","[Location] = M33 3WE
Can you provide the NHS numbers for people related to a resident of the M33 3WE postcode?",Can you provide the NHS numbers for people related to a resident of the [x2.Location.postcode:M33 3WE] postcode?,x2.Location.postcode:M33 3WE = M33 3WE,3,172,attribute_set,2
1859,How many phones do people with surname Rose own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Rose"")
RETURN COUNT(DISTINCT x0)","[Person] = Rose
How many phones do people with surname Rose own?",How many phones do people with surname [x1.Person.surname:Rose] own?,x1.Person.surname:Rose = Rose,2,249,count,1
