id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1618,What kinds of offenses occurred at 131 Fern Close?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""131 Fern Close"")
RETURN x0.type","[Location] = 131 Fern Close
What kinds of offenses occurred at 131 Fern Close?",What kinds of offenses occurred at [x1.Location.address:131 Fern Close]?,x1.Location.address:131 Fern Close = 131 Fern Close,2,213,attribute_set,3
1851,Can you provide the zip code for 116 China Lane?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location WHERE x1.address = ""116 China Lane"")
RETURN x0","[Location] = 116 China Lane
Can you provide the zip code for 116 China Lane?",Can you provide the zip code for [x1.Location.address:116 China Lane]?,x1.Location.address:116 China Lane = 116 China Lane,2,247,entity_set,1
4457,What's the status of the first crime involving someone with the phone number linked to NHS number 800-46-2184?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""800-46-2184"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 800-46-2184
What's the status of the first crime involving someone with the phone number linked to NHS number 800-46-2184?",What's the status of the first crime involving someone with the phone number linked to NHS number [x2.Person.nhs_no:800-46-2184]?,x2.Person.nhs_no:800-46-2184 = 800-46-2184,3,32,argmin,1
3418,What crimes were committed at the home of someone named Peter?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Peter"")
RETURN x0","[Person] = Peter
What crimes were committed at the home of someone named Peter?",What crimes were committed at the home of someone named [x2.Person.name:Peter]?,x2.Person.name:Peter = Peter,3,63,entity_set,9
3331,Could you list where people known by anyone named Denise live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.name = ""Denise"")
RETURN x0.address","[Person] = Denise
Could you list where people known by anyone named Denise live?",Could you list where people known by anyone named [x2.Person.name:Denise] live?,x2.Person.name:Denise = Denise,3,42,attribute_set,8
748,What are the locations with the postcode OL10 2JL where someone named Raymond lives?,"MATCH (x0:Location WHERE x0.postcode = ""OL10 2JL"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Raymond"")
RETURN x0","[Location] = OL10 2JL
[Person] = Raymond
What are the locations with the postcode OL10 2JL where someone named Raymond lives?",What are the locations with the postcode [x0.Location.postcode:OL10 2JL] where someone named [x1.Person.name:Raymond] lives?,"x0.Location.postcode:OL10 2JL = OL10 2JL
x1.Person.name:Raymond = Raymond",2,99,entity_set,1
884,Can you provide the emails for people whose NHS number is 820-53-4909?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""820-53-4909"")
RETURN x0","[Person] = 820-53-4909
Can you provide the emails for people whose NHS number is 820-53-4909?",Can you provide the emails for people whose NHS number is [x1.Person.nhs_no:820-53-4909]?,x1.Person.nhs_no:820-53-4909 = 820-53-4909,2,116,entity_set,1
3634,Which people share a home with someone familiar with an individual surnamed Washington?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Washington"")
RETURN x0","[Person] = Washington
Which people share a home with someone familiar with an individual surnamed Washington?",Which people share a home with someone familiar with an individual surnamed [x2.Person.surname:Washington]?,x2.Person.surname:Washington = Washington,3,151,entity_set,2
195,What is the count of 91-second phone calls made?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""91"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 91
What is the count of 91-second phone calls made?",What is the count of [x0.PhoneCall.call_duration:91]-second phone calls made?,x0.PhoneCall.call_duration:91 = 91,2,23,count,1
761,Which crime happened first at 68 Haigh Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""68 Haigh Road"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 68 Haigh Road
Which crime happened first at 68 Haigh Road?",Which crime happened first at [x1.Location.address:68 Haigh Road]?,x1.Location.address:68 Haigh Road = 68 Haigh Road,2,100,min,1
4541,Who are the individuals acquainted with a friend of the person holding NHS number 276-19-9235?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""276-19-9235"")
RETURN x0","[Person] = 276-19-9235
Who are the individuals acquainted with a friend of the person holding NHS number 276-19-9235?",Who are the individuals acquainted with a friend of the person holding NHS number [x2.Person.nhs_no:276-19-9235]?,x2.Person.nhs_no:276-19-9235 = 276-19-9235,3,54,entity_set,23
1721,How many Patricias reside with individuals surnamed Mccoy?,"MATCH (x0:Person WHERE x0.name = ""Patricia"")-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Mccoy"")
RETURN COUNT(DISTINCT x0)","[Person] = Patricia
[Person] = Mccoy
How many Patricias reside with individuals surnamed Mccoy?",How many [x0.Person.name:Patricia] reside with individuals surnamed [x1.Person.surname:Mccoy]?,"x0.Person.name:Patricia = Patricias
x1.Person.surname:Mccoy = Mccoy",2,226,count,1
2144,"How many phones got a call on August 25, 2017?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""25/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 25/08/2017
How many phones got a call on August 25, 2017?",How many phones got a call on [x1.PhoneCall.call_date:25/08/2017]?,"x1.PhoneCall.call_date:25/08/2017 = August 25, 2017",2,289,count,1
2810,How many emails exist from individuals named Phillip who were connected to a crime on 6/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Phillip"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""6/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Phillip
[Crime] = 6/08/2017
How many emails exist from individuals named Phillip who were connected to a crime on 6/08/2017?",How many emails exist from individuals named [x1.Person.name:Phillip] who were connected to a crime on [x2.Crime.date:6/08/2017]?,"x1.Person.name:Phillip = Phillip
x2.Crime.date:6/08/2017 = 6/08/2017",3,409,count,1
576,Can you provide the residences with postcode M28 7FY for the person with NHS number 520-74-1446?,"MATCH (x0:Location WHERE x0.postcode = ""M28 7FY"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""520-74-1446"")
RETURN x0","[Location] = M28 7FY
[Person] = 520-74-1446
Can you provide the residences with postcode M28 7FY for the person with NHS number 520-74-1446?",Can you provide the residences with postcode [x0.Location.postcode:M28 7FY] for the person with NHS number [x1.Person.nhs_no:520-74-1446]?,"x0.Location.postcode:M28 7FY = M28 7FY
x1.Person.nhs_no:520-74-1446 = 520-74-1446",2,76,entity_set,1
2518,Which locations fall under the M6 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M6"")
RETURN x0","[Area] = M6
Which locations fall under the M6 area code?",Which locations fall under the [x1.Area.areaCode:M6] area code?,x1.Area.areaCode:M6 = M6,2,351,entity_set,200
3679,Can you identify the Mercedes-Benz models involved in crimes under investigation by badge 44-0158566?,"MATCH (x0:Vehicle WHERE x0.make = ""Mercedes-Benz"")-[:INVOLVED_IN]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""44-0158566"")
RETURN x0.model","[Vehicle] = Mercedes-Benz
[Officer] = 44-0158566
Can you identify the Mercedes-Benz models involved in crimes under investigation by badge 44-0158566?",Can you identify the [x0.Vehicle.make:Mercedes-Benz] models involved in crimes under investigation by badge [x2.Officer.badge_no:44-0158566]?,"x0.Vehicle.make:Mercedes-Benz = Mercedes-Benz
x2.Officer.badge_no:44-0158566 = 44-0158566",3,176,attribute_set,1
4424,What is the address of the person whose phone number is 7-(469)440-8216?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""7-(469)440-8216"")
RETURN x0.address","[Phone] = 7-(469)440-8216
What is the address of the person whose phone number is 7-(469)440-8216?",What is the address of the person whose phone number is [x2.Phone.phoneNo:7-(469)440-8216]?,x2.Phone.phoneNo:7-(469)440-8216 = 7-(469)440-8216,3,16,attribute_set,1
3064,Can you provide the NHS numbers for people related to a John who lives with someone else?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""John"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = John
Can you provide the NHS numbers for people related to a John who lives with someone else?",Can you provide the NHS numbers for people related to a [x1.Person.name:John] who lives with someone else?,x1.Person.name:John = John,3,3,attribute_set,2
1030,How many homes have the postcode M22 5EZ?,"MATCH (x0:Location WHERE x0.postcode = ""M22 5EZ"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = M22 5EZ
How many homes have the postcode M22 5EZ?",How many homes have the postcode [x0.Location.postcode:M22 5EZ]?,x0.Location.postcode:M22 5EZ = M22 5EZ,2,136,count,1
1642,When did an officer with last name Gronow last investigate a crime at 188 Hathaway Gardens?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Gronow"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""188 Hathaway Gardens"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = Gronow
[Location] = 188 Hathaway Gardens
When did an officer with last name Gronow last investigate a crime at 188 Hathaway Gardens?",When did an officer with last name [x2.Officer.surname:Gronow] last investigate a crime at [x1.Location.address:188 Hathaway Gardens]?,"x1.Location.address:188 Hathaway Gardens = 188 Hathaway Gardens
x2.Officer.surname:Gronow = Gronow",3,216,argmax,1
2127,Can you name everyone sharing a home with someone?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)
RETURN x0",Can you name everyone sharing a home with someone?,Can you name everyone sharing a home with someone?,,2,287,entity_set,160
2552,What is the number of crimes involving a person?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)",What is the number of crimes involving a person?,What is the number of crimes involving a person?,,2,357,count,1
867,How many acquaintances does anyone with the last name George have?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""George"")
RETURN COUNT(DISTINCT x0)","[Person] = George
How many acquaintances does anyone with the last name George have?",How many acquaintances does anyone with the last name [x1.Person.surname:George] have?,x1.Person.surname:George = George,2,114,count,1
2761,"How many emails are there for Jack, who has a family tie to a Ward?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Jack"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Ward"")
RETURN COUNT(DISTINCT x0)","[Person] = Jack
[Person] = Ward
How many emails are there for Jack, who has a family tie to a Ward?","How many emails are there for [x1.Person.name:Jack], who has a family tie to a [x2.Person.surname:Ward]?","x1.Person.name:Jack = Jack
x2.Person.surname:Ward = Ward",3,400,count,1
2099,What are the 10-second calls made to 9-(016)868-6919?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""10"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(016)868-6919"")
RETURN x0","[PhoneCall] = 10
[Phone] = 9-(016)868-6919
What are the 10-second calls made to 9-(016)868-6919?",What are the [x0.PhoneCall.call_duration:10]-second calls made to [x1.Phone.phoneNo:9-(016)868-6919]?,"x0.PhoneCall.call_duration:10 = 10
x1.Phone.phoneNo:9-(016)868-6919 = 9-(016)868-6919",2,283,entity_set,2
2305,What are the emails of those named Benjamin?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Benjamin"")
RETURN x0","[Person] = Benjamin
What are the emails of those named Benjamin?",What are the emails of those named [x1.Person.name:Benjamin]?,x1.Person.name:Benjamin = Benjamin,2,311,entity_set,2
375,Which officers named Melodie were involved in crime investigations on 27/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Melodie"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""27/08/2017"")
RETURN x0","[Officer] = Melodie
[Crime] = 27/08/2017
Which officers named Melodie were involved in crime investigations on 27/08/2017?",Which officers named [x0.Officer.name:Melodie] were involved in crime investigations on [x1.Crime.date:27/08/2017]?,"x0.Officer.name:Melodie = Melodie
x1.Crime.date:27/08/2017 = 27/08/2017",2,49,entity_set,2
2440,How many spots fall under the BL3 code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""BL3"")
RETURN COUNT(DISTINCT x0)","[Area] = BL3
How many spots fall under the BL3 code?",How many spots fall under the [x1.Area.areaCode:BL3] code?,x1.Area.areaCode:BL3 = BL3,2,337,count,1
3380,What is the most recent crime involving an acquaintance of the person with NHS number 873-28-7561?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 873-28-7561
What is the most recent crime involving an acquaintance of the person with NHS number 873-28-7561?",What is the most recent crime involving an acquaintance of the person with NHS number [x2.Person.nhs_no:873-28-7561]?,x2.Person.nhs_no:873-28-7561 = 873-28-7561,3,49,max,1
2037,What was the longest duration of calls to phones that placed calls on 18/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""18/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 18/08/2017
What was the longest duration of calls to phones that placed calls on 18/08/2017?",What was the longest duration of calls to phones that placed calls on [x2.PhoneCall.call_date:18/08/2017]?,x2.PhoneCall.call_date:18/08/2017 = 18/08/2017,3,273,argmax,1
3314,What are the surnames of residents in areas where burglaries happened?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Burglary"")
RETURN x0.surname","[Crime] = Burglary
What are the surnames of residents in areas where burglaries happened?",What are the surnames of residents in areas where [x2.Crime.type:Burglary] happened?,x2.Crime.type:Burglary = burglaries,3,41,attribute_set,62
1899,"How many 2009 cars were part of crimes on August 11, 2017?","MATCH (x0:Vehicle WHERE x0.year = ""2009"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2009
[Crime] = 11/08/2017
How many 2009 cars were part of crimes on August 11, 2017?",How many [x0.Vehicle.year:2009] cars were part of crimes on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.year:2009 = 2009
x1.Crime.date:11/08/2017 = August 11, 2017",2,253,count,1
693,Which individuals are familiar with anyone with last name Russell?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Russell"")
RETURN x0.name","[Person] = Russell
Which individuals are familiar with anyone with last name Russell?",Which individuals are familiar with anyone with last name [x1.Person.surname:Russell]?,x1.Person.surname:Russell = Russell,2,92,attribute_set,5
1149,Can you identify the violent and sexual offences probed by officers whose last name is Braizier?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Braizier"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Braizier
Can you identify the violent and sexual offences probed by officers whose last name is Braizier?",Can you identify the [x0.Crime.type:Violence and sexual offences] probed by officers whose last name is [x1.Officer.surname:Braizier]?,"x0.Crime.type:Violence and sexual offences = violent and sexual offences 
x1.Officer.surname:Braizier = Braizier",2,152,entity_set,7
4412,Which is the newest vehicle used in a crime at 129 George Street?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 129 George Street
Which is the newest vehicle used in a crime at 129 George Street?",Which is the newest vehicle used in a crime at [x2.Location.address:129 George Street]?,x2.Location.address:129 George Street = 129 George Street,3,12,max,1
1891,What phones completed a call of 79 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""79"")
RETURN x0","[PhoneCall] = 79
What phones completed a call of 79 seconds?",What phones completed a call of [x1.PhoneCall.call_duration:79] seconds?,x1.PhoneCall.call_duration:79 = 79,2,252,entity_set,4
2000,What crimes occurred on 31/08/2017 that Police Constables are investigating?,"MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 31/08/2017
[Officer] = Police Constable
What crimes occurred on 31/08/2017 that Police Constables are investigating?",What crimes occurred on [x0.Crime.date:31/08/2017] that [x1.Officer.rank:Police Constable] are investigating?,"x0.Crime.date:31/08/2017 = 31/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,346
2273,How many individuals live with someone named Phillip?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Phillip"")
RETURN COUNT(DISTINCT x0)","[Person] = Phillip
How many individuals live with someone named Phillip?",How many individuals live with someone named [x1.Person.name:Phillip]?,x1.Person.name:Phillip = Phillip,2,306,count,1
835,How old is the youngest individual residing with a Hunter?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hunter"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Hunter
How old is the youngest individual residing with a Hunter?",How old is the youngest individual residing with a [x1.Person.surname:Hunter]?,x1.Person.surname:Hunter = Hunter,2,111,argmin,1
259,How many crimes on 20/08/2017 involved a 2500 Club Coupe vehicle?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""2500 Club Coupe"")
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
[Vehicle] = 2500 Club Coupe
How many crimes on 20/08/2017 involved a 2500 Club Coupe vehicle?",How many crimes on [x0.Crime.date:20/08/2017] involved a [x1.Vehicle.model:2500 Club Coupe] vehicle?,"x0.Crime.date:20/08/2017 = 20/08/2017
x1.Vehicle.model:2500 Club Coupe = 2500 Club Coupe",2,32,count,1
1116,Which emails belong to individuals familiar with anyone whose last name is Rice?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Rice"")
RETURN x0","[Person] = Rice
Which emails belong to individuals familiar with anyone whose last name is Rice?",Which emails belong to individuals familiar with anyone whose last name is [x2.Person.surname:Rice]?,x2.Person.surname:Rice = Rice,3,147,entity_set,14
943,How many calls were received by any phone on 18/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18/08/2017
How many calls were received by any phone on 18/08/2017?",How many calls were received by any phone on [x0.PhoneCall.call_date:18/08/2017]?,x0.PhoneCall.call_date:18/08/2017 = 18/08/2017,2,124,count,1
1765,Can you name the areas related to postcode OL9 8HD?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL9 8HD"")
RETURN x0","[PostCode] = OL9 8HD
Can you name the areas related to postcode OL9 8HD?",Can you name the areas related to postcode [x1.PostCode.code:OL9 8HD]?,x1.PostCode.code:OL9 8HD = OL9 8HD,2,234,entity_set,1
2652,What emails belong to those who are friends with a person with surname Alexander?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Alexander"")
RETURN x0","[Person] = Alexander
What emails belong to those who are friends with a person with surname Alexander?",What emails belong to those who are friends with a person with surname [x2.Person.surname:Alexander]?,x2.Person.surname:Alexander = Alexander,3,382,entity_set,10
1327,How many regions contain places with the postcode M16 9PW?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M16 9PW"")
RETURN COUNT(DISTINCT x0)","[Location] = M16 9PW
How many regions contain places with the postcode M16 9PW?",How many regions contain places with the postcode [x1.Location.postcode:M16 9PW]?,x1.Location.postcode:M16 9PW = M16 9PW,2,175,count,1
3354,Can you provide the email addresses for individuals residing in the M3 4NW postcode?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.email_address","[Location] = M3 4NW
Can you provide the email addresses for individuals residing in the M3 4NW postcode?",Can you provide the email addresses for individuals residing in the [x2.Location.postcode:M3 4NW] postcode?,x2.Location.postcode:M3 4NW = M3 4NW,3,45,attribute_set,3
3376,Can you find the oldest crime date at 192 Thelwall Road investigated by someone with surname Dumingo?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Dumingo"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""192 Thelwall Road"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Dumingo
[Location] = 192 Thelwall Road
Can you find the oldest crime date at 192 Thelwall Road investigated by someone with surname Dumingo?",Can you find the oldest crime date at [x2.Location.address:192 Thelwall Road] investigated by someone with surname [x1.Officer.surname:Dumingo]?,"x1.Officer.surname:Dumingo = Dumingo
x2.Location.address:192 Thelwall Road = 192 Thelwall Road",3,48,argmin,1
3378,What is the latest offense linked to someone familiar with the individual holding NHS number 249-54-6589?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""249-54-6589"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 249-54-6589
What is the latest offense linked to someone familiar with the individual holding NHS number 249-54-6589?",What is the latest offense linked to someone familiar with the individual holding NHS number [x2.Person.nhs_no:249-54-6589]?,x2.Person.nhs_no:249-54-6589 = 249-54-6589,3,49,max,1
2865,How many crimes do Sergeants investigate that involve someone with surname Williamson?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Person] = Williamson
How many crimes do Sergeants investigate that involve someone with surname Williamson?",How many crimes do [x2.Officer.rank:Sergeant] investigate that involve someone with surname [x1.Person.surname:Williamson]?,"x1.Person.surname:Williamson = Williamson
x2.Officer.rank:Sergeant = Sergeants",3,416,count,1
914,What's the count of people who befriend someone with the surname Duncan?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Duncan"")
RETURN COUNT(DISTINCT x0)","[Person] = Duncan
What's the count of people who befriend someone with the surname Duncan?",What's the count of people who befriend someone with the surname [x1.Person.surname:Duncan]?,x1.Person.surname:Duncan = Duncan,2,119,count,1
301,"In how many places were crimes marked as ""Investigation complete; no suspect found""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
In how many places were crimes marked as ""Investigation complete; no suspect found""?","In how many places were crimes marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?",x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect found,2,38,count,1
1084,How many devices completed a 66-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""66"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
How many devices completed a 66-second call?",How many devices completed a [x1.PhoneCall.call_duration:66]-second call?,x1.PhoneCall.call_duration:66 = 66,2,144,count,1
3547,Can you provide the dates for violence and sexual offences in the M14 region?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M14"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = M14
Can you provide the dates for violence and sexual offences in the M14 region?",Can you provide the dates for [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:M14] region?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x2.Area.areaCode:M14 = M14",3,111,attribute_set,144
3115,What are the oldest calls made to a phone that received a call at 00:32?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""00:32"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 00:32
What are the oldest calls made to a phone that received a call at 00:32?",What are the oldest calls made to a phone that received a call at [x2.PhoneCall.call_time:00:32]?,x2.PhoneCall.call_time:00:32 = 00:32,3,10,min,1
1297,How many 37-second calls were received on any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""37"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 37
How many 37-second calls were received on any phone?",How many [x0.PhoneCall.call_duration:37]-second calls were received on any phone?,x0.PhoneCall.call_duration:37 = 37,2,172,count,1
265,How many crimes on 21/08/2017 involved C-Class vehicles?,"MATCH (x0:Crime WHERE x0.date = ""21/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""C-Class"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
[Vehicle] = C-Class
How many crimes on 21/08/2017 involved C-Class vehicles?",How many crimes on [x0.Crime.date:21/08/2017] involved [x1.Vehicle.model:C-Class] vehicles?,"x0.Crime.date:21/08/2017 = 21/08/2017
x1.Vehicle.model:C-Class = C-Class",2,32,count,1
2799,What are the emails of those living at 189 Jopson Street?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""189 Jopson Street"")
RETURN x0","[Location] = 189 Jopson Street
What are the emails of those living at 189 Jopson Street?",What are the emails of those living at [x2.Location.address:189 Jopson Street]?,x2.Location.address:189 Jopson Street = 189 Jopson Street,3,408,entity_set,2
2020,"How many cases, labeled ""Investigation complete; no suspect identified,"" involved C30 model cars?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""C30"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = C30
How many cases, labeled ""Investigation complete; no suspect identified,"" involved C30 model cars?","How many cases, labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" involved [x1.Vehicle.model:C30] model cars?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:C30 = C30",2,270,count,1
4,Which offenses on 20th August 2017 involved people with the surname Murray?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN x0","[Crime] = 20/08/2017
[Person] = Murray
Which offenses on 20th August 2017 involved people with the surname Murray?",Which offenses on [x0.Crime.date:20/08/2017] involved people with the surname [x1.Person.surname:Murray]?,"x0.Crime.date:20/08/2017 = 20th August 2017 
x1.Person.surname:Murray = Murray",2,1,entity_set,1
2955,When did officer 47-5316983 last investigate a Safari vehicle crime?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""47-5316983"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Safari"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 47-5316983
[Vehicle] = Safari
When did officer 47-5316983 last investigate a Safari vehicle crime?",When did officer [x2.Officer.badge_no:47-5316983] last investigate a [x1.Vehicle.model:Safari] vehicle crime?,"x1.Vehicle.model:Safari = Safari
x2.Officer.badge_no:47-5316983 = 47-5316983",3,429,argmax,1
2613,What is the number of investigations handled by officers with the surname Tzarkov?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tzarkov"")
RETURN COUNT(DISTINCT x0)","[Officer] = Tzarkov
What is the number of investigations handled by officers with the surname Tzarkov?",What is the number of investigations handled by officers with the surname [x1.Officer.surname:Tzarkov]?,x1.Officer.surname:Tzarkov = Tzarkov,2,372,count,1
1248,How many incidents on 31st August 2017 were looked into by officers whose last name is Taks?,"MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Taks"")
RETURN COUNT(DISTINCT x0)","[Crime] = 31/08/2017
[Officer] = Taks
How many incidents on 31st August 2017 were looked into by officers whose last name is Taks?",How many incidents on [x0.Crime.date:31/08/2017] were looked into by officers whose last name is [x1.Officer.surname:Taks]?,"x0.Crime.date:31/08/2017 = 31st August 2017 
x1.Officer.surname:Taks = Taks",2,166,count,1
445,"Who are the officers who investigated crimes marked as ""Investigation complete; no suspect identified""?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
Who are the officers who investigated crimes marked as ""Investigation complete; no suspect identified""?","Who are the officers who investigated crimes marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?",x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified,2,59,entity_set,17087
3276,What is the phone number of a friend of the person with NHS number 893-63-6176?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""893-63-6176"")
RETURN x0.phoneNo","[Person] = 893-63-6176
What is the phone number of a friend of the person with NHS number 893-63-6176?",What is the phone number of a friend of the person with NHS number [x2.Person.nhs_no:893-63-6176]?,x2.Person.nhs_no:893-63-6176 = 893-63-6176,3,35,attribute_set,9
634,Who knows the phone number of someone with last name Campbell?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Campbell"")
RETURN x0","[Person] = Campbell
Who knows the phone number of someone with last name Campbell?",Who knows the phone number of someone with last name [x1.Person.surname:Campbell]?,x1.Person.surname:Campbell = Campbell,2,84,entity_set,2
2310,Can you provide the emails for individuals named Ann?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Ann"")
RETURN x0","[Person] = Ann
Can you provide the emails for individuals named Ann?",Can you provide the emails for individuals named [x1.Person.name:Ann]?,x1.Person.name:Ann = Ann,2,311,entity_set,1
