id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1689,How many criminal incidents took place at 128 Waddington Close on 3rd August 2017?,"MATCH (x0:Crime WHERE x0.date = ""3/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""128 Waddington Close"")
RETURN COUNT(DISTINCT x0)","[Crime] = 3/08/2017
[Location] = 128 Waddington Close
How many criminal incidents took place at 128 Waddington Close on 3rd August 2017?",How many criminal incidents took place at [x1.Location.address:128 Waddington Close] on [x0.Crime.date:3/08/2017]?,"x0.Crime.date:3/08/2017 = 3rd August 2017 
x1.Location.address:128 Waddington Close = 128 Waddington Close",2,223,count,1
298,What burglaries happened at 111 Colchester Close?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""111 Colchester Close"")
RETURN x0","[Crime] = Burglary
[Location] = 111 Colchester Close
What burglaries happened at 111 Colchester Close?",What [x0.Crime.type:Burglary] happened at [x1.Location.address:111 Colchester Close]?,"x0.Crime.type:Burglary = burglaries 
x1.Location.address:111 Colchester Close = 111 Colchester Close",2,37,entity_set,1
3285,What is the latest call made to a phone owned by a person with NHS number 456-41-9569?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""456-41-9569"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 456-41-9569
What is the latest call made to a phone owned by a person with NHS number 456-41-9569?",What is the latest call made to a phone owned by a person with NHS number [x2.Person.nhs_no:456-41-9569]?,x2.Person.nhs_no:456-41-9569 = 456-41-9569,3,36,max,1
4520,When did the first crime happen at 19 Lily Avenue that Officer Havill investigated?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""19 Lily Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Havill"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 19 Lily Avenue
[Officer] = Havill
When did the first crime happen at 19 Lily Avenue that Officer Havill investigated?",When did the first crime happen at [x1.Location.address:19 Lily Avenue] that Officer [x2.Officer.surname:Havill] investigated?,"x1.Location.address:19 Lily Avenue = 19 Lily Avenue
x2.Officer.surname:Havill = Havill",3,48,argmin,1
4575,Which officer handled the investigation of the crime linked to the person with NHS number 873-28-7561?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0","[Person] = 873-28-7561
Which officer handled the investigation of the crime linked to the person with NHS number 873-28-7561?",Which officer handled the investigation of the crime linked to the person with NHS number [x2.Person.nhs_no:873-28-7561]?,x2.Person.nhs_no:873-28-7561 = 873-28-7561,3,67,entity_set,2
579,Can you provide the residences with postcode BL6 6HF for the individual holding NHS number 303-86-0371?,"MATCH (x0:Location WHERE x0.postcode = ""BL6 6HF"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""303-86-0371"")
RETURN x0","[Location] = BL6 6HF
[Person] = 303-86-0371
Can you provide the residences with postcode BL6 6HF for the individual holding NHS number 303-86-0371?",Can you provide the residences with postcode [x0.Location.postcode:BL6 6HF] for the individual holding NHS number [x1.Person.nhs_no:303-86-0371]?,"x0.Location.postcode:BL6 6HF = BL6 6HF
x1.Person.nhs_no:303-86-0371 = 303-86-0371",2,76,entity_set,1
1319,"At 20:36, how many calls were directed to 7-(492)933-2044?","MATCH (x0:PhoneCall WHERE x0.call_time = ""20:36"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(492)933-2044"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20:36
[Phone] = 7-(492)933-2044
At 20:36, how many calls were directed to 7-(492)933-2044?","At [x0.PhoneCall.call_time:20:36], how many calls were directed to [x1.Phone.phoneNo:7-(492)933-2044]?","x0.PhoneCall.call_time:20:36 = 20:36
x1.Phone.phoneNo:7-(492)933-2044 = 7-(492)933-2044",2,174,count,1
2872,Can you list the emails of people who are friends with Arthur?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Arthur"")
RETURN x0","[Person] = Arthur
Can you list the emails of people who are friends with Arthur?",Can you list the emails of people who are friends with [x2.Person.name:Arthur]?,x2.Person.name:Arthur = Arthur,3,417,entity_set,8
1067,What is the number of phones owned by a person called Amy?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
What is the number of phones owned by a person called Amy?",What is the number of phones owned by a person called [x1.Person.name:Amy]?,x1.Person.name:Amy = Amy,2,142,count,1
89,What are the ages of individuals residing with someone with surname Austin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0.age","[Person] = Austin
What are the ages of individuals residing with someone with surname Austin?",What are the ages of individuals residing with someone with surname [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,11,attribute_set,4
3416,What offenses occurred at Peter's house?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.name = ""Peter"")
RETURN x0","[Person] = Peter
What offenses occurred at Peter's house?",What offenses occurred at [x2.Person.name:Peter]'s house?,x2.Person.name:Peter = Peter,3,63,entity_set,9
1603,How many phones took a call for 27 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""27"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 27
How many phones took a call for 27 seconds?",How many phones took a call for [x1.PhoneCall.call_duration:27] seconds?,x1.PhoneCall.call_duration:27 = 27,2,212,count,1
594,What is the age of the oldest individual familiar with someone with surname Murphy?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Murphy"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Murphy
What is the age of the oldest individual familiar with someone with surname Murphy?",What is the age of the oldest individual familiar with someone with surname [x1.Person.surname:Murphy]?,x1.Person.surname:Murphy = Murphy,2,78,argmin,1
1575,Can you provide a list of crimes in the places with WA15 9DZ postcode?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WA15 9DZ"")
RETURN x0","[Location] = WA15 9DZ
Can you provide a list of crimes in the places with WA15 9DZ postcode?",Can you provide a list of crimes in the places with [x1.Location.postcode:WA15 9DZ] postcode?,x1.Location.postcode:WA15 9DZ = WA15 9DZ,2,209,entity_set,1
2209,"How many investigations labeled ""complete with no suspect"" involve Sergeants?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Officer] = Sergeant
How many investigations labeled ""complete with no suspect"" involve Sergeants?","How many investigations labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" involve [x1.Officer.rank:Sergeant]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = complete with no suspect 
x1.Officer.rank:Sergeant = Sergeants",2,298,count,1
16,How many cases still under investigation are assigned to officers whose last name is Yukhnevich?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Yukhnevich"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = Yukhnevich
How many cases still under investigation are assigned to officers whose last name is Yukhnevich?",How many cases still [x0.Crime.last_outcome:Under investigation] are assigned to officers whose last name is [x1.Officer.surname:Yukhnevich]?,"x0.Crime.last_outcome:Under investigation = under investigation
x1.Officer.surname:Yukhnevich = Yukhnevich",2,2,count,1
591,What is the age of the oldest individual familiar with someone with surname Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Nguyen
What is the age of the oldest individual familiar with someone with surname Nguyen?",What is the age of the oldest individual familiar with someone with surname [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,78,argmin,1
2459,Which is the earliest crime involving an XLR model that was investigated by an officer with last name Stodart?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Stodart"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""XLR"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stodart
[Vehicle] = XLR
Which is the earliest crime involving an XLR model that was investigated by an officer with last name Stodart?",Which is the earliest crime involving an [x1.Vehicle.model:XLR] model that was investigated by an officer with last name [x2.Officer.surname:Stodart]?,"x1.Vehicle.model:XLR = XLR
x2.Officer.surname:Stodart = Stodart",3,341,min,1
2757,"What is the email count for Eric, who is related to a Jackson?","MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Eric"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Jackson"")
RETURN COUNT(DISTINCT x0)","[Person] = Eric
[Person] = Jackson
What is the email count for Eric, who is related to a Jackson?","What is the email count for [x1.Person.name:Eric], who is related to a [x2.Person.surname:Jackson]?","x1.Person.name:Eric = Eric
x2.Person.surname:Jackson = Jackson",3,400,count,1
468,Which criminal activities involve those bearing the last name Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN x0","[Person] = Morales
Which criminal activities involve those bearing the last name Morales?",Which criminal activities involve those bearing the last name [x1.Person.surname:Morales]?,x1.Person.surname:Morales = Morales,2,61,entity_set,4
4542,Can you identify everyone who knows a friend of the individual with NHS number 276-19-9235?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""276-19-9235"")
RETURN x0","[Person] = 276-19-9235
Can you identify everyone who knows a friend of the individual with NHS number 276-19-9235?",Can you identify everyone who knows a friend of the individual with NHS number [x2.Person.nhs_no:276-19-9235]?,x2.Person.nhs_no:276-19-9235 = 276-19-9235,3,54,entity_set,23
690,How many officers conducted crime investigations?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",How many officers conducted crime investigations?,How many officers conducted crime investigations?,,2,91,count,1
3381,What was the latest offense connected to someone familiar with the individual holding NHS number 873-28-7561?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 873-28-7561
What was the latest offense connected to someone familiar with the individual holding NHS number 873-28-7561?",What was the latest offense connected to someone familiar with the individual holding NHS number [x2.Person.nhs_no:873-28-7561]?,x2.Person.nhs_no:873-28-7561 = 873-28-7561,3,49,max,1
56,Who are all the people known by someone named Bonnie?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Bonnie"")
RETURN x0","[Person] = Bonnie
Who are all the people known by someone named Bonnie?",Who are all the people known by someone named [x1.Person.name:Bonnie]?,x1.Person.name:Bonnie = Bonnie,2,7,entity_set,14
2854,How many cases under investigation include family members of a person with the surname Martin?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Person] = Martin
How many cases under investigation include family members of a person with the surname Martin?",How many cases [x0.Crime.last_outcome:Under investigation] include family members of a person with the surname [x2.Person.surname:Martin]?,"x0.Crime.last_outcome:Under investigation = under investigation
x2.Person.surname:Martin = Martin",3,415,count,1
1842,What is the number of sites with the postcode WN6 7HD that had violent and sexual offence incidents?,"MATCH (x0:Location WHERE x0.postcode = ""WN6 7HD"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = WN6 7HD
[Crime] = Violence and sexual offences
What is the number of sites with the postcode WN6 7HD that had violent and sexual offence incidents?",What is the number of sites with the postcode [x0.Location.postcode:WN6 7HD] that had [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:WN6 7HD = WN6 7HD
x1.Crime.type:Violence and sexual offences = violent and sexual offence incidents",2,246,count,1
45,How many officers named Margaret were involved in crime investigations that occurred 30/08/2017?,"MATCH (x0:Officer WHERE x0.name = ""Margaret"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Margaret
[Crime] = 30/08/2017
How many officers named Margaret were involved in crime investigations that occurred 30/08/2017?",How many officers named [x0.Officer.name:Margaret] were involved in crime investigations that occurred [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Margaret = Margaret
x1.Crime.date:30/08/2017 = 30/08/2017",2,6,count,1
3007,"On 26/08/2017, how many Chevrolets were involved in crimes at the BL4 9HJ postcode?","MATCH (x0:Vehicle WHERE x0.make = ""Chevrolet"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""26/08/2017"")-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL4 9HJ"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Chevrolet
[Crime] = 26/08/2017
[Location] = BL4 9HJ
On 26/08/2017, how many Chevrolets were involved in crimes at the BL4 9HJ postcode?","On [x1.Crime.date:26/08/2017], how many [x0.Vehicle.make:Chevrolet]s were involved in crimes at the [x2.Location.postcode:BL4 9HJ] postcode?","x0.Vehicle.make:Chevrolet = Chevrolet
x1.Crime.date:26/08/2017 = 26/08/2017
x2.Location.postcode:BL4 9HJ = BL4 9HJ",3,436,count,1
182,How many Joans have the phone number of someone with the last name Robertson?,"MATCH (x0:Person WHERE x0.name = ""Joan"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Person] = Joan
[Person] = Robertson
How many Joans have the phone number of someone with the last name Robertson?",How many [x0.Person.name:Joan] have the phone number of someone with the last name [x1.Person.surname:Robertson]?,"x0.Person.name:Joan = Joans
x1.Person.surname:Robertson = Robertson",2,22,count,1
2027,What are the post codes in the M34 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M34"")
RETURN x0","[Area] = M34
What are the post codes in the M34 area?",What are the post codes in the [x1.Area.areaCode:M34] area?,x1.Area.areaCode:M34 = M34,2,272,entity_set,203
2315,"Who are the Rebeccas linked to crimes on August 31, 2017?","MATCH (x0:Person WHERE x0.name = ""Rebecca"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN x0","[Person] = Rebecca
[Crime] = 31/08/2017
Who are the Rebeccas linked to crimes on August 31, 2017?",Who are the [x0.Person.name:Rebecca] linked to crimes on [x1.Crime.date:31/08/2017]?,"x0.Person.name:Rebecca = Rebeccas
x1.Crime.date:31/08/2017 = August 31, 2017",2,313,entity_set,1
1997,What crimes occurred on 7/08/2017 that Sergeants are investigating?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Sergeant"")
RETURN x0","[Crime] = 7/08/2017
[Officer] = Sergeant
What crimes occurred on 7/08/2017 that Sergeants are investigating?",What crimes occurred on [x0.Crime.date:7/08/2017] that [x1.Officer.rank:Sergeant] are investigating?,"x0.Crime.date:7/08/2017 = 7/08/2017
x1.Officer.rank:Sergeant = Sergeants",2,268,entity_set,309
1880,Who are the individuals named Andrea related to someone with the last name Lawrence?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Person] = Andrea
[Person] = Lawrence
Who are the individuals named Andrea related to someone with the last name Lawrence?",Who are the individuals named [x0.Person.name:Andrea] related to someone with the last name [x1.Person.surname:Lawrence]?,"x0.Person.name:Andrea = Andrea
x1.Person.surname:Lawrence = Lawrence",2,251,entity_set,1
1394,"At 04:52, how many times was the number 3-(965)714-5374 dialed?","MATCH (x0:PhoneCall WHERE x0.call_time = ""04:52"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(965)714-5374"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 04:52
[Phone] = 3-(965)714-5374
At 04:52, how many times was the number 3-(965)714-5374 dialed?","At [x0.PhoneCall.call_time:04:52], how many times was the number [x1.Phone.phoneNo:3-(965)714-5374] dialed?","x0.PhoneCall.call_time:04:52 = 04:52
x1.Phone.phoneNo:3-(965)714-5374 = 3-(965)714-5374",2,183,count,1
93,Can you provide the ages of those living with a person whose last name is Jordan?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Jordan"")
RETURN x0.age","[Person] = Jordan
Can you provide the ages of those living with a person whose last name is Jordan?",Can you provide the ages of those living with a person whose last name is [x1.Person.surname:Jordan]?,x1.Person.surname:Jordan = Jordan,2,11,attribute_set,1
3087,What vehicles are linked to crimes involving individuals with NHS number 337-28-4424?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""337-28-4424"")
RETURN x0","[Person] = 337-28-4424
What vehicles are linked to crimes involving individuals with NHS number 337-28-4424?",What vehicles are linked to crimes involving individuals with NHS number [x2.Person.nhs_no:337-28-4424]?,x2.Person.nhs_no:337-28-4424 = 337-28-4424,3,6,entity_set,5
1443,How many incidents on 13/08/2017 are being probed by officers with badge ID 81-9146789?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""81-9146789"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
[Officer] = 81-9146789
How many incidents on 13/08/2017 are being probed by officers with badge ID 81-9146789?",How many incidents on [x0.Crime.date:13/08/2017] are being probed by officers with badge ID [x1.Officer.badge_no:81-9146789]?,"x0.Crime.date:13/08/2017 = 13/08/2017
x1.Officer.badge_no:81-9146789 = 81-9146789",2,190,count,1
39,Can you provide a list of Cadillac cars associated with vehicle offenses?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Cadillac
[Crime] = Vehicle crime
Can you provide a list of Cadillac cars associated with vehicle offenses?",Can you provide a list of [x0.Vehicle.make:Cadillac] cars associated with [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.make:Cadillac = Cadillac
x1.Crime.type:Vehicle crime = vehicle offenses",2,5,entity_set,23
1314,How many calls did 6-(622)025-5648 get at 18:05?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""18:05"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""6-(622)025-5648"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18:05
[Phone] = 6-(622)025-5648
How many calls did 6-(622)025-5648 get at 18:05?",How many calls did [x1.Phone.phoneNo:6-(622)025-5648] get at [x0.PhoneCall.call_time:18:05]?,"x0.PhoneCall.call_time:18:05 = 18:05
x1.Phone.phoneNo:6-(622)025-5648 = 6-(622)025-5648",2,174,count,1
549,How many people called Irene are at 53 Trevor Road?,"MATCH (x0:Person WHERE x0.name = ""Irene"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""53 Trevor Road"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
[Location] = 53 Trevor Road
How many people called Irene are at 53 Trevor Road?",How many people called [x0.Person.name:Irene] are at [x1.Location.address:53 Trevor Road]?,"x0.Person.name:Irene = Irene
x1.Location.address:53 Trevor Road = 53 Trevor Road",2,71,count,1
816,What was the count of people engaged in crimes on 30/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 30/08/2017
What was the count of people engaged in crimes on 30/08/2017?",What was the count of people engaged in crimes on [x1.Crime.date:30/08/2017]?,x1.Crime.date:30/08/2017 = 30/08/2017,2,108,count,1
2096,Which calls to 9-(721)729-4724 lasted exactly 43 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""43"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(721)729-4724"")
RETURN x0","[PhoneCall] = 43
[Phone] = 9-(721)729-4724
Which calls to 9-(721)729-4724 lasted exactly 43 seconds?",Which calls to [x1.Phone.phoneNo:9-(721)729-4724] lasted exactly [x0.PhoneCall.call_duration:43] seconds?,"x0.PhoneCall.call_duration:43 = 43
x1.Phone.phoneNo:9-(721)729-4724 = 9-(721)729-4724",2,283,entity_set,2
2285,When was the most recent crime at 95 Cobden Street involving anyone with last name Hughes?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Hughes"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""95 Cobden Street"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Hughes
[Location] = 95 Cobden Street
When was the most recent crime at 95 Cobden Street involving anyone with last name Hughes?",When was the most recent crime at [x1.Location.address:95 Cobden Street] involving anyone with last name [x2.Person.surname:Hughes]?,"x1.Location.address:95 Cobden Street = 95 Cobden Street
x2.Person.surname:Hughes = Hughes",3,309,argmax,1
2420,Which is the earliest crime probed by officers with last name Stoltz?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Stoltz"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stoltz
Which is the earliest crime probed by officers with last name Stoltz?",Which is the earliest crime probed by officers with last name [x1.Officer.surname:Stoltz]?,x1.Officer.surname:Stoltz = Stoltz,2,334,min,1
1567,How many Outback cars are associated with crimes that have been investigated without identifying a suspect?,"MATCH (x0:Vehicle WHERE x0.model = ""Outback"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Outback
[Crime] = Investigation complete; no suspect identified
How many Outback cars are associated with crimes that have been investigated without identifying a suspect?",How many [x0.Vehicle.model:Outback] cars are associated with crimes that have been [x1.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Vehicle.model:Outback = Outback
x1.Crime.last_outcome:Investigation complete; no suspect identified = investigated without identifying a suspect",2,208,count,1
2384,What area corresponds to the address 53 Shaw Street?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""53 Shaw Street"")
RETURN x0","[Location] = 53 Shaw Street
What area corresponds to the address 53 Shaw Street?",What area corresponds to the address [x1.Location.address:53 Shaw Street]?,x1.Location.address:53 Shaw Street = 53 Shaw Street,2,328,entity_set,1
1783,"Which crimes, labeled ""Investigation complete; no suspect identified,"" occurred at locations with the postcode OL4 5AW?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL4 5AW"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = OL4 5AW
Which crimes, labeled ""Investigation complete; no suspect identified,"" occurred at locations with the postcode OL4 5AW?","Which crimes, labeled ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" occurred at locations with the postcode [x1.Location.postcode:OL4 5AW]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:OL4 5AW = OL4 5AW",2,236,entity_set,1
3117,Which calls to a phone that got a call at 08:20 have the earliest date?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""08:20"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 08:20
Which calls to a phone that got a call at 08:20 have the earliest date?",Which calls to a phone that got a call at [x2.PhoneCall.call_time:08:20] have the earliest date?,x2.PhoneCall.call_time:08:20 = 08:20,3,10,min,1
3458,"When did someone surnamed Gordon receive a call on August 29, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gordon"")
RETURN x0.call_time","[PhoneCall] = 29/08/2017
[Person] = Gordon
When did someone surnamed Gordon receive a call on August 29, 2017?",When did someone surnamed [x2.Person.surname:Gordon] receive a call on [x0.PhoneCall.call_date:29/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = August 29, 2017 
x2.Person.surname:Gordon = Gordon",3,77,attribute_set,1
2855,How many crimes being investigated involve relatives of a person whose last name is Martin?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Person] = Martin
How many crimes being investigated involve relatives of a person whose last name is Martin?",How many crimes [x0.Crime.last_outcome:Under investigation] involve relatives of a person whose last name is [x2.Person.surname:Martin]?,"x0.Crime.last_outcome:Under investigation = being investigated 
x2.Person.surname:Martin = Martin",3,415,count,1
1447,How many relatives does the person with NHS number 243-46-3035 have?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""243-46-3035"")
RETURN COUNT(DISTINCT x0)","[Person] = 243-46-3035
How many relatives does the person with NHS number 243-46-3035 have?",How many relatives does the person with NHS number [x1.Person.nhs_no:243-46-3035] have?,x1.Person.nhs_no:243-46-3035 = 243-46-3035,2,191,count,1
1782,"Can you provide a list of crimes marked as ""Investigation complete; no suspect identified"" that took place in the OL4 5AW postcode?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL4 5AW"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = OL4 5AW
Can you provide a list of crimes marked as ""Investigation complete; no suspect identified"" that took place in the OL4 5AW postcode?","Can you provide a list of crimes marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" that took place in the [x1.Location.postcode:OL4 5AW] postcode?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:OL4 5AW = OL4 5AW",2,236,entity_set,1
932,"On 14th August 2017, how many crimes included a vehicle?","MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
On 14th August 2017, how many crimes included a vehicle?","On [x0.Crime.date:14/08/2017], how many crimes included a vehicle?",x0.Crime.date:14/08/2017 = 14th August 2017,2,121,count,1
3226,Can you provide the NHS numbers for those contacted at 14:11?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""14:11"")
RETURN x0.nhs_no","[PhoneCall] = 14:11
Can you provide the NHS numbers for those contacted at 14:11?",Can you provide the NHS numbers for those contacted at [x2.PhoneCall.call_time:14:11]?,x2.PhoneCall.call_time:14:11 = 14:11,3,26,attribute_set,2
2767,In what vehicle crimes is Phillip involved with Edge vehicles?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Phillip"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Edge"")
RETURN x0","[Crime] = Vehicle crime
[Person] = Phillip
[Vehicle] = Edge
In what vehicle crimes is Phillip involved with Edge vehicles?",In what [x0.Crime.type:Vehicle crime] is [x2.Person.name:Phillip] involved with [x1.Vehicle.model:Edge] vehicles?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Edge = Edge
x2.Person.name:Phillip = Phillip",3,401,entity_set,1
1590,What is the number of areas with the postcode WA14 1ND?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WA14 1ND"")
RETURN COUNT(DISTINCT x0)","[PostCode] = WA14 1ND
What is the number of areas with the postcode WA14 1ND?",What is the number of areas with the postcode [x1.PostCode.code:WA14 1ND]?,x1.PostCode.code:WA14 1ND = WA14 1ND,2,210,count,1
3377,What is the most recent crime involving an acquaintance of the person with NHS number 249-54-6589?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""249-54-6589"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 249-54-6589
What is the most recent crime involving an acquaintance of the person with NHS number 249-54-6589?",What is the most recent crime involving an acquaintance of the person with NHS number [x2.Person.nhs_no:249-54-6589]?,x2.Person.nhs_no:249-54-6589 = 249-54-6589,3,49,max,1
965,What's the count of people called Heather who have a friend?,"MATCH (x0:Person WHERE x0.name = ""Heather"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Heather
What's the count of people called Heather who have a friend?",What's the count of people called [x0.Person.name:Heather] who have a friend?,x0.Person.name:Heather = Heather,2,126,count,1
2604,How many individuals possess an email account?,"MATCH (x0:Person)-[:HAS_EMAIL]-(x1:Email)
RETURN COUNT(DISTINCT x0)",How many individuals possess an email account?,How many individuals possess an email account?,,2,368,count,1
959,Which officers looked into crimes that occurred on 16th August 2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Crime] = 16/08/2017
Which officers looked into crimes that occurred on 16th August 2017?",Which officers looked into crimes that occurred on [x1.Crime.date:16/08/2017]?,x1.Crime.date:16/08/2017 = 16th August 2017,2,125,entity_set,918
2424,What is the earliest crime investigated by officers with the surname Tarquini?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tarquini"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Tarquini
What is the earliest crime investigated by officers with the surname Tarquini?",What is the earliest crime investigated by officers with the surname [x1.Officer.surname:Tarquini]?,x1.Officer.surname:Tarquini = Tarquini,2,334,min,1
1844,How many locations with postcode SK8 2LN had crimes of violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""SK8 2LN"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Location] = SK8 2LN
[Crime] = Violence and sexual offences
How many locations with postcode SK8 2LN had crimes of violence and sexual offences?",How many locations with postcode [x0.Location.postcode:SK8 2LN] had crimes of [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:SK8 2LN = SK8 2LN
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,246,count,1
