id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1015,"How many phones placed a call on August 2, 2017?","MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""02/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 02/08/2017
How many phones placed a call on August 2, 2017?",How many phones placed a call on [x1.PhoneCall.call_date:02/08/2017]?,"x1.PhoneCall.call_date:02/08/2017 = August 2, 2017",2,134,count,1
2864,How many crimes are handled by Police Constables that include an individual with surname Peters?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Police Constable"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Person] = Peters
How many crimes are handled by Police Constables that include an individual with surname Peters?",How many crimes are handled by [x2.Officer.rank:Police Constable] that include an individual with surname [x1.Person.surname:Peters]?,"x1.Person.surname:Peters = Peters
x2.Officer.rank:Police Constable = Police Constables",3,416,count,1
30,How many public order offenses are handled by officers named Gay?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Gay"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Officer] = Gay
How many public order offenses are handled by officers named Gay?",How many [x0.Crime.type:Public order] offenses are handled by officers named [x1.Officer.name:Gay]?,"x0.Crime.type:Public order = public order
x1.Officer.name:Gay = Gay",2,4,count,1
4622,When did the first crime occur involving someone living at postcode M3 4NW?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""M3 4NW"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = M3 4NW
When did the first crime occur involving someone living at postcode M3 4NW?",When did the first crime occur involving someone living at postcode [x2.Location.postcode:M3 4NW]?,x2.Location.postcode:M3 4NW = M3 4NW,3,86,argmin,1
799,"What are the badge numbers of officers who investigated crimes on August 26, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""26/08/2017"")
RETURN x0.badge_no","[Crime] = 26/08/2017
What are the badge numbers of officers who investigated crimes on August 26, 2017?",What are the badge numbers of officers who investigated crimes on [x1.Crime.date:26/08/2017]?,"x1.Crime.date:26/08/2017 = August 26, 2017",2,106,attribute_set,903
280,How many burglary cases are handled by police constables?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = Police Constable
How many burglary cases are handled by police constables?",How many [x0.Crime.type:Burglary] cases are handled by [x1.Officer.rank:Police Constable]?,"x0.Crime.type:Burglary = burglary
x1.Officer.rank:Police Constable = police constables",2,34,count,1
1243,How many crimes from 26/08/2017 are being investigated by officers with last name Goneau?,"MATCH (x0:Crime WHERE x0.date = ""26/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Goneau"")
RETURN COUNT(DISTINCT x0)","[Crime] = 26/08/2017
[Officer] = Goneau
How many crimes from 26/08/2017 are being investigated by officers with last name Goneau?",How many crimes from [x0.Crime.date:26/08/2017] are being investigated by officers with last name [x1.Officer.surname:Goneau]?,"x0.Crime.date:26/08/2017 = 26/08/2017
x1.Officer.surname:Goneau = Goneau",2,166,count,1
1411,How many emails are associated with people named Victor?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Victor"")
RETURN COUNT(DISTINCT x0)","[Person] = Victor
How many emails are associated with people named Victor?",How many emails are associated with people named [x1.Person.name:Victor]?,x1.Person.name:Victor = Victor,2,187,count,1
778,How many phones called at 19:22?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""19:22"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:22
How many phones called at 19:22?",How many phones called at [x1.PhoneCall.call_time:19:22]?,x1.PhoneCall.call_time:19:22 = 19:22,2,102,count,1
1326,How many districts have sites with the postcode M30 8NS?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M30 8NS"")
RETURN COUNT(DISTINCT x0)","[Location] = M30 8NS
How many districts have sites with the postcode M30 8NS?",How many districts have sites with the postcode [x1.Location.postcode:M30 8NS]?,x1.Location.postcode:M30 8NS = M30 8NS,2,175,count,1
4414,Which is the newest vehicle connected to a crime at 129 George Street?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Location] = 129 George Street
Which is the newest vehicle connected to a crime at 129 George Street?",Which is the newest vehicle connected to a crime at [x2.Location.address:129 George Street]?,x2.Location.address:129 George Street = 129 George Street,3,12,max,1
3662,What are the surnames of people whose phone number is known by a person living with Ruby?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Ruby"")
RETURN x0.surname","[Person] = Ruby
What are the surnames of people whose phone number is known by a person living with Ruby?",What are the surnames of people whose phone number is known by a person living with [x2.Person.name:Ruby]?,x2.Person.name:Ruby = Ruby,3,166,attribute_set,1
3335,Who are the residents in the M14 area code?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M14"")
RETURN x0","[Area] = M14
Who are the residents in the M14 area code?",Who are the residents in the [x2.Area.areaCode:M14] area code?,x2.Area.areaCode:M14 = M14,3,43,entity_set,9
186,How many individuals named Norma possess the contact number of a persons with surname Matthews?,"MATCH (x0:Person WHERE x0.name = ""Norma"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Matthews"")
RETURN COUNT(DISTINCT x0)","[Person] = Norma
[Person] = Matthews
How many individuals named Norma possess the contact number of a persons with surname Matthews?",How many individuals named [x0.Person.name:Norma] possess the contact number of a persons with surname [x1.Person.surname:Matthews]?,"x0.Person.name:Norma = Norma
x1.Person.surname:Matthews = Matthews",2,22,count,1
2419,Can you identify the phones that called on 09/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""09/08/2017"")
RETURN x0","[PhoneCall] = 09/08/2017
Can you identify the phones that called on 09/08/2017?",Can you identify the phones that called on [x1.PhoneCall.call_date:09/08/2017]?,x1.PhoneCall.call_date:09/08/2017 = 09/08/2017,2,333,entity_set,21
3374,What is the earliest crime date investigated by Officer Dumingo at 192 Thelwall Road?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Dumingo"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""192 Thelwall Road"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Dumingo
[Location] = 192 Thelwall Road
What is the earliest crime date investigated by Officer Dumingo at 192 Thelwall Road?",What is the earliest crime date investigated by Officer [x1.Officer.surname:Dumingo] at [x2.Location.address:192 Thelwall Road]?,"x1.Officer.surname:Dumingo = Dumingo
x2.Location.address:192 Thelwall Road = 192 Thelwall Road",3,48,argmin,1
1919,Which phones had a call that lasted 66 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""66"")
RETURN x0","[PhoneCall] = 66
Which phones had a call that lasted 66 seconds?",Which phones had a call that lasted [x1.PhoneCall.call_duration:66] seconds?,x1.PhoneCall.call_duration:66 = 66,2,255,entity_set,16
305,How many sites reported crimes with the status Unable to prosecute suspect?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
How many sites reported crimes with the status Unable to prosecute suspect?",How many sites reported crimes with the status [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,38,count,1
197,Who are the relatives of people named Jennifer?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Jennifer"")
RETURN x0","[Person] = Jennifer
Who are the relatives of people named Jennifer?",Who are the relatives of people named [x1.Person.name:Jennifer]?,x1.Person.name:Jennifer = Jennifer,2,24,entity_set,2
495,How many cases with a suspended prison sentence involve an individual whose last name is Williamson?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given suspended prison sentence"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Offender given suspended prison sentence
[Person] = Williamson
How many cases with a suspended prison sentence involve an individual whose last name is Williamson?",How many cases with a [x0.Crime.last_outcome:Offender given suspended prison sentence] involve an individual whose last name is [x1.Person.surname:Williamson]?,"x0.Crime.last_outcome:Offender given suspended prison sentence = suspended prison sentence 
x1.Person.surname:Williamson = Williamson",2,64,count,1
1961,How many phones does the person with NHS number 450-68-4090 own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""450-68-4090"")
RETURN COUNT(DISTINCT x0)","[Person] = 450-68-4090
How many phones does the person with NHS number 450-68-4090 own?",How many phones does the person with NHS number [x1.Person.nhs_no:450-68-4090] own?,x1.Person.nhs_no:450-68-4090 = 450-68-4090,2,263,count,1
2016,"How many cases marked as ""Investigation complete; no suspect identified"" included Protege vehicles?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Protege"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Vehicle] = Protege
How many cases marked as ""Investigation complete; no suspect identified"" included Protege vehicles?","How many cases marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" included [x1.Vehicle.model:Protege] vehicles?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Vehicle.model:Protege = Protege",2,270,count,1
1045,How many Amys share a home with someone named Louis?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Louis"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Louis
How many Amys share a home with someone named Louis?",How many [x0.Person.name:Amy] share a home with someone named [x1.Person.name:Louis]?,"x0.Person.name:Amy = Amys
x1.Person.name:Louis = Louis",2,138,count,1
2951,Can you provide details on Vehicle crimes at 8 Glade Street with Silverado 3500s?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""8 Glade Street"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Silverado 3500"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 8 Glade Street
[Vehicle] = Silverado 3500
Can you provide details on Vehicle crimes at 8 Glade Street with Silverado 3500s?",Can you provide details on [x0.Crime.type:Vehicle crime] at [x2.Location.address:8 Glade Street] with [x1.Vehicle.model:Silverado 3500]?,"x0.Crime.type:Vehicle crime = Vehicle crimes
x1.Vehicle.model:Silverado 3500 = Silverado 3500s
x2.Location.address:8 Glade Street = 8 Glade Street",3,428,entity_set,1
210,How many offenses on 10/08/2017 did officers investigate?,"MATCH (x0:Crime WHERE x0.date = ""10/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 10/08/2017
How many offenses on 10/08/2017 did officers investigate?",How many offenses on [x0.Crime.date:10/08/2017] did officers investigate?,x0.Crime.date:10/08/2017 = 10/08/2017,2,25,count,1
414,Can you name every location with the postcode BL2 2UQ?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""BL2 2UQ"")
RETURN x0","[PostCode] = BL2 2UQ
Can you name every location with the postcode BL2 2UQ?",Can you name every location with the postcode [x1.PostCode.code:BL2 2UQ]?,x1.PostCode.code:BL2 2UQ = BL2 2UQ,2,54,entity_set,1
1407,How many times did 0-(752)850-0116 receive a call lasting 66 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""66"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(752)850-0116"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
[Phone] = 0-(752)850-0116
How many times did 0-(752)850-0116 receive a call lasting 66 seconds?",How many times did [x1.Phone.phoneNo:0-(752)850-0116] receive a call lasting [x0.PhoneCall.call_duration:66] seconds?,"x0.PhoneCall.call_duration:66 = 66
x1.Phone.phoneNo:0-(752)850-0116 = 0-(752)850-0116",2,184,count,1
2002,Can you identify the crimes from 31/08/2017 being looked into by Police Constables?,"MATCH (x0:Crime WHERE x0.date = ""31/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN x0","[Crime] = 31/08/2017
[Officer] = Police Constable
Can you identify the crimes from 31/08/2017 being looked into by Police Constables?",Can you identify the crimes from [x0.Crime.date:31/08/2017] being looked into by [x1.Officer.rank:Police Constable]?,"x0.Crime.date:31/08/2017 = 31/08/2017
x1.Officer.rank:Police Constable = Police Constables",2,268,entity_set,346
1730,"What is the number of vehicles linked to crimes on August 21, 2017?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""21/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
What is the number of vehicles linked to crimes on August 21, 2017?",What is the number of vehicles linked to crimes on [x1.Crime.date:21/08/2017]?,"x1.Crime.date:21/08/2017 = August 21, 2017",2,228,count,1
1532,How many Pathfinder vehicles were linked to crimes on 7/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""Pathfinder"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Pathfinder
[Crime] = 7/08/2017
How many Pathfinder vehicles were linked to crimes on 7/08/2017?",How many [x0.Vehicle.model:Pathfinder] vehicles were linked to crimes on [x1.Crime.date:7/08/2017]?,"x0.Vehicle.model:Pathfinder = Pathfinder
x1.Crime.date:7/08/2017 = 7/08/2017",2,203,count,1
2976,When did the first crime occur involving individuals with the email npayneau@craigslist.org?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""npayneau@craigslist.org"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = npayneau@craigslist.org
When did the first crime occur involving individuals with the email npayneau@craigslist.org?",When did the first crime occur involving individuals with the email [x2.Email.email_address:npayneau@craigslist.org]?,x2.Email.email_address:npayneau@craigslist.org = npayneau@craigslist.org,3,431,argmin,1
2969,Could you list the emails of individuals who are relatives of the Woods surname?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
Could you list the emails of individuals who are relatives of the Woods surname?",Could you list the emails of individuals who are relatives of the [x2.Person.surname:Woods] surname?,x2.Person.surname:Woods = Woods,3,430,entity_set,2
1539,Can you name everyone who shares a house with a person whose last name is Jordan?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Jordan"")
RETURN x0","[Person] = Jordan
Can you name everyone who shares a house with a person whose last name is Jordan?",Can you name everyone who shares a house with a person whose last name is [x1.Person.surname:Jordan]?,x1.Person.surname:Jordan = Jordan,2,205,entity_set,1
647,Who is the oldest relative of anyone acquainted with a Harper's phone number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Harper"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Harper
Who is the oldest relative of anyone acquainted with a Harper's phone number?",Who is the oldest relative of anyone acquainted with a [x2.Person.surname:Harper]'s phone number?,x2.Person.surname:Harper = Harper,3,86,max,1
811,What is the number of individuals participating in crimes on 7/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 7/08/2017
What is the number of individuals participating in crimes on 7/08/2017?",What is the number of individuals participating in crimes on [x1.Crime.date:7/08/2017]?,x1.Crime.date:7/08/2017 = 7/08/2017,2,108,count,1
2417,Which phones made calls on 09/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""09/08/2017"")
RETURN x0","[PhoneCall] = 09/08/2017
Which phones made calls on 09/08/2017?",Which phones made calls on [x1.PhoneCall.call_date:09/08/2017]?,x1.PhoneCall.call_date:09/08/2017 = 09/08/2017,2,333,entity_set,21
747,Can you identify places with postcode M27 0JU where a person named Ralph lives?,"MATCH (x0:Location WHERE x0.postcode = ""M27 0JU"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Ralph"")
RETURN x0","[Location] = M27 0JU
[Person] = Ralph
Can you identify places with postcode M27 0JU where a person named Ralph lives?",Can you identify places with postcode [x0.Location.postcode:M27 0JU] where a person named [x1.Person.name:Ralph] lives?,"x0.Location.postcode:M27 0JU = M27 0JU
x1.Person.name:Ralph = Ralph",2,99,entity_set,1
2296,What are the calls made with the number 2-(821)181-6941?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""2-(821)181-6941"")
RETURN x0","[Phone] = 2-(821)181-6941
What are the calls made with the number 2-(821)181-6941?",What are the calls made with the number [x1.Phone.phoneNo:2-(821)181-6941]?,x1.Phone.phoneNo:2-(821)181-6941 = 2-(821)181-6941,2,310,entity_set,2
49,"How many officers named Ashleigh examined crimes that happened on August 31, 2017?","MATCH (x0:Officer WHERE x0.name = ""Ashleigh"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Ashleigh
[Crime] = 31/08/2017
How many officers named Ashleigh examined crimes that happened on August 31, 2017?",How many officers named [x0.Officer.name:Ashleigh] examined crimes that happened on [x1.Crime.date:31/08/2017]?,"x0.Officer.name:Ashleigh = Ashleigh
x1.Crime.date:31/08/2017 = August 31, 2017",2,6,count,1
782,"Which is the oldest vehicle connected to a crime marked as ""Investigation complete; no suspect identified"" that involves a person with the surname Peters?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Peters"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Peters
Which is the oldest vehicle connected to a crime marked as ""Investigation complete; no suspect identified"" that involves a person with the surname Peters?","Which is the oldest vehicle connected to a crime marked as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]"" that involves a person with the surname [x2.Person.surname:Peters]?","x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.surname:Peters = Peters",3,103,max,1
2394,What's the earliest crime linked to someone with the last name Kelly and an LHS model car?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""LHS"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = LHS
[Person] = Kelly
What's the earliest crime linked to someone with the last name Kelly and an LHS model car?",What's the earliest crime linked to someone with the last name [x1.Person.surname:Kelly] and an [x2.Vehicle.model:LHS] model car?,"x1.Person.surname:Kelly = Kelly
x2.Vehicle.model:LHS = LHS",3,331,min,1
2177,What is the number of Mazda cars linked to crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Mazda"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Mazda
What is the number of Mazda cars linked to crimes?",What is the number of [x0.Vehicle.make:Mazda] cars linked to crimes?,x0.Vehicle.make:Mazda = Mazda,2,295,count,1
1304,What is the most recent date officers with surname Yablsley investigated a crime involving Element model cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Element"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Yablsley"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Element
[Officer] = Yablsley
What is the most recent date officers with surname Yablsley investigated a crime involving Element model cars?",What is the most recent date officers with surname [x1.Officer.surname:Yablsley] investigated a crime involving [x2.Vehicle.model:Element] model cars?,"x1.Officer.surname:Yablsley = Yablsley
x2.Vehicle.model:Element = Element",3,173,argmax,1
2781,What is the first date a crime happened involving family members of a Brooks?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Brooks"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Brooks
What is the first date a crime happened involving family members of a Brooks?",What is the first date a crime happened involving family members of a [x2.Person.surname:Brooks]?,x2.Person.surname:Brooks = Brooks,3,405,argmin,1
1886,Which phones made a 34-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""34"")
RETURN x0","[PhoneCall] = 34
Which phones made a 34-second call?",Which phones made a [x1.PhoneCall.call_duration:34]-second call?,x1.PhoneCall.call_duration:34 = 34,2,252,entity_set,10
252,Can you provide the homes of those with the last name Webb?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Webb"")
RETURN x0","[Person] = Webb
Can you provide the homes of those with the last name Webb?",Can you provide the homes of those with the last name [x1.Person.surname:Webb]?,x1.Person.surname:Webb = Webb,2,31,entity_set,1
3282,What is the most recent phone call made to a person with NHS number 468-82-3915?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""468-82-3915"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 468-82-3915
What is the most recent phone call made to a person with NHS number 468-82-3915?",What is the most recent phone call made to a person with NHS number [x2.Person.nhs_no:468-82-3915]?,x2.Person.nhs_no:468-82-3915 = 468-82-3915,3,36,max,1
1779,"Can you provide a list of crimes marked as ""Investigation complete; no suspect identified"" that took place in locations with the postcode M1 5DA?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M1 5DA"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = M1 5DA
Can you provide a list of crimes marked as ""Investigation complete; no suspect identified"" that took place in locations with the postcode M1 5DA?","Can you provide a list of crimes marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" that took place in locations with the postcode [x1.Location.postcode:M1 5DA]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:M1 5DA = M1 5DA",2,236,entity_set,16
1584,What is the number of areas with the postcode OL2 8NR?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL2 8NR"")
RETURN COUNT(DISTINCT x0)","[PostCode] = OL2 8NR
What is the number of areas with the postcode OL2 8NR?",What is the number of areas with the postcode [x1.PostCode.code:OL2 8NR]?,x1.PostCode.code:OL2 8NR = OL2 8NR,2,210,count,1
2454,What is the number of people living with a person whose last name is Martinez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Person] = Martinez
What is the number of people living with a person whose last name is Martinez?",What is the number of people living with a person whose last name is [x1.Person.surname:Martinez]?,x1.Person.surname:Martinez = Martinez,2,338,count,1
1938,Can you provide the dates of offenses involving people whose phone numbers are known by Duncans?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Duncan"")
RETURN x0.date","[Person] = Duncan
Can you provide the dates of offenses involving people whose phone numbers are known by Duncans?",Can you provide the dates of offenses involving people whose phone numbers are known by [x2.Person.surname:Duncan]?,x2.Person.surname:Duncan = Duncans,3,258,attribute_set,1
2227,Which calls did 8-(342)691-8174 receive on 14/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""14/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(342)691-8174"")
RETURN x0","[PhoneCall] = 14/08/2017
[Phone] = 8-(342)691-8174
Which calls did 8-(342)691-8174 receive on 14/08/2017?",Which calls did [x1.Phone.phoneNo:8-(342)691-8174] receive on [x0.PhoneCall.call_date:14/08/2017]?,"x0.PhoneCall.call_date:14/08/2017 = 14/08/2017
x1.Phone.phoneNo:8-(342)691-8174 = 8-(342)691-8174",2,300,entity_set,1
4444,How many folks know a Williamson and have a criminal involvement?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Williamson"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Williamson
How many folks know a Williamson and have a criminal involvement?",How many folks know a [x2.Person.surname:Williamson] and have a criminal involvement?,x2.Person.surname:Williamson = Williamson,3,25,count,1
4488,Can you provide the NHS numbers for all Ryans who are family of the individual with NHS number 873-28-7561?,"MATCH (x0:Person WHERE x0.name = ""Ryan"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0.nhs_no","[Person] = Ryan
[Person] = 873-28-7561
Can you provide the NHS numbers for all Ryans who are family of the individual with NHS number 873-28-7561?",Can you provide the NHS numbers for all [x0.Person.name:Ryan]s who are family of the individual with NHS number [x2.Person.nhs_no:873-28-7561]?,"x0.Person.name:Ryan = Ryan
x2.Person.nhs_no:873-28-7561 = 873-28-7561",3,36,attribute_set,1
1705,Can you provide the location of residence at 98 Tatton Road Northfor those with the surname Fernandez?,"MATCH (x0:Location WHERE x0.address = ""98 Tatton Road North"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Location] = 98 Tatton Road North
[Person] = Fernandez
Can you provide the location of residence at 98 Tatton Road Northfor those with the surname Fernandez?",Can you provide the location of residence at [x0.Location.address:98 Tatton Road North]for those with the surname [x1.Person.surname:Fernandez]?,"x0.Location.address:98 Tatton Road North = 98 Tatton Road North
x1.Person.surname:Fernandez = Fernandez",2,224,entity_set,1
3624,Can you provide the surnames of those who are friends with someone connected to a Robbery?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Robbery"")
RETURN x0.surname","[Crime] = Robbery
Can you provide the surnames of those who are friends with someone connected to a Robbery?",Can you provide the surnames of those who are friends with someone connected to a [x2.Crime.type:Robbery]?,x2.Crime.type:Robbery = Robbery,3,148,attribute_set,5
1594,Can you provide the post codes for locations where crimes happened on 25/08/2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""25/08/2017"")
RETURN x0","[Crime] = 25/08/2017
Can you provide the post codes for locations where crimes happened on 25/08/2017?",Can you provide the post codes for locations where crimes happened on [x2.Crime.date:25/08/2017]?,x2.Crime.date:25/08/2017 = 25/08/2017,3,211,entity_set,927
1659,What is the number of people connected by family to a Fernandez?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN COUNT(DISTINCT x0)","[Person] = Fernandez
What is the number of people connected by family to a Fernandez?",What is the number of people connected by family to a [x1.Person.surname:Fernandez]?,x1.Person.surname:Fernandez = Fernandez,2,218,count,1
2697,Which was the initial crime at 69 Orchard Avenue involving someone?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""69 Orchard Avenue"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 69 Orchard Avenue
Which was the initial crime at 69 Orchard Avenue involving someone?",Which was the initial crime at [x1.Location.address:69 Orchard Avenue] involving someone?,x1.Location.address:69 Orchard Avenue = 69 Orchard Avenue,3,391,min,1
3508,What are the postcodes for the homes of the friends of the person whose NHS number is 692-42-9948?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""692-42-9948"")
RETURN x0.postcode","[Person] = 692-42-9948
What are the postcodes for the homes of the friends of the person whose NHS number is 692-42-9948?",What are the postcodes for the homes of the friends of the person whose NHS number is [x2.Person.nhs_no:692-42-9948]?,x2.Person.nhs_no:692-42-9948 = 692-42-9948,3,104,attribute_set,7
1818,What is the count of vehicle offenses linked to people with the surname Moore?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Moore"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Moore
What is the count of vehicle offenses linked to people with the surname Moore?",What is the count of [x0.Crime.type:Vehicle crime] linked to people with the surname [x1.Person.surname:Moore]?,"x0.Crime.type:Vehicle crime = vehicle offenses 
x1.Person.surname:Moore = Moore",2,241,count,1
1282,Who is the oldest individual whose phone number is known by any Andrea with the number 8-(574)079-6700?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.name = ""Andrea"")-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""8-(574)079-6700"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Andrea
[Phone] = 8-(574)079-6700
Who is the oldest individual whose phone number is known by any Andrea with the number 8-(574)079-6700?",Who is the oldest individual whose phone number is known by any [x1.Person.name:Andrea] with the number [x2.Phone.phoneNo:8-(574)079-6700]?,"x1.Person.name:Andrea = Andrea
x2.Phone.phoneNo:8-(574)079-6700 = 8-(574)079-6700",3,170,max,1
2326,How many devices made calls?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)
RETURN COUNT(DISTINCT x0)",How many devices made calls?,How many devices made calls?,,2,314,count,1
2272,How many people share a home with anyone named Lois?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Lois"")
RETURN COUNT(DISTINCT x0)","[Person] = Lois
How many people share a home with anyone named Lois?",How many people share a home with anyone named [x1.Person.name:Lois]?,x1.Person.name:Lois = Lois,2,306,count,1
