id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2939,"How many crimes, marked as ""Investigation complete; no suspect identified,"" involve individuals with the last name Peters and are investigated by officers with surname Rudwell?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Peters"")
MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Rudwell"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Peters
[Officer] = Rudwell
How many crimes, marked as ""Investigation complete; no suspect identified,"" involve individuals with the last name Peters and are investigated by officers with surname Rudwell?","How many crimes, marked as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" involve individuals with the last name [x2.Person.surname:Peters] and are investigated by officers with surname [x1.Officer.surname:Rudwell]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Officer.surname:Rudwell = Rudwell
x2.Person.surname:Peters = Peters",3,426,count,1
1349,"On 02/08/2017, how many calls were made by phones of individuals with the last name Gordon?","MATCH (x0:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""02/08/2017"")
MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Gordon"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 02/08/2017
[Person] = Gordon
On 02/08/2017, how many calls were made by phones of individuals with the last name Gordon?","On [x2.PhoneCall.call_date:02/08/2017], how many calls were made by phones of individuals with the last name [x1.Person.surname:Gordon]?","x1.Person.surname:Gordon = Gordon
x2.PhoneCall.call_date:02/08/2017 = 02/08/2017",3,178,count,1
3384,What is the latest offense connected to someone familiar with the individual holding NHS number 329-25-8167?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""329-25-8167"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = 329-25-8167
What is the latest offense connected to someone familiar with the individual holding NHS number 329-25-8167?",What is the latest offense connected to someone familiar with the individual holding NHS number [x2.Person.nhs_no:329-25-8167]?,x2.Person.nhs_no:329-25-8167 = 329-25-8167,3,49,max,1
1014,Can you name the Police Constables involved in vehicle crime investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Police Constable
[Crime] = Vehicle crime
Can you name the Police Constables involved in vehicle crime investigations?",Can you name the [x0.Officer.rank:Police Constable] involved in [x1.Crime.type:Vehicle crime] investigations?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.type:Vehicle crime = vehicle crime",2,133,entity_set,996
1963,How many phones are possessed by the person holding NHS number 450-68-4090?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""450-68-4090"")
RETURN COUNT(DISTINCT x0)","[Person] = 450-68-4090
How many phones are possessed by the person holding NHS number 450-68-4090?",How many phones are possessed by the person holding NHS number [x1.Person.nhs_no:450-68-4090]?,x1.Person.nhs_no:450-68-4090 = 450-68-4090,2,263,count,1
323,"On 26th August 2017, how many times was 4-(962)368-0599 called?","MATCH (x0:PhoneCall WHERE x0.call_date = ""26/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""4-(962)368-0599"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 26/08/2017
[Phone] = 4-(962)368-0599
On 26th August 2017, how many times was 4-(962)368-0599 called?","On [x0.PhoneCall.call_date:26/08/2017], how many times was [x1.Phone.phoneNo:4-(962)368-0599] called?","x0.PhoneCall.call_date:26/08/2017 = 26th August 2017 
x1.Phone.phoneNo:4-(962)368-0599 = 4-(962)368-0599",2,40,count,1
1911,What is the count of people named Betty living with someone holding the NHS number 888-09-8856?,"MATCH (x0:Person WHERE x0.name = ""Betty"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""888-09-8856"")
RETURN COUNT(DISTINCT x0)","[Person] = Betty
[Person] = 888-09-8856
What is the count of people named Betty living with someone holding the NHS number 888-09-8856?",What is the count of people named [x0.Person.name:Betty] living with someone holding the NHS number [x1.Person.nhs_no:888-09-8856]?,"x0.Person.name:Betty = Betty
x1.Person.nhs_no:888-09-8856 = 888-09-8856",2,254,count,1
2635,How many Protege autos are part of a vehicle crime case handled by someone with surname Klicher?,"MATCH (x0:Vehicle WHERE x0.model = ""Protege"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Klicher"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Protege
[Crime] = Vehicle crime
[Officer] = Klicher
How many Protege autos are part of a vehicle crime case handled by someone with surname Klicher?",How many [x0.Vehicle.model:Protege] autos are part of a [x1.Crime.type:Vehicle crime] case handled by someone with surname [x2.Officer.surname:Klicher]?,"x0.Vehicle.model:Protege = Protege
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Klicher = Klicher",3,380,count,1
650,Who is the oldest relative of anyone acquainted with a Ruiz's contact number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Ruiz"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Ruiz
Who is the oldest relative of anyone acquainted with a Ruiz's contact number?",Who is the oldest relative of anyone acquainted with a [x2.Person.surname:Ruiz]'s contact number?,x2.Person.surname:Ruiz = Ruiz,3,86,max,1
3396,What are the dates of crimes linked to individuals residing with a Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN x0.date","[Person] = Murray
What are the dates of crimes linked to individuals residing with a Murray?",What are the dates of crimes linked to individuals residing with a [x2.Person.surname:Murray]?,x2.Person.surname:Murray = Murray,3,55,attribute_set,3
2383,What area is connected to address 108 Milnthorpe Road?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""108 Milnthorpe Road"")
RETURN x0","[Location] = 108 Milnthorpe Road
What area is connected to address 108 Milnthorpe Road?",What area is connected to address [x1.Location.address:108 Milnthorpe Road]?,x1.Location.address:108 Milnthorpe Road = 108 Milnthorpe Road,2,328,entity_set,1
933,How many crimes on 14/08/2017 had a vehicle involved?,"MATCH (x0:Crime WHERE x0.date = ""14/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 14/08/2017
How many crimes on 14/08/2017 had a vehicle involved?",How many crimes on [x0.Crime.date:14/08/2017] had a vehicle involved?,x0.Crime.date:14/08/2017 = 14/08/2017,2,121,count,1
478,What are all the calls received by the number 7-(995)917-0996?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(995)917-0996"")
RETURN x0","[Phone] = 7-(995)917-0996
What are all the calls received by the number 7-(995)917-0996?",What are all the calls received by the number [x1.Phone.phoneNo:7-(995)917-0996]?,x1.Phone.phoneNo:7-(995)917-0996 = 7-(995)917-0996,2,62,entity_set,2
4613,"What is the briefest call received on the phone that also got a call on August 8, 2017?","MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_date = ""08/08/2017"")
RETURN x0
ORDER BY x0.call_duration ASC
LIMIT 1","[PhoneCall] = 08/08/2017
What is the briefest call received on the phone that also got a call on August 8, 2017?",What is the briefest call received on the phone that also got a call on [x2.PhoneCall.call_date:08/08/2017]?,"x2.PhoneCall.call_date:08/08/2017 = August 8, 2017",3,76,min,1
1882,Which individuals named Andrea have a family relation to individuals bearing the last name Lawrence?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Person] = Andrea
[Person] = Lawrence
Which individuals named Andrea have a family relation to individuals bearing the last name Lawrence?",Which individuals named [x0.Person.name:Andrea] have a family relation to individuals bearing the last name [x1.Person.surname:Lawrence]?,"x0.Person.name:Andrea = Andrea
x1.Person.surname:Lawrence = Lawrence",2,251,entity_set,1
1840,Can you show the calls to 0-(990)661-7067 made at 19:49?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""19:49"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(990)661-7067"")
RETURN x0","[PhoneCall] = 19:49
[Phone] = 0-(990)661-7067
Can you show the calls to 0-(990)661-7067 made at 19:49?",Can you show the calls to [x1.Phone.phoneNo:0-(990)661-7067] made at [x0.PhoneCall.call_time:19:49]?,"x0.PhoneCall.call_time:19:49 = 19:49
x1.Phone.phoneNo:0-(990)661-7067 = 0-(990)661-7067",2,244,entity_set,1
507,"Can you identify the officers who looked into ""Other theft"" crimes?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN x0","[Crime] = Other theft
Can you identify the officers who looked into ""Other theft"" crimes?","Can you identify the officers who looked into ""[x1.Crime.type:Other theft]"" crimes?",x1.Crime.type:Other theft = Other theft,2,65,entity_set,2140
363,Can you name the locations at 89 South Grove that have the postcode M13 0AU?,"MATCH (x0:Location WHERE x0.address = ""89 South Grove"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M13 0AU"")
RETURN x0","[Location] = 89 South Grove
[PostCode] = M13 0AU
Can you name the locations at 89 South Grove that have the postcode M13 0AU?",Can you name the locations at [x0.Location.address:89 South Grove] that have the postcode [x1.PostCode.code:M13 0AU]?,"x0.Location.address:89 South Grove = 89 South Grove
x1.PostCode.code:M13 0AU = M13 0AU",2,47,entity_set,1
1089,How many phones completed a call of 84 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""84"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 84
How many phones completed a call of 84 seconds?",How many phones completed a call of [x1.PhoneCall.call_duration:84] seconds?,x1.PhoneCall.call_duration:84 = 84,2,144,count,1
2812,How many emails are linked to individuals named Carlos who were involved in a crime on 13/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Carlos"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Carlos
[Crime] = 13/08/2017
How many emails are linked to individuals named Carlos who were involved in a crime on 13/08/2017?",How many emails are linked to individuals named [x1.Person.name:Carlos] who were involved in a crime on [x2.Crime.date:13/08/2017]?,"x1.Person.name:Carlos = Carlos
x2.Crime.date:13/08/2017 = 13/08/2017",3,409,count,1
3510,Can you provide the postal codes for the homes of the friends of the individual with NHS number 554-93-4466?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""554-93-4466"")
RETURN x0.postcode","[Person] = 554-93-4466
Can you provide the postal codes for the homes of the friends of the individual with NHS number 554-93-4466?",Can you provide the postal codes for the homes of the friends of the individual with NHS number [x2.Person.nhs_no:554-93-4466]?,x2.Person.nhs_no:554-93-4466 = 554-93-4466,3,104,attribute_set,5
255,Can you provide the homes of those with the last name Hall?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Hall"")
RETURN x0","[Person] = Hall
Can you provide the homes of those with the last name Hall?",Can you provide the homes of those with the last name [x1.Person.surname:Hall]?,x1.Person.surname:Hall = Hall,2,31,entity_set,2
261,How many incidents on 20/08/2017 involved the 2500 Club Coupe model?,"MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""2500 Club Coupe"")
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
[Vehicle] = 2500 Club Coupe
How many incidents on 20/08/2017 involved the 2500 Club Coupe model?",How many incidents on [x0.Crime.date:20/08/2017] involved the [x1.Vehicle.model:2500 Club Coupe] model?,"x0.Crime.date:20/08/2017 = 20/08/2017
x1.Vehicle.model:2500 Club Coupe = 2500 Club Coupe",2,32,count,1
2967,What are the emails of everyone related to the Woods family?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
What are the emails of everyone related to the Woods family?",What are the emails of everyone related to the [x2.Person.surname:Woods] family?,x2.Person.surname:Woods = Woods,3,430,entity_set,2
3224,Which NHS numbers belong to people contacted at 21:07?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""21:07"")
RETURN x0.nhs_no","[PhoneCall] = 21:07
Which NHS numbers belong to people contacted at 21:07?",Which NHS numbers belong to people contacted at [x2.PhoneCall.call_time:21:07]?,x2.PhoneCall.call_time:21:07 = 21:07,3,26,attribute_set,1
2185,How many Maserati vehicles are connected to offenses?,"MATCH (x0:Vehicle WHERE x0.make = ""Maserati"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Maserati
How many Maserati vehicles are connected to offenses?",How many [x0.Vehicle.make:Maserati] vehicles are connected to offenses?,x0.Vehicle.make:Maserati = Maserati,2,295,count,1
191,How many 54-second calls were made to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""54"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 54
How many 54-second calls were made to any phone?",How many [x0.PhoneCall.call_duration:54]-second calls were made to any phone?,x0.PhoneCall.call_duration:54 = 54,2,23,count,1
160,Can you identify the crimes from 19/08/2017 being handled by any officer called Leroy?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Leroy"")
RETURN x0","[Crime] = 19/08/2017
[Officer] = Leroy
Can you identify the crimes from 19/08/2017 being handled by any officer called Leroy?",Can you identify the crimes from [x0.Crime.date:19/08/2017] being handled by any officer called [x1.Officer.name:Leroy]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x1.Officer.name:Leroy = Leroy",2,18,entity_set,2
2869,Can you list the emails of people who are friends with Amanda?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Amanda"")
RETURN x0","[Person] = Amanda
Can you list the emails of people who are friends with Amanda?",Can you list the emails of people who are friends with [x2.Person.name:Amanda]?,x2.Person.name:Amanda = Amanda,3,417,entity_set,22
1890,Can you identify phones that had a call lasting 79 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""79"")
RETURN x0","[PhoneCall] = 79
Can you identify phones that had a call lasting 79 seconds?",Can you identify phones that had a call lasting [x1.PhoneCall.call_duration:79] seconds?,x1.PhoneCall.call_duration:79 = 79,2,252,entity_set,4
3056,Which crimes are associated with people sharing a residence?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0",Which crimes are associated with people sharing a residence?,Which crimes are associated with people sharing a residence?,,3,1,entity_set,46
467,Can you provide a list of offenses linked to people with the surname Morales?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Morales"")
RETURN x0","[Person] = Morales
Can you provide a list of offenses linked to people with the surname Morales?",Can you provide a list of offenses linked to people with the surname [x1.Person.surname:Morales]?,x1.Person.surname:Morales = Morales,2,61,entity_set,4
3206,Could you list the NHS numbers of those residing with others who are also linked to criminal acts?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)
MATCH (x0:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0.nhs_no",Could you list the NHS numbers of those residing with others who are also linked to criminal acts?,Could you list the NHS numbers of those residing with others who are also linked to criminal acts?,,3,23,attribute_set,46
2533,How many officers named Noland participated in crime investigations?,"MATCH (x0:Officer WHERE x0.name = ""Noland"")-[:INVESTIGATED_BY]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Officer] = Noland
How many officers named Noland participated in crime investigations?",How many officers named [x0.Officer.name:Noland] participated in crime investigations?,x0.Officer.name:Noland = Noland,2,354,count,1
3041,Could you tell me the email linked to the person with phone number 3-(259)651-7024?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(259)651-7024"")
RETURN x0","[Phone] = 3-(259)651-7024
Could you tell me the email linked to the person with phone number 3-(259)651-7024?",Could you tell me the email linked to the person with phone number [x2.Phone.phoneNo:3-(259)651-7024]?,x2.Phone.phoneNo:3-(259)651-7024 = 3-(259)651-7024,3,442,entity_set,1
1697,Can you provide a list of all homes at 155 Chapel Street belonging to anyone with last name Sims?,"MATCH (x0:Location WHERE x0.address = ""155 Chapel Street"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Sims"")
RETURN x0","[Location] = 155 Chapel Street
[Person] = Sims
Can you provide a list of all homes at 155 Chapel Street belonging to anyone with last name Sims?",Can you provide a list of all homes at [x0.Location.address:155 Chapel Street] belonging to anyone with last name [x1.Person.surname:Sims]?,"x0.Location.address:155 Chapel Street = 155 Chapel Street
x1.Person.surname:Sims = Sims",2,224,entity_set,1
2985,What is the most recent crime involving friends of people surnamed Alexander?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Alexander"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Alexander
What is the most recent crime involving friends of people surnamed Alexander?",What is the most recent crime involving friends of people surnamed [x2.Person.surname:Alexander]?,x2.Person.surname:Alexander = Alexander,3,432,max,1
364,What are the places at 152 Chestnut Avenue with the postcode M43 7SA?,"MATCH (x0:Location WHERE x0.address = ""152 Chestnut Avenue"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M43 7SA"")
RETURN x0","[Location] = 152 Chestnut Avenue
[PostCode] = M43 7SA
What are the places at 152 Chestnut Avenue with the postcode M43 7SA?",What are the places at [x0.Location.address:152 Chestnut Avenue] with the postcode [x1.PostCode.code:M43 7SA]?,"x0.Location.address:152 Chestnut Avenue = 152 Chestnut Avenue
x1.PostCode.code:M43 7SA = M43 7SA",2,47,entity_set,1
2637,What is the number of Probe vehicles tied to a vehicle crime handled by someone with last name Cosslett?,"MATCH (x0:Vehicle WHERE x0.model = ""Probe"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cosslett"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Probe
[Crime] = Vehicle crime
[Officer] = Cosslett
What is the number of Probe vehicles tied to a vehicle crime handled by someone with last name Cosslett?",What is the number of [x0.Vehicle.model:Probe] vehicles tied to a [x1.Crime.type:Vehicle crime] handled by someone with last name [x2.Officer.surname:Cosslett]?,"x0.Vehicle.model:Probe = Probe
x1.Crime.type:Vehicle crime = vehicle crime
x2.Officer.surname:Cosslett = Cosslett",3,380,count,1
861,How many Donalds were implicated in crimes on 24/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Donald"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""24/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Donald
[Crime] = 24/08/2017
How many Donalds were implicated in crimes on 24/08/2017?",How many [x0.Person.name:Donald] were implicated in crimes on [x1.Crime.date:24/08/2017]?,"x0.Person.name:Donald = Donalds
x1.Crime.date:24/08/2017 = 24/08/2017",2,113,count,1
440,What is the email count for individuals with the surname Nguyen?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN COUNT(DISTINCT x0)","[Person] = Nguyen
What is the email count for individuals with the surname Nguyen?",What is the email count for individuals with the surname [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,58,count,1
2319,Can you identify all Stephanies connected to offenses on 20th August 2017?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Person] = Stephanie
[Crime] = 20/08/2017
Can you identify all Stephanies connected to offenses on 20th August 2017?",Can you identify all [x0.Person.name:Stephanie] connected to offenses on [x1.Crime.date:20/08/2017]?,"x0.Person.name:Stephanie = Stephanies
x1.Crime.date:20/08/2017 = 20th August 2017",2,313,entity_set,1
3097,How many offenses involve a Hughes who is friends with Bonnie?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Bonnie"")
RETURN COUNT(DISTINCT x0)","[Person] = Hughes
[Person] = Bonnie
How many offenses involve a Hughes who is friends with Bonnie?",How many offenses involve a [x1.Person.surname:Hughes] who is friends with [x2.Person.name:Bonnie]?,"x1.Person.surname:Hughes = Hughes
x2.Person.name:Bonnie = Bonnie",3,7,count,1
1959,What is the number of phones owned by the individual with NHS number 577-08-1339?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""577-08-1339"")
RETURN COUNT(DISTINCT x0)","[Person] = 577-08-1339
What is the number of phones owned by the individual with NHS number 577-08-1339?",What is the number of phones owned by the individual with NHS number [x1.Person.nhs_no:577-08-1339]?,x1.Person.nhs_no:577-08-1339 = 577-08-1339,2,263,count,1
384,What is the newest crime linked to Sigma model cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Sigma"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Sigma
What is the newest crime linked to Sigma model cars?",What is the newest crime linked to [x1.Vehicle.model:Sigma] model cars?,x1.Vehicle.model:Sigma = Sigma,2,51,max,1
362,Which spots at 89 South Grove share the postcode M13 0AU?,"MATCH (x0:Location WHERE x0.address = ""89 South Grove"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M13 0AU"")
RETURN x0","[Location] = 89 South Grove
[PostCode] = M13 0AU
Which spots at 89 South Grove share the postcode M13 0AU?",Which spots at [x0.Location.address:89 South Grove] share the postcode [x1.PostCode.code:M13 0AU]?,"x0.Location.address:89 South Grove = 89 South Grove
x1.PostCode.code:M13 0AU = M13 0AU",2,47,entity_set,1
906,Which offenses took place on 23rd August 2017 at 36 High Street?,"MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""36 High Street"")
RETURN x0","[Crime] = 23/08/2017
[Location] = 36 High Street
Which offenses took place on 23rd August 2017 at 36 High Street?",Which offenses took place on [x0.Crime.date:23/08/2017] at [x1.Location.address:36 High Street]?,"x0.Crime.date:23/08/2017 = 23rd August 2017 
x1.Location.address:36 High Street = 36 High Street",2,118,entity_set,1
303,"What is the number of locations where crimes were concluded as ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
What is the number of locations where crimes were concluded as ""Investigation complete; no suspect identified""?","What is the number of locations where crimes were concluded as ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]""?",x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified,2,38,count,1
899,"Can you provide a list of crimes on August 1, 2017, at 48 Barlow Lane?","MATCH (x0:Crime WHERE x0.date = ""1/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""48 Barlow Lane"")
RETURN x0","[Crime] = 1/08/2017
[Location] = 48 Barlow Lane
Can you provide a list of crimes on August 1, 2017, at 48 Barlow Lane?","Can you provide a list of crimes on [x0.Crime.date:1/08/2017], at [x1.Location.address:48 Barlow Lane]?","x0.Crime.date:1/08/2017 = August 1, 2017 
x1.Location.address:48 Barlow Lane = 48 Barlow Lane",2,118,entity_set,1
2439,What is the number of sites within the BL3 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""BL3"")
RETURN COUNT(DISTINCT x0)","[Area] = BL3
What is the number of sites within the BL3 area code?",What is the number of sites within the [x1.Area.areaCode:BL3] area code?,x1.Area.areaCode:BL3 = BL3,2,337,count,1
4450,What email addresses belong to a person sharing a home with Rachel?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Rachel"")
RETURN x0.email_address","[Person] = Rachel
What email addresses belong to a person sharing a home with Rachel?",What email addresses belong to a person sharing a home with [x2.Person.name:Rachel]?,x2.Person.name:Rachel = Rachel,3,29,attribute_set,4
2320,Which people named Stephanie were implicated in crimes on 08/20/2017?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Person] = Stephanie
[Crime] = 20/08/2017
Which people named Stephanie were implicated in crimes on 08/20/2017?",Which people named [x0.Person.name:Stephanie] were implicated in crimes on [x1.Crime.date:20/08/2017]?,"x0.Person.name:Stephanie = Stephanie
x1.Crime.date:20/08/2017 = 08/20/2017",2,313,entity_set,1
684,How many homes belong to individuals named Irene?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
How many homes belong to individuals named Irene?",How many homes belong to individuals named [x1.Person.name:Irene]?,x1.Person.name:Irene = Irene,2,90,count,1
2198,Who knows the phone number of someone surnamed Allen?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Allen"")
RETURN COUNT(DISTINCT x0)","[Person] = Allen
Who knows the phone number of someone surnamed Allen?",Who knows the phone number of someone surnamed [x1.Person.surname:Allen]?,x1.Person.surname:Allen = Allen,2,297,count,1
168,Can you name the individuals whose phone numbers are known to a person with NHS number 780-64-7865?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.nhs_no = ""780-64-7865"")
RETURN x0","[Person] = 780-64-7865
Can you name the individuals whose phone numbers are known to a person with NHS number 780-64-7865?",Can you name the individuals whose phone numbers are known to a person with NHS number [x1.Person.nhs_no:780-64-7865]?,x1.Person.nhs_no:780-64-7865 = 780-64-7865,2,19,entity_set,1
2788,When was the earliest crime involving a Moreno family member committed?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Moreno"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Moreno
When was the earliest crime involving a Moreno family member committed?",When was the earliest crime involving a [x2.Person.surname:Moreno] family member committed?,x2.Person.surname:Moreno = Moreno,3,405,argmin,1
950,What is the number of phone calls any phone got on 29/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 29/08/2017
What is the number of phone calls any phone got on 29/08/2017?",What is the number of phone calls any phone got on [x0.PhoneCall.call_date:29/08/2017]?,x0.PhoneCall.call_date:29/08/2017 = 29/08/2017,2,124,count,1
2806,How many emails from people named Craig who were linked to a crime on 31/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Craig"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Craig
[Crime] = 31/08/2017
How many emails from people named Craig who were linked to a crime on 31/08/2017?",How many emails from people named [x1.Person.name:Craig] who were linked to a crime on [x2.Crime.date:31/08/2017]?,"x1.Person.name:Craig = Craig
x2.Crime.date:31/08/2017 = 31/08/2017",3,409,count,1
115,How many people called Lillian are familiar with a Cunningham?,"MATCH (x0:Person WHERE x0.name = ""Lillian"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Cunningham"")
RETURN COUNT(DISTINCT x0)","[Person] = Lillian
[Person] = Cunningham
How many people called Lillian are familiar with a Cunningham?",How many people called [x0.Person.name:Lillian] are familiar with a [x1.Person.surname:Cunningham]?,"x0.Person.name:Lillian = Lillian
x1.Person.surname:Cunningham = Cunningham",2,13,count,1
548,What's the count of Irenes living at 53 Trevor Road?,"MATCH (x0:Person WHERE x0.name = ""Irene"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""53 Trevor Road"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
[Location] = 53 Trevor Road
What's the count of Irenes living at 53 Trevor Road?",What's the count of [x0.Person.name:Irene] living at [x1.Location.address:53 Trevor Road]?,"x0.Person.name:Irene = Irenes
x1.Location.address:53 Trevor Road = 53 Trevor Road",2,71,count,1
2029,Which post codes fall under the M34 area code?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M34"")
RETURN x0","[Area] = M34
Which post codes fall under the M34 area code?",Which post codes fall under the [x1.Area.areaCode:M34] area code?,x1.Area.areaCode:M34 = M34,2,272,entity_set,203
1153,How many Antonios are acquainted with any Carolyns?,"MATCH (x0:Person WHERE x0.name = ""Antonio"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Carolyn"")
RETURN COUNT(DISTINCT x0)","[Person] = Antonio
[Person] = Carolyn
How many Antonios are acquainted with any Carolyns?",How many [x0.Person.name:Antonio] are acquainted with any [x1.Person.name:Carolyn]?,"x0.Person.name:Antonio = Antonios
x1.Person.name:Carolyn = Carolyns",2,153,count,1
203,Who are the relatives of individuals named Christopher?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Christopher"")
RETURN x0","[Person] = Christopher
Who are the relatives of individuals named Christopher?",Who are the relatives of individuals named [x1.Person.name:Christopher]?,x1.Person.name:Christopher = Christopher,2,24,entity_set,8
75,"At 22:26, how many phones were called?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""22:26"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 22:26
At 22:26, how many phones were called?","At [x1.PhoneCall.call_time:22:26], how many phones were called?",x1.PhoneCall.call_time:22:26 = 22:26,2,9,count,1
638,Can you identify everyone who has the phone number of a Myers?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Myers"")
RETURN x0","[Person] = Myers
Can you identify everyone who has the phone number of a Myers?",Can you identify everyone who has the phone number of a [x1.Person.surname:Myers]?,x1.Person.surname:Myers = Myers,2,84,entity_set,1
3066,What are the NHS numbers of individuals related to someone named Alan who shares a residence with another person?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Alan"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Alan
What are the NHS numbers of individuals related to someone named Alan who shares a residence with another person?",What are the NHS numbers of individuals related to someone named [x1.Person.name:Alan] who shares a residence with another person?,x1.Person.name:Alan = Alan,3,3,attribute_set,2
