id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1131,What is the count of calls received by 5-(210)690-9847 on 17/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""17/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(210)690-9847"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 17/08/2017
[Phone] = 5-(210)690-9847
What is the count of calls received by 5-(210)690-9847 on 17/08/2017?",What is the count of calls received by [x1.Phone.phoneNo:5-(210)690-9847] on [x0.PhoneCall.call_date:17/08/2017]?,"x0.PhoneCall.call_date:17/08/2017 = 17/08/2017
x1.Phone.phoneNo:5-(210)690-9847 = 5-(210)690-9847",2,150,count,1
3670,Which NHS numbers belong to those related with a person residing in BL4 7BN postcode locations?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""BL4 7BN"")
RETURN x0.nhs_no","[Location] = BL4 7BN
Which NHS numbers belong to those related with a person residing in BL4 7BN postcode locations?",Which NHS numbers belong to those related with a person residing in [x2.Location.postcode:BL4 7BN] postcode locations?,x2.Location.postcode:BL4 7BN = BL4 7BN,3,172,attribute_set,2
3433,How much time did Diane's longest received call last?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Diane"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Diane
How much time did Diane's longest received call last?",How much time did [x2.Person.name:Diane]'s longest received call last?,x2.Person.name:Diane = Diane,3,66,argmax,1
1442,What is the number of crimes from 13th August 2017 under investigation by badge number 81-9146789?,"MATCH (x0:Crime WHERE x0.date = ""13/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""81-9146789"")
RETURN COUNT(DISTINCT x0)","[Crime] = 13/08/2017
[Officer] = 81-9146789
What is the number of crimes from 13th August 2017 under investigation by badge number 81-9146789?",What is the number of crimes from [x0.Crime.date:13/08/2017] under investigation by badge number [x1.Officer.badge_no:81-9146789]?,"x0.Crime.date:13/08/2017 = 13th August 2017 
x1.Officer.badge_no:81-9146789 = 81-9146789",2,190,count,1
415,What are all the places with the postcode M9 8DA?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M9 8DA"")
RETURN x0","[PostCode] = M9 8DA
What are all the places with the postcode M9 8DA?",What are all the places with the postcode [x1.PostCode.code:M9 8DA]?,x1.PostCode.code:M9 8DA = M9 8DA,2,54,entity_set,2
3397,Can you provide the dates of offenses involving a cohabitant of a person with the last name Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN x0.date","[Person] = Murray
Can you provide the dates of offenses involving a cohabitant of a person with the last name Murray?",Can you provide the dates of offenses involving a cohabitant of a person with the last name [x2.Person.surname:Murray]?,x2.Person.surname:Murray = Murray,3,55,attribute_set,3
1041,How many individuals named Stephanie cohabit with a Mary?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Mary"")
RETURN COUNT(DISTINCT x0)","[Person] = Stephanie
[Person] = Mary
How many individuals named Stephanie cohabit with a Mary?",How many individuals named [x0.Person.name:Stephanie] cohabit with a [x1.Person.name:Mary]?,"x0.Person.name:Stephanie = Stephanie
x1.Person.name:Mary = Mary",2,138,count,1
389,Which crime happened last with Kizashi cars involved?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Kizashi"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Kizashi
Which crime happened last with Kizashi cars involved?",Which crime happened last with [x1.Vehicle.model:Kizashi] cars involved?,x1.Vehicle.model:Kizashi = Kizashi,2,51,max,1
1969,How many calls to any phone occurred at 07:55?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""07:55"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 07:55
How many calls to any phone occurred at 07:55?",How many calls to any phone occurred at [x0.PhoneCall.call_time:07:55]?,x0.PhoneCall.call_time:07:55 = 07:55,2,265,count,1
2413,Can you identify the phones that called on 03/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_date = ""03/08/2017"")
RETURN x0","[PhoneCall] = 03/08/2017
Can you identify the phones that called on 03/08/2017?",Can you identify the phones that called on [x1.PhoneCall.call_date:03/08/2017]?,x1.PhoneCall.call_date:03/08/2017 = 03/08/2017,2,333,entity_set,19
4525,When was the earliest crime at 60 Victoria Avenue that Officer Cawkwell looked into?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Victoria Avenue"")
MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Cawkwell"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Victoria Avenue
[Officer] = Cawkwell
When was the earliest crime at 60 Victoria Avenue that Officer Cawkwell looked into?",When was the earliest crime at [x1.Location.address:60 Victoria Avenue] that Officer [x2.Officer.surname:Cawkwell] looked into?,"x1.Location.address:60 Victoria Avenue = 60 Victoria Avenue
x2.Officer.surname:Cawkwell = Cawkwell",3,48,argmin,1
103,"On August 13, 2017, how many Mercedes-Benz vehicles were associated with crimes?","MATCH (x0:Vehicle WHERE x0.make = ""Mercedes-Benz"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Mercedes-Benz
[Crime] = 13/08/2017
On August 13, 2017, how many Mercedes-Benz vehicles were associated with crimes?","On [x1.Crime.date:13/08/2017], how many [x0.Vehicle.make:Mercedes-Benz] vehicles were associated with crimes?","x0.Vehicle.make:Mercedes-Benz = Mercedes-Benz
x1.Crime.date:13/08/2017 = August 13, 2017",2,12,count,1
795,"On 2/08/2017, how many criminal incidents were reported in places with SK2 5DE postcode?","MATCH (x0:Crime WHERE x0.date = ""2/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK2 5DE"")
RETURN COUNT(DISTINCT x0)","[Crime] = 2/08/2017
[Location] = SK2 5DE
On 2/08/2017, how many criminal incidents were reported in places with SK2 5DE postcode?","On [x0.Crime.date:2/08/2017], how many criminal incidents were reported in places with [x1.Location.postcode:SK2 5DE] postcode?","x0.Crime.date:2/08/2017 = 2/08/2017
x1.Location.postcode:SK2 5DE = SK2 5DE",2,104,count,1
3194,What are the last names of people tied to crimes at the location BL1 4AR?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL1 4AR"")
RETURN x0.surname","[Location] = BL1 4AR
What are the last names of people tied to crimes at the location BL1 4AR?",What are the last names of people tied to crimes at the location [x2.Location.postcode:BL1 4AR]?,x2.Location.postcode:BL1 4AR = BL1 4AR,3,21,attribute_set,2
1564,How many cars from 1996 are connected to criminal activities?,"MATCH (x0:Vehicle WHERE x0.year = ""1996"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1996
How many cars from 1996 are connected to criminal activities?",How many cars from [x0.Vehicle.year:1996] are connected to criminal activities?,x0.Vehicle.year:1996 = 1996,2,207,count,1
968,What's the count of people called Stephanie who have a friend?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Stephanie
What's the count of people called Stephanie who have a friend?",What's the count of people called [x0.Person.name:Stephanie] who have a friend?,x0.Person.name:Stephanie = Stephanie,2,126,count,1
1292,What is the count of violence and sexual offences at any place?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
What is the count of violence and sexual offences at any place?",What is the count of [x0.Crime.type:Violence and sexual offences] at any place?,x0.Crime.type:Violence and sexual offences = violence and sexual offences,2,171,count,1
1381,How many calls did the number 2-(362)925-2397 get?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""2-(362)925-2397"")
RETURN COUNT(DISTINCT x0)","[Phone] = 2-(362)925-2397
How many calls did the number 2-(362)925-2397 get?",How many calls did the number [x1.Phone.phoneNo:2-(362)925-2397] get?,x1.Phone.phoneNo:2-(362)925-2397 = 2-(362)925-2397,2,181,count,1
3629,What are the last names of friends of individuals linked to a Vehicle crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.surname","[Crime] = Vehicle crime
What are the last names of friends of individuals linked to a Vehicle crime?",What are the last names of friends of individuals linked to a [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = Vehicle crime,3,148,attribute_set,41
1137,Can you identify the phones that called at 14:59?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""14:59"")
RETURN x0","[PhoneCall] = 14:59
Can you identify the phones that called at 14:59?",Can you identify the phones that called at [x1.PhoneCall.call_time:14:59]?,x1.PhoneCall.call_time:14:59 = 14:59,2,151,entity_set,2
2356,What is the count of vehicles used in crimes?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",What is the count of vehicles used in crimes?,What is the count of vehicles used in crimes?,,2,320,count,1
3280,Can you identify the most recent call to the phone linked to NHS number 218-31-0921?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""218-31-0921"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 218-31-0921
Can you identify the most recent call to the phone linked to NHS number 218-31-0921?",Can you identify the most recent call to the phone linked to NHS number [x2.Person.nhs_no:218-31-0921]?,x2.Person.nhs_no:218-31-0921 = 218-31-0921,3,36,max,1
1152,Can you provide a list of violent and sexual offences investigated by officers whose last name is Piche?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Piche"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = Piche
Can you provide a list of violent and sexual offences investigated by officers whose last name is Piche?",Can you provide a list of [x0.Crime.type:Violence and sexual offences] investigated by officers whose last name is [x1.Officer.surname:Piche]?,"x0.Crime.type:Violence and sexual offences = violent and sexual offences 
x1.Officer.surname:Piche = Piche",2,152,entity_set,8
3395,When did crimes occur involving a person living with someone with last name Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN x0.date","[Person] = Murray
When did crimes occur involving a person living with someone with last name Murray?",When did crimes occur involving a person living with someone with last name [x2.Person.surname:Murray]?,x2.Person.surname:Murray = Murray,3,55,attribute_set,3
3271,Can you provide the phone number of someone who is friends with the individual having NHS number 306-99-5229?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""306-99-5229"")
RETURN x0.phoneNo","[Person] = 306-99-5229
Can you provide the phone number of someone who is friends with the individual having NHS number 306-99-5229?",Can you provide the phone number of someone who is friends with the individual having NHS number [x2.Person.nhs_no:306-99-5229]?,x2.Person.nhs_no:306-99-5229 = 306-99-5229,3,35,attribute_set,1
7,Which criminal activities on 17/08/2017 involved someone with the last name Williamson?,"MATCH (x0:Crime WHERE x0.date = ""17/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0","[Crime] = 17/08/2017
[Person] = Williamson
Which criminal activities on 17/08/2017 involved someone with the last name Williamson?",Which criminal activities on [x0.Crime.date:17/08/2017] involved someone with the last name [x1.Person.surname:Williamson]?,"x0.Crime.date:17/08/2017 = 17/08/2017
x1.Person.surname:Williamson = Williamson",2,1,entity_set,1
3543,When did violence and sexual offences happen in the location with area code BL2?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""BL2"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = BL2
When did violence and sexual offences happen in the location with area code BL2?",When did [x0.Crime.type:Violence and sexual offences] happen in the location with area code [x2.Area.areaCode:BL2]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x2.Area.areaCode:BL2 = BL2",3,111,attribute_set,197
2501,What is the number of postcodes in the WN2 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""WN2"")
RETURN COUNT(DISTINCT x0)","[Area] = WN2
What is the number of postcodes in the WN2 area?",What is the number of postcodes in the [x1.Area.areaCode:WN2] area?,x1.Area.areaCode:WN2 = WN2,2,348,count,1
707,Can you show me the calls from 8-(342)691-8174 at 6 PM?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""18:00"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(342)691-8174"")
RETURN x0","[PhoneCall] = 18:00
[Phone] = 8-(342)691-8174
Can you show me the calls from 8-(342)691-8174 at 6 PM?",Can you show me the calls from [x1.Phone.phoneNo:8-(342)691-8174] at [x0.PhoneCall.call_time:18:00]?,"x0.PhoneCall.call_time:18:00 = 6 PM
x1.Phone.phoneNo:8-(342)691-8174 = 8-(342)691-8174",2,93,entity_set,1
3544,Can you provide the dates for violence and sexual offences in the BL2 region?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""BL2"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = BL2
Can you provide the dates for violence and sexual offences in the BL2 region?",Can you provide the dates for [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:BL2] region?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x2.Area.areaCode:BL2 = BL2",3,111,attribute_set,197
353,What is the count of crimes linked to individuals with the surname Mills?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Mills"")
RETURN COUNT(DISTINCT x0)","[Person] = Mills
What is the count of crimes linked to individuals with the surname Mills?",What is the count of crimes linked to individuals with the surname [x1.Person.surname:Mills]?,x1.Person.surname:Mills = Mills,2,44,count,1
104,"How many Fords were linked to crimes on August 23, 2017?","MATCH (x0:Vehicle WHERE x0.make = ""Ford"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Ford
[Crime] = 23/08/2017
How many Fords were linked to crimes on August 23, 2017?",How many [x0.Vehicle.make:Ford]s were linked to crimes on [x1.Crime.date:23/08/2017]?,"x0.Vehicle.make:Ford = Ford
x1.Crime.date:23/08/2017 = August 23, 2017",2,12,count,1
2521,Which locations fall under the M30 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M30"")
RETURN x0","[Area] = M30
Which locations fall under the M30 area code?",Which locations fall under the [x1.Area.areaCode:M30] area code?,x1.Area.areaCode:M30 = M30,2,351,entity_set,210
1301,What is the count of 69-second phone calls received?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""69"")-[:CALLED]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 69
What is the count of 69-second phone calls received?",What is the count of [x0.PhoneCall.call_duration:69]-second phone calls received?,x0.PhoneCall.call_duration:69 = 69,2,172,count,1
2025,Can you provide the post codes for the M44 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M44"")
RETURN x0","[Area] = M44
Can you provide the post codes for the M44 area?",Can you provide the post codes for the [x1.Area.areaCode:M44] area?,x1.Area.areaCode:M44 = M44,2,272,entity_set,89
493,How many crimes with a suspended sentence involve someone with surname Williamson?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Offender given suspended prison sentence"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Offender given suspended prison sentence
[Person] = Williamson
How many crimes with a suspended sentence involve someone with surname Williamson?",How many crimes with a [x0.Crime.last_outcome:Offender given suspended prison sentence] involve someone with surname [x1.Person.surname:Williamson]?,"x0.Crime.last_outcome:Offender given suspended prison sentence = suspended sentence
x1.Person.surname:Williamson = Williamson",2,64,count,1
1837,Can you show the calls at 11:28 that went to 5-(583)536-4990?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""11:28"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(583)536-4990"")
RETURN x0","[PhoneCall] = 11:28
[Phone] = 5-(583)536-4990
Can you show the calls at 11:28 that went to 5-(583)536-4990?",Can you show the calls at [x0.PhoneCall.call_time:11:28] that went to [x1.Phone.phoneNo:5-(583)536-4990]?,"x0.PhoneCall.call_time:11:28 = 11:28
x1.Phone.phoneNo:5-(583)536-4990 = 5-(583)536-4990",2,244,entity_set,1
396,Can you provide the names of Police Constables who looked into crimes on 20/08/2017?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Officer] = Police Constable
[Crime] = 20/08/2017
Can you provide the names of Police Constables who looked into crimes on 20/08/2017?",Can you provide the names of [x0.Officer.rank:Police Constable] who looked into crimes on [x1.Crime.date:20/08/2017]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:20/08/2017 = 20/08/2017",2,52,entity_set,344
361,What are the places at 89 South Grove with the postcode M13 0AU?,"MATCH (x0:Location WHERE x0.address = ""89 South Grove"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M13 0AU"")
RETURN x0","[Location] = 89 South Grove
[PostCode] = M13 0AU
What are the places at 89 South Grove with the postcode M13 0AU?",What are the places at [x0.Location.address:89 South Grove] with the postcode [x1.PostCode.code:M13 0AU]?,"x0.Location.address:89 South Grove = 89 South Grove
x1.PostCode.code:M13 0AU = M13 0AU",2,47,entity_set,1
2623,How many sites have crimes occurred at?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",How many sites have crimes occurred at?,How many sites have crimes occurred at?,,2,378,count,1
1328,In how many zones can you find locations with the postal code M16 9PW?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M16 9PW"")
RETURN COUNT(DISTINCT x0)","[Location] = M16 9PW
In how many zones can you find locations with the postal code M16 9PW?",In how many zones can you find locations with the postal code [x1.Location.postcode:M16 9PW]?,x1.Location.postcode:M16 9PW = M16 9PW,2,175,count,1
3512,What are the zip codes for the homes of the friends of the individual with NHS number 664-34-9245?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""664-34-9245"")
RETURN x0.postcode","[Person] = 664-34-9245
What are the zip codes for the homes of the friends of the individual with NHS number 664-34-9245?",What are the zip codes for the homes of the friends of the individual with NHS number [x2.Person.nhs_no:664-34-9245]?,x2.Person.nhs_no:664-34-9245 = 664-34-9245,3,104,attribute_set,6
1272,How many people called Scott are friends with a person with last name Alexander?,"MATCH (x0:Person WHERE x0.name = ""Scott"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Alexander"")
RETURN COUNT(DISTINCT x0)","[Person] = Scott
[Person] = Alexander
How many people called Scott are friends with a person with last name Alexander?",How many people called [x0.Person.name:Scott] are friends with a person with last name [x1.Person.surname:Alexander]?,"x0.Person.name:Scott = Scott
x1.Person.surname:Alexander = Alexander",2,169,count,1
1909,How many individuals called Amanda cohabit with a person whose NHS number is 260-95-0836?,"MATCH (x0:Person WHERE x0.name = ""Amanda"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""260-95-0836"")
RETURN COUNT(DISTINCT x0)","[Person] = Amanda
[Person] = 260-95-0836
How many individuals called Amanda cohabit with a person whose NHS number is 260-95-0836?",How many individuals called [x0.Person.name:Amanda] cohabit with a person whose NHS number is [x1.Person.nhs_no:260-95-0836]?,"x0.Person.name:Amanda = Amanda
x1.Person.nhs_no:260-95-0836 = 260-95-0836",2,254,count,1
2920,What are the dates of criminal activities by those residing at 199 Sandringham Drive?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""199 Sandringham Drive"")
RETURN x0.date","[Location] = 199 Sandringham Drive
What are the dates of criminal activities by those residing at 199 Sandringham Drive?",What are the dates of criminal activities by those residing at [x2.Location.address:199 Sandringham Drive]?,x2.Location.address:199 Sandringham Drive = 199 Sandringham Drive,3,424,attribute_set,1
3274,Can you provide the phone number of someone who is friends with the individual having NHS number 552-54-9978?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""552-54-9978"")
RETURN x0.phoneNo","[Person] = 552-54-9978
Can you provide the phone number of someone who is friends with the individual having NHS number 552-54-9978?",Can you provide the phone number of someone who is friends with the individual having NHS number [x2.Person.nhs_no:552-54-9978]?,x2.Person.nhs_no:552-54-9978 = 552-54-9978,3,35,attribute_set,1
2607,What is the number of crimes handled by officers with the surname Kitchingham?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Kitchingham"")
RETURN COUNT(DISTINCT x0)","[Officer] = Kitchingham
What is the number of crimes handled by officers with the surname Kitchingham?",What is the number of crimes handled by officers with the surname [x1.Officer.surname:Kitchingham]?,x1.Officer.surname:Kitchingham = Kitchingham,2,372,count,1
1968,"At 07:55, how many calls were made to any phone?","MATCH (x0:PhoneCall WHERE x0.call_time = ""07:55"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 07:55
At 07:55, how many calls were made to any phone?","At [x0.PhoneCall.call_time:07:55], how many calls were made to any phone?",x0.PhoneCall.call_time:07:55 = 07:55,2,265,count,1
2188,How many officers named Eimile were involved in cases with the status Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.name = ""Eimile"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Officer] = Eimile
[Crime] = Unable to prosecute suspect
How many officers named Eimile were involved in cases with the status Unable to prosecute suspect?",How many officers named [x0.Officer.name:Eimile] were involved in cases with the status [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.name:Eimile = Eimile
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,296,count,1
1025,What's the date of the last crime reported at a location with SK7 6LQ as the postcode?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""SK7 6LQ"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = SK7 6LQ
What's the date of the last crime reported at a location with SK7 6LQ as the postcode?",What's the date of the last crime reported at a location with [x2.PostCode.code:SK7 6LQ] as the postcode?,x2.PostCode.code:SK7 6LQ = SK7 6LQ,3,135,argmax,1
757,What was the first crime at 150 Hugh Oldham Drive?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""150 Hugh Oldham Drive"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 150 Hugh Oldham Drive
What was the first crime at 150 Hugh Oldham Drive?",What was the first crime at [x1.Location.address:150 Hugh Oldham Drive]?,x1.Location.address:150 Hugh Oldham Drive = 150 Hugh Oldham Drive,2,100,min,1
3155,Could you list the NHS numbers of Roses whose friends share a home with others?,"MATCH (x0:Person WHERE x0.name = ""Rose"")-[:KNOWS_SN]-(x1:Person)-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Rose
Could you list the NHS numbers of Roses whose friends share a home with others?",Could you list the NHS numbers of [x0.Person.name:Rose] whose friends share a home with others?,x0.Person.name:Rose = Roses,3,15,attribute_set,1
3062,Could you list the NHS numbers of people related with Harry who also cohabitates with another individual?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.name = ""Harry"")-[:KNOWS_LW]-(x2:Person)
RETURN x0.nhs_no","[Person] = Harry
Could you list the NHS numbers of people related with Harry who also cohabitates with another individual?",Could you list the NHS numbers of people related with [x1.Person.name:Harry] who also cohabitates with another individual?,x1.Person.name:Harry = Harry,3,3,attribute_set,8
802,What are the badge numbers of officers who investigated crimes on 10/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN x0.badge_no","[Crime] = 10/08/2017
What are the badge numbers of officers who investigated crimes on 10/08/2017?",What are the badge numbers of officers who investigated crimes on [x1.Crime.date:10/08/2017]?,x1.Crime.date:10/08/2017 = 10/08/2017,2,106,attribute_set,972
333,Who are the inhabitants of 182 Elm Road?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""182 Elm Road"")
RETURN x0","[Location] = 182 Elm Road
Who are the inhabitants of 182 Elm Road?",Who are the inhabitants of [x1.Location.address:182 Elm Road]?,x1.Location.address:182 Elm Road = 182 Elm Road,2,42,entity_set,1
78,"At 19:19, how many phones were called?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_time = ""19:19"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:19
At 19:19, how many phones were called?","At [x1.PhoneCall.call_time:19:19], how many phones were called?",x1.PhoneCall.call_time:19:19 = 19:19,2,9,count,1
3630,Can you provide the surnames of those who are friends with someone connected to a Vehicle crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.type = ""Vehicle crime"")
RETURN x0.surname","[Crime] = Vehicle crime
Can you provide the surnames of those who are friends with someone connected to a Vehicle crime?",Can you provide the surnames of those who are friends with someone connected to a [x2.Crime.type:Vehicle crime]?,x2.Crime.type:Vehicle crime = Vehicle crime,3,148,attribute_set,41
807,"Which officers' badge numbers are linked to investigations from August 14, 2017?","MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""14/08/2017"")
RETURN x0.badge_no","[Crime] = 14/08/2017
Which officers' badge numbers are linked to investigations from August 14, 2017?",Which officers' badge numbers are linked to investigations from [x1.Crime.date:14/08/2017]?,"x1.Crime.date:14/08/2017 = August 14, 2017",2,106,attribute_set,959
1745,In how many places do people with last name Murphy live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Murphy"")
RETURN COUNT(DISTINCT x0)","[Person] = Murphy
In how many places do people with last name Murphy live?",In how many places do people with last name [x1.Person.surname:Murphy] live?,x1.Person.surname:Murphy = Murphy,2,232,count,1
1592,What are the post codes linked to crime locations on 25/08/2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""25/08/2017"")
RETURN x0","[Crime] = 25/08/2017
What are the post codes linked to crime locations on 25/08/2017?",What are the post codes linked to crime locations on [x2.Crime.date:25/08/2017]?,x2.Crime.date:25/08/2017 = 25/08/2017,3,211,entity_set,927
1469,Can you provide a list of phones for individuals with last name Kennedy?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Kennedy"")
RETURN x0","[Person] = Kennedy
Can you provide a list of phones for individuals with last name Kennedy?",Can you provide a list of phones for individuals with last name [x1.Person.surname:Kennedy]?,x1.Person.surname:Kennedy = Kennedy,2,193,entity_set,1
108,How many individuals named Amy are familiar with someone whose last name is Weaver?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Weaver"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Weaver
How many individuals named Amy are familiar with someone whose last name is Weaver?",How many individuals named [x0.Person.name:Amy] are familiar with someone whose last name is [x1.Person.surname:Weaver]?,"x0.Person.name:Amy = Amy
x1.Person.surname:Weaver = Weaver",2,13,count,1
2464,Which crime involving an G37 model did an officer with surname Thornber first investigate?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Thornber"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""G37"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Thornber
[Vehicle] = G37
Which crime involving an G37 model did an officer with surname Thornber first investigate?",Which crime involving an [x1.Vehicle.model:G37] model did an officer with surname [x2.Officer.surname:Thornber] first investigate?,"x1.Vehicle.model:G37 = G37
x2.Officer.surname:Thornber = Thornber",3,341,min,1
232,What phone calls were made to 9-(033)345-4193 on 07/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""07/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(033)345-4193"")
RETURN x0","[PhoneCall] = 07/08/2017
[Phone] = 9-(033)345-4193
What phone calls were made to 9-(033)345-4193 on 07/08/2017?",What phone calls were made to [x1.Phone.phoneNo:9-(033)345-4193] on [x0.PhoneCall.call_date:07/08/2017]?,"x0.PhoneCall.call_date:07/08/2017 = 07/08/2017
x1.Phone.phoneNo:9-(033)345-4193 = 9-(033)345-4193",2,29,entity_set,1
3356,What are the email addresses of individuals residing in WN1 1SE postcode locations?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""WN1 1SE"")
RETURN x0.email_address","[Location] = WN1 1SE
What are the email addresses of individuals residing in WN1 1SE postcode locations?",What are the email addresses of individuals residing in [x2.Location.postcode:WN1 1SE] postcode locations?,x2.Location.postcode:WN1 1SE = WN1 1SE,3,45,attribute_set,1
682,In how many places does someone named Irene live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Irene
In how many places does someone named Irene live?",In how many places does someone named [x1.Person.name:Irene] live?,x1.Person.name:Irene = Irene,2,90,count,1
4495,How many 15-second phone calls were received by a phone after it called at 14:48?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""15"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_time = ""14:48"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 15
[PhoneCall] = 14:48
How many 15-second phone calls were received by a phone after it called at 14:48?",How many [x0.PhoneCall.call_duration:15]-second phone calls were received by a phone after it called at [x2.PhoneCall.call_time:14:48]?,"x0.PhoneCall.call_duration:15 = 15
x2.PhoneCall.call_time:14:48 = 14:48",3,41,count,1
