id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
4483,What are the NHS numbers of Stevens related to the individual with NHS number 641-55-5639?,"MATCH (x0:Person WHERE x0.name = ""Steven"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""641-55-5639"")
RETURN x0.nhs_no","[Person] = Steven
[Person] = 641-55-5639
What are the NHS numbers of Stevens related to the individual with NHS number 641-55-5639?",What are the NHS numbers of [x0.Person.name:Steven]s related to the individual with NHS number [x2.Person.nhs_no:641-55-5639]?,"x0.Person.name:Steven = Steven
x2.Person.nhs_no:641-55-5639 = 641-55-5639",3,36,attribute_set,1
4487,What are the NHS numbers of people named Ryan who are related to the person with NHS number 873-28-7561?,"MATCH (x0:Person WHERE x0.name = ""Ryan"")-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0.nhs_no","[Person] = Ryan
[Person] = 873-28-7561
What are the NHS numbers of people named Ryan who are related to the person with NHS number 873-28-7561?",What are the NHS numbers of people named [x0.Person.name:Ryan] who are related to the person with NHS number [x2.Person.nhs_no:873-28-7561]?,"x0.Person.name:Ryan = Ryan
x2.Person.nhs_no:873-28-7561 = 873-28-7561",3,36,attribute_set,1
2608,How many investigations are conducted by officers whose last name is Kitchingham?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Kitchingham"")
RETURN COUNT(DISTINCT x0)","[Officer] = Kitchingham
How many investigations are conducted by officers whose last name is Kitchingham?",How many investigations are conducted by officers whose last name is [x1.Officer.surname:Kitchingham]?,x1.Officer.surname:Kitchingham = Kitchingham,2,372,count,1
4564,How often is the person with phone number 9-(494)467-2643 involved in public order violations?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(494)467-2643"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Phone] = 9-(494)467-2643
How often is the person with phone number 9-(494)467-2643 involved in public order violations?",How often is the person with phone number [x2.Phone.phoneNo:9-(494)467-2643] involved in [x0.Crime.type:Public order] violations?,"x0.Crime.type:Public order = public order
x2.Phone.phoneNo:9-(494)467-2643 = 9-(494)467-2643",3,66,count,1
592,How old is the oldest person who knows someone with last name Murphy?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Murphy"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Murphy
How old is the oldest person who knows someone with last name Murphy?",How old is the oldest person who knows someone with last name [x1.Person.surname:Murphy]?,x1.Person.surname:Murphy = Murphy,2,78,argmin,1
3283,Which call to the phone of NHS number 468-82-3915 was made most recently?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""468-82-3915"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 468-82-3915
Which call to the phone of NHS number 468-82-3915 was made most recently?",Which call to the phone of NHS number [x2.Person.nhs_no:468-82-3915] was made most recently?,x2.Person.nhs_no:468-82-3915 = 468-82-3915,3,36,max,1
2787,What is the date of the first recorded crime involving relatives of a person with the surname Moreno?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Moreno"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Moreno
What is the date of the first recorded crime involving relatives of a person with the surname Moreno?",What is the date of the first recorded crime involving relatives of a person with the surname [x2.Person.surname:Moreno]?,x2.Person.surname:Moreno = Moreno,3,405,argmin,1
1093,What is the total number of calls to 9-(488)105-0765?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(488)105-0765"")
RETURN COUNT(DISTINCT x0)","[Phone] = 9-(488)105-0765
What is the total number of calls to 9-(488)105-0765?",What is the total number of calls to [x1.Phone.phoneNo:9-(488)105-0765]?,x1.Phone.phoneNo:9-(488)105-0765 = 9-(488)105-0765,2,145,count,1
2874,What are the emails of Deborah's friends?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Deborah"")
RETURN x0","[Person] = Deborah
What are the emails of Deborah's friends?",What are the emails of [x2.Person.name:Deborah]'s friends?,x2.Person.name:Deborah = Deborah,3,417,entity_set,1
1956,What is the number of crimes linked to Commander model vehicles?,"MATCH (x0:Vehicle WHERE x0.model = ""Commander"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Commander
What is the number of crimes linked to Commander model vehicles?",What is the number of crimes linked to [x0.Vehicle.model:Commander] model vehicles?,x0.Vehicle.model:Commander = Commander,2,260,count,1
869,How many acquaintances does a person with the surname Garcia have?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Garcia"")
RETURN COUNT(DISTINCT x0)","[Person] = Garcia
How many acquaintances does a person with the surname Garcia have?",How many acquaintances does a person with the surname [x1.Person.surname:Garcia] have?,x1.Person.surname:Garcia = Garcia,2,114,count,1
1449,How many individuals are related to the holder of NHS number 243-46-3035?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.nhs_no = ""243-46-3035"")
RETURN COUNT(DISTINCT x0)","[Person] = 243-46-3035
How many individuals are related to the holder of NHS number 243-46-3035?",How many individuals are related to the holder of NHS number [x1.Person.nhs_no:243-46-3035]?,x1.Person.nhs_no:243-46-3035 = 243-46-3035,2,191,count,1
1396,How many calls were placed at 07:52 to the number 3-(799)803-9159?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""07:52"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(799)803-9159"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 07:52
[Phone] = 3-(799)803-9159
How many calls were placed at 07:52 to the number 3-(799)803-9159?",How many calls were placed at [x0.PhoneCall.call_time:07:52] to the number [x1.Phone.phoneNo:3-(799)803-9159]?,"x0.PhoneCall.call_time:07:52 = 07:52
x1.Phone.phoneNo:3-(799)803-9159 = 3-(799)803-9159",2,183,count,1
3033,Can you provide the email for the individual whose phone number is 3-(246)177-0272?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""3-(246)177-0272"")
RETURN x0","[Phone] = 3-(246)177-0272
Can you provide the email for the individual whose phone number is 3-(246)177-0272?",Can you provide the email for the individual whose phone number is [x2.Phone.phoneNo:3-(246)177-0272]?,x2.Phone.phoneNo:3-(246)177-0272 = 3-(246)177-0272,3,442,entity_set,1
449,Which officers are working on crimes currently being investigated?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Crime] = Under investigation
Which officers are working on crimes currently being investigated?",Which officers are working on crimes [x1.Crime.last_outcome:Under investigation]?,x1.Crime.last_outcome:Under investigation = currently being investigated,2,59,entity_set,3421
2786,When did a crime first occur involving family members of someone surnamed Moreno?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Moreno"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Moreno
When did a crime first occur involving family members of someone surnamed Moreno?",When did a crime first occur involving family members of someone surnamed [x2.Person.surname:Moreno]?,x2.Person.surname:Moreno = Moreno,3,405,argmin,1
1803,How many officers at the Police Constable rank probed vehicle offenses?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = Vehicle crime
How many officers at the Police Constable rank probed vehicle offenses?",How many officers at the [x0.Officer.rank:Police Constable] rank probed [x1.Crime.type:Vehicle crime]?,"x0.Officer.rank:Police Constable = Police Constable
x1.Crime.type:Vehicle crime = vehicle offenses",2,238,count,1
1471,What are the phones for people whose last name is Patterson?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Patterson"")
RETURN x0","[Person] = Patterson
What are the phones for people whose last name is Patterson?",What are the phones for people whose last name is [x1.Person.surname:Patterson]?,x1.Person.surname:Patterson = Patterson,2,193,entity_set,3
3350,What are the email addresses of individuals residing in OL2 5RB postcode locations?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL2 5RB"")
RETURN x0.email_address","[Location] = OL2 5RB
What are the email addresses of individuals residing in OL2 5RB postcode locations?",What are the email addresses of individuals residing in [x2.Location.postcode:OL2 5RB] postcode locations?,x2.Location.postcode:OL2 5RB = OL2 5RB,3,45,attribute_set,1
1760,What areas are linked to postcode WN2 1YL?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WN2 1YL"")
RETURN x0","[PostCode] = WN2 1YL
What areas are linked to postcode WN2 1YL?",What areas are linked to postcode [x1.PostCode.code:WN2 1YL]?,x1.PostCode.code:WN2 1YL = WN2 1YL,2,234,entity_set,1
3406,What are the NHS numbers of those with a family link to someone with the email wsmith9c@nhs.uk?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""wsmith9c@nhs.uk"")
RETURN x0.nhs_no","[Email] = wsmith9c@nhs.uk
What are the NHS numbers of those with a family link to someone with the email wsmith9c@nhs.uk?",What are the NHS numbers of those with a family link to someone with the email [x2.Email.email_address:wsmith9c@nhs.uk]?,x2.Email.email_address:wsmith9c@nhs.uk = wsmith9c@nhs.uk,3,59,attribute_set,2
2256,"What are the locations of crimes from August 4, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Crime] = 4/08/2017
What are the locations of crimes from August 4, 2017?",What are the locations of crimes from [x1.Crime.date:4/08/2017]?,"x1.Crime.date:4/08/2017 = August 4, 2017",2,304,entity_set,976
1883,Who are the individuals named Amy related to someone with the last name Wood?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Wood"")
RETURN x0","[Person] = Amy
[Person] = Wood
Who are the individuals named Amy related to someone with the last name Wood?",Who are the individuals named [x0.Person.name:Amy] related to someone with the last name [x1.Person.surname:Wood]?,"x0.Person.name:Amy = Amy
x1.Person.surname:Wood = Wood",2,251,entity_set,1
4553,What are the NHS numbers of individuals who know a relative of someone surnamed Walker?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Walker"")
RETURN x0.nhs_no","[Person] = Walker
What are the NHS numbers of individuals who know a relative of someone surnamed Walker?",What are the NHS numbers of individuals who know a relative of someone surnamed [x2.Person.surname:Walker]?,x2.Person.surname:Walker = Walker,3,56,attribute_set,9
728,"On 20/08/2017, how many crimes include a person named Stephanie?","MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.name = ""Stephanie"")
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
[Person] = Stephanie
On 20/08/2017, how many crimes include a person named Stephanie?","On [x0.Crime.date:20/08/2017], how many crimes include a person named [x1.Person.name:Stephanie]?","x0.Crime.date:20/08/2017 = 20/08/2017
x1.Person.name:Stephanie = Stephanie",2,97,count,1
4576,Who investigated the crime concerning the person with NHS number 873-28-7561?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""873-28-7561"")
RETURN x0","[Person] = 873-28-7561
Who investigated the crime concerning the person with NHS number 873-28-7561?",Who investigated the crime concerning the person with NHS number [x2.Person.nhs_no:873-28-7561]?,x2.Person.nhs_no:873-28-7561 = 873-28-7561,3,67,entity_set,2
695,Can you identify people who know someone with the surname Warren?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Warren"")
RETURN x0.name","[Person] = Warren
Can you identify people who know someone with the surname Warren?",Can you identify people who know someone with the surname [x1.Person.surname:Warren]?,x1.Person.surname:Warren = Warren,2,92,attribute_set,5
38,Which Cadillac vehicles are linked to vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Cadillac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Cadillac
[Crime] = Vehicle crime
Which Cadillac vehicles are linked to vehicle crimes?",Which [x0.Vehicle.make:Cadillac] vehicles are linked to [x1.Crime.type:Vehicle crime]s?,"x0.Vehicle.make:Cadillac = Cadillac
x1.Crime.type:Vehicle crime = vehicle crime",2,5,entity_set,23
1506,Which crime occurred first with participants having the last name Powell?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Powell
Which crime occurred first with participants having the last name Powell?",Which crime occurred first with participants having the last name [x1.Person.surname:Powell]?,x1.Person.surname:Powell = Powell,2,200,min,1
1991,Who has emails of people who know someone surnamed Mason's phone number?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Mason"")
RETURN x0","[Person] = Mason
Who has emails of people who know someone surnamed Mason's phone number?",Who has emails of people who know someone surnamed [x2.Person.surname:Mason]'s phone number?,x2.Person.surname:Mason = Mason,3,267,entity_set,3
346,What are the most recent crimes at 177 Gerald Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""177 Gerald Road"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 177 Gerald Road
What are the most recent crimes at 177 Gerald Road?",What are the most recent crimes at [x1.Location.address:177 Gerald Road]?,x1.Location.address:177 Gerald Road = 177 Gerald Road,2,43,max,1
2221,What ES model vehicles were associated with criminal activities on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""ES"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN x0","[Vehicle] = ES
[Crime] = 11/08/2017
What ES model vehicles were associated with criminal activities on 11/08/2017?",What [x0.Vehicle.model:ES] model vehicles were associated with criminal activities on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.model:ES = ES
x1.Crime.date:11/08/2017 = 11/08/2017",2,299,entity_set,1
1159,How many Harrys are acquainted with someone named Irene?,"MATCH (x0:Person WHERE x0.name = ""Harry"")-[:KNOWS]-(x1:Person WHERE x1.name = ""Irene"")
RETURN COUNT(DISTINCT x0)","[Person] = Harry
[Person] = Irene
How many Harrys are acquainted with someone named Irene?",How many [x0.Person.name:Harry] are acquainted with someone named [x1.Person.name:Irene]?,"x0.Person.name:Harry = Harrys
x1.Person.name:Irene = Irene",2,153,count,1
439,How many emails are associated with a person with surname Nguyen?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN COUNT(DISTINCT x0)","[Person] = Nguyen
How many emails are associated with a person with surname Nguyen?",How many emails are associated with a person with surname [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,58,count,1
513,"How many offenses with the status ""Investigation complete; no suspect identified"" happened in locations with the WA3 3AW postcode?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""WA3 3AW"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Location] = WA3 3AW
How many offenses with the status ""Investigation complete; no suspect identified"" happened in locations with the WA3 3AW postcode?","How many offenses with the status ""[x0.Crime.last_outcome:Investigation complete; no suspect identified]"" happened in locations with the [x1.Location.postcode:WA3 3AW] postcode?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:WA3 3AW = WA3 3AW",2,67,count,1
2423,Which crime did officers with last name Tarquini investigate first?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tarquini"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Tarquini
Which crime did officers with last name Tarquini investigate first?",Which crime did officers with last name [x1.Officer.surname:Tarquini] investigate first?,x1.Officer.surname:Tarquini = Tarquini,2,334,min,1
589,How old is the oldest person who knows someone with last name Nguyen?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Nguyen"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Nguyen
How old is the oldest person who knows someone with last name Nguyen?",How old is the oldest person who knows someone with last name [x1.Person.surname:Nguyen]?,x1.Person.surname:Nguyen = Nguyen,2,78,argmin,1
2704,What was the earliest crime with a person at 183 Oakleigh Avenue?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Oakleigh Avenue"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 183 Oakleigh Avenue
What was the earliest crime with a person at 183 Oakleigh Avenue?",What was the earliest crime with a person at [x1.Location.address:183 Oakleigh Avenue]?,x1.Location.address:183 Oakleigh Avenue = 183 Oakleigh Avenue,3,391,min,1
3316,Who are the surnames of people living in locations affected by burglary?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Burglary"")
RETURN x0.surname","[Crime] = Burglary
Who are the surnames of people living in locations affected by burglary?",Who are the surnames of people living in locations affected by [x2.Crime.type:Burglary]?,x2.Crime.type:Burglary = burglary,3,41,attribute_set,62
815,How many individuals were part of the crimes on 30/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 30/08/2017
How many individuals were part of the crimes on 30/08/2017?",How many individuals were part of the crimes on [x1.Crime.date:30/08/2017]?,x1.Crime.date:30/08/2017 = 30/08/2017,2,108,count,1
3475,What are the last name of people whose phone is known to individuals familiar with someone having NHS number 219-06-7487?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""219-06-7487"")
RETURN x0.surname","[Person] = 219-06-7487
What are the last name of people whose phone is known to individuals familiar with someone having NHS number 219-06-7487?",What are the last name of people whose phone is known to individuals familiar with someone having NHS number [x2.Person.nhs_no:219-06-7487]?,x2.Person.nhs_no:219-06-7487 = 219-06-7487,3,83,attribute_set,1
4544,Who are the individuals acquainted with a friend of the person holding NHS number 563-60-8705?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""563-60-8705"")
RETURN x0","[Person] = 563-60-8705
Who are the individuals acquainted with a friend of the person holding NHS number 563-60-8705?",Who are the individuals acquainted with a friend of the person holding NHS number [x2.Person.nhs_no:563-60-8705]?,x2.Person.nhs_no:563-60-8705 = 563-60-8705,3,54,entity_set,8
4441,How many know a Powell and have a criminal involvement?,"MATCH (x0:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Powell"")
MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Person] = Powell
How many know a Powell and have a criminal involvement?",How many know a [x2.Person.surname:Powell] and have a criminal involvement?,x2.Person.surname:Powell = Powell,3,25,count,1
696,Which people have connections to individuals with the last name Warren?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Warren"")
RETURN x0.name","[Person] = Warren
Which people have connections to individuals with the last name Warren?",Which people have connections to individuals with the last name [x1.Person.surname:Warren]?,x1.Person.surname:Warren = Warren,2,92,attribute_set,5
880,What are the emails of individuals with the NHS number 680-93-7668?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""680-93-7668"")
RETURN x0","[Person] = 680-93-7668
What are the emails of individuals with the NHS number 680-93-7668?",What are the emails of individuals with the NHS number [x1.Person.nhs_no:680-93-7668]?,x1.Person.nhs_no:680-93-7668 = 680-93-7668,2,116,entity_set,1
2230,"Which calls did 7-(476)009-0311 receive on August 22, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""22/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(476)009-0311"")
RETURN x0","[PhoneCall] = 22/08/2017
[Phone] = 7-(476)009-0311
Which calls did 7-(476)009-0311 receive on August 22, 2017?",Which calls did [x1.Phone.phoneNo:7-(476)009-0311] receive on [x0.PhoneCall.call_date:22/08/2017]?,"x0.PhoneCall.call_date:22/08/2017 = August 22, 2017 
x1.Phone.phoneNo:7-(476)009-0311 = 7-(476)009-0311",2,300,entity_set,1
1088,How many devices made an 84-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""84"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 84
How many devices made an 84-second call?",How many devices made an [x1.PhoneCall.call_duration:84]-second call?,x1.PhoneCall.call_duration:84 = 84,2,144,count,1
4384,Which are the types of crimes on 22/08/2017 that involved a friend of the person whose NHS number is 543-43-9738?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""543-43-9738"")
RETURN x0.type","[Crime] = 22/08/2017
[Person] = 543-43-9738
Which are the types of crimes on 22/08/2017 that involved a friend of the person whose NHS number is 543-43-9738?",Which are the types of crimes on [x0.Crime.date:22/08/2017] that involved a friend of the person whose NHS number is [x2.Person.nhs_no:543-43-9738]?,"x0.Crime.date:22/08/2017 = 22/08/2017
x2.Person.nhs_no:543-43-9738 = 543-43-9738",3,1,attribute_set,1
2848,What is the latest illegal act associated with someone with the number 2-(821)181-6941?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""2-(821)181-6941"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 2-(821)181-6941
What is the latest illegal act associated with someone with the number 2-(821)181-6941?",What is the latest illegal act associated with someone with the number [x2.Phone.phoneNo:2-(821)181-6941]?,x2.Phone.phoneNo:2-(821)181-6941 = 2-(821)181-6941,3,414,max,1
977,"How many sites experienced crimes on August 12, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""12/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 12/08/2017
How many sites experienced crimes on August 12, 2017?",How many sites experienced crimes on [x1.Crime.date:12/08/2017]?,"x1.Crime.date:12/08/2017 = August 12, 2017",2,127,count,1
3434,How long was the longest call received by a person named Philip?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Philip"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Philip
How long was the longest call received by a person named Philip?",How long was the longest call received by a person named [x2.Person.name:Philip]?,x2.Person.name:Philip = Philip,3,66,argmax,1
790,What is the number of crimes on 19/08/2017 in locations with postcode OL2 6NL?,"MATCH (x0:Crime WHERE x0.date = ""19/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL2 6NL"")
RETURN COUNT(DISTINCT x0)","[Crime] = 19/08/2017
[Location] = OL2 6NL
What is the number of crimes on 19/08/2017 in locations with postcode OL2 6NL?",What is the number of crimes on [x0.Crime.date:19/08/2017] in locations with postcode [x1.Location.postcode:OL2 6NL]?,"x0.Crime.date:19/08/2017 = 19/08/2017
x1.Location.postcode:OL2 6NL = OL2 6NL",2,104,count,1
3474,Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number 219-06-7487?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""219-06-7487"")
RETURN x0.surname","[Person] = 219-06-7487
Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number 219-06-7487?",Can you provide the surnames of individuals who possess the contact numbers of those acquainted with a person holding NHS number [x2.Person.nhs_no:219-06-7487]?,x2.Person.nhs_no:219-06-7487 = 219-06-7487,3,83,attribute_set,1
4383,Can you provide the types of crimes from 22/08/2017 linked to a friend of the person with NHS number 543-43-9738?,"MATCH (x0:Crime WHERE x0.date = ""22/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""543-43-9738"")
RETURN x0.type","[Crime] = 22/08/2017
[Person] = 543-43-9738
Can you provide the types of crimes from 22/08/2017 linked to a friend of the person with NHS number 543-43-9738?",Can you provide the types of crimes from [x0.Crime.date:22/08/2017] linked to a friend of the person with NHS number [x2.Person.nhs_no:543-43-9738]?,"x0.Crime.date:22/08/2017 = 22/08/2017
x2.Person.nhs_no:543-43-9738 = 543-43-9738",3,1,attribute_set,1
4452,Can you provide the email addresses of someone who shares a home with Brian?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0.email_address","[Person] = Brian
Can you provide the email addresses of someone who shares a home with Brian?",Can you provide the email addresses of someone who shares a home with [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,29,attribute_set,4
2858,How many unresolved investigations include individuals related to a person with the surname Martinez?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Martinez
How many unresolved investigations include individuals related to a person with the surname Martinez?",How many [x0.Crime.last_outcome:Investigation complete; no suspect identified] include individuals related to a person with the surname [x2.Person.surname:Martinez]?,"x0.Crime.last_outcome:Investigation complete; no suspect identified = unresolved investigations 
x2.Person.surname:Martinez = Martinez",3,415,count,1
1698,Could you give me the addresses at 155 Chapel Street for individuals with the surname Sims?,"MATCH (x0:Location WHERE x0.address = ""155 Chapel Street"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Sims"")
RETURN x0","[Location] = 155 Chapel Street
[Person] = Sims
Could you give me the addresses at 155 Chapel Street for individuals with the surname Sims?",Could you give me the addresses at [x0.Location.address:155 Chapel Street] for individuals with the surname [x1.Person.surname:Sims]?,"x0.Location.address:155 Chapel Street = 155 Chapel Street
x1.Person.surname:Sims = Sims",2,224,entity_set,1
602,How many calls were placed to any phone on 19/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""19/08/2017"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19/08/2017
How many calls were placed to any phone on 19/08/2017?",How many calls were placed to any phone on [x0.PhoneCall.call_date:19/08/2017]?,x0.PhoneCall.call_date:19/08/2017 = 19/08/2017,2,79,count,1
587,Can you provide the times of calls to the phone number 1-(060)256-9720?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(060)256-9720"")
RETURN x0.call_time","[Phone] = 1-(060)256-9720
Can you provide the times of calls to the phone number 1-(060)256-9720?",Can you provide the times of calls to the phone number [x1.Phone.phoneNo:1-(060)256-9720]?,x1.Phone.phoneNo:1-(060)256-9720 = 1-(060)256-9720,2,77,attribute_set,2
762,What was the earliest crime reported at 68 Haigh Road?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""68 Haigh Road"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 68 Haigh Road
What was the earliest crime reported at 68 Haigh Road?",What was the earliest crime reported at [x1.Location.address:68 Haigh Road]?,x1.Location.address:68 Haigh Road = 68 Haigh Road,2,100,min,1
3220,Can you provide the NHS numbers for those contacted at 09:27?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""09:27"")
RETURN x0.nhs_no","[PhoneCall] = 09:27
Can you provide the NHS numbers for those contacted at 09:27?",Can you provide the NHS numbers for those contacted at [x2.PhoneCall.call_time:09:27]?,x2.PhoneCall.call_time:09:27 = 09:27,3,26,attribute_set,1
2152,How many officers handled investigations into criminal damage and arson offenses?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Criminal damage and arson"")
RETURN COUNT(DISTINCT x0)","[Crime] = Criminal damage and arson
How many officers handled investigations into criminal damage and arson offenses?",How many officers handled investigations into [x1.Crime.type:Criminal damage and arson] offenses?,x1.Crime.type:Criminal damage and arson = criminal damage and arson,2,291,count,1
341,What are the latest offenses reported at 100 St James Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""100 St James Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 100 St James Street
What are the latest offenses reported at 100 St James Street?",What are the latest offenses reported at [x1.Location.address:100 St James Street]?,x1.Location.address:100 St James Street = 100 St James Street,2,43,max,1
1199,Which offenses involving people with the surname Powell are still being investigated?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Powell"")
RETURN x0","[Crime] = Under investigation
[Person] = Powell
Which offenses involving people with the surname Powell are still being investigated?",Which offenses involving people with the surname [x1.Person.surname:Powell] are [x0.Crime.last_outcome:Under investigation]?,"x0.Crime.last_outcome:Under investigation = still being investigated 
x1.Person.surname:Powell = Powell",2,161,entity_set,3
32,How many burglary cases are handled by officers named Catherin?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.name = ""Catherin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = Catherin
How many burglary cases are handled by officers named Catherin?",How many [x0.Crime.type:Burglary] cases are handled by officers named [x1.Officer.name:Catherin]?,"x0.Crime.type:Burglary = burglary
x1.Officer.name:Catherin = Catherin",2,4,count,1
