id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2275,How many folks reside with anyone called Phillip?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Phillip"")
RETURN COUNT(DISTINCT x0)","[Person] = Phillip
How many folks reside with anyone called Phillip?",How many folks reside with anyone called [x1.Person.name:Phillip]?,x1.Person.name:Phillip = Phillip,2,306,count,1
1905,How many individuals named Diane share a home with someone having the NHS number 647-19-8518?,"MATCH (x0:Person WHERE x0.name = ""Diane"")-[:KNOWS_LW]-(x1:Person WHERE x1.nhs_no = ""647-19-8518"")
RETURN COUNT(DISTINCT x0)","[Person] = Diane
[Person] = 647-19-8518
How many individuals named Diane share a home with someone having the NHS number 647-19-8518?",How many individuals named [x0.Person.name:Diane] share a home with someone having the NHS number [x1.Person.nhs_no:647-19-8518]?,"x0.Person.name:Diane = Diane
x1.Person.nhs_no:647-19-8518 = 647-19-8518",2,254,count,1
12,How many investigations labeled Unable to prosecute suspect involve officers with the surname Tennick?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tennick"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Officer] = Tennick
How many investigations labeled Unable to prosecute suspect involve officers with the surname Tennick?",How many investigations labeled [x0.Crime.last_outcome:Unable to prosecute suspect] involve officers with the surname [x1.Officer.surname:Tennick]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Officer.surname:Tennick = Tennick",2,2,count,1
2215,"What Sable vehicles were implicated in criminal activities on August 4, 2017?","MATCH (x0:Vehicle WHERE x0.model = ""Sable"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""4/08/2017"")
RETURN x0","[Vehicle] = Sable
[Crime] = 4/08/2017
What Sable vehicles were implicated in criminal activities on August 4, 2017?",What [x0.Vehicle.model:Sable] vehicles were implicated in criminal activities on [x1.Crime.date:4/08/2017]?,"x0.Vehicle.model:Sable = Sable
x1.Crime.date:4/08/2017 = August 4, 2017",2,299,entity_set,1
1087,How many phones had a call that lasted 84 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""84"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 84
How many phones had a call that lasted 84 seconds?",How many phones had a call that lasted [x1.PhoneCall.call_duration:84] seconds?,x1.PhoneCall.call_duration:84 = 84,2,144,count,1
211,How many incidents from 10/08/2017 were looked into by officers?,"MATCH (x0:Crime WHERE x0.date = ""10/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 10/08/2017
How many incidents from 10/08/2017 were looked into by officers?",How many incidents from [x0.Crime.date:10/08/2017] were looked into by officers?,x0.Crime.date:10/08/2017 = 10/08/2017,2,25,count,1
1108,What are the locations with postcode M22 4ZB where violence and sexual offences have occurred?,"MATCH (x0:Location WHERE x0.postcode = ""M22 4ZB"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Location] = M22 4ZB
[Crime] = Violence and sexual offences
What are the locations with postcode M22 4ZB where violence and sexual offences have occurred?",What are the locations with postcode [x0.Location.postcode:M22 4ZB] where [x1.Crime.type:Violence and sexual offences] have occurred?,"x0.Location.postcode:M22 4ZB = M22 4ZB
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,146,entity_set,2
426,Which residences belong to individuals with the surname Lawrence in the WA14 1NG postcode?,"MATCH (x0:Location WHERE x0.postcode = ""WA14 1NG"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Lawrence"")
RETURN x0","[Location] = WA14 1NG
[Person] = Lawrence
Which residences belong to individuals with the surname Lawrence in the WA14 1NG postcode?",Which residences belong to individuals with the surname [x1.Person.surname:Lawrence] in the [x0.Location.postcode:WA14 1NG] postcode?,"x0.Location.postcode:WA14 1NG = WA14 1NG
x1.Person.surname:Lawrence = Lawrence",2,55,entity_set,1
184,How many people called Joan have the phone number of a person whose last name is Robertson?,"MATCH (x0:Person WHERE x0.name = ""Joan"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Robertson"")
RETURN COUNT(DISTINCT x0)","[Person] = Joan
[Person] = Robertson
How many people called Joan have the phone number of a person whose last name is Robertson?",How many people called [x0.Person.name:Joan] have the phone number of a person whose last name is [x1.Person.surname:Robertson]?,"x0.Person.name:Joan = Joan
x1.Person.surname:Robertson = Robertson",2,22,count,1
964,How many Heathers have a friend?,"MATCH (x0:Person WHERE x0.name = ""Heather"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Heather
How many Heathers have a friend?",How many [x0.Person.name:Heather] have a friend?,x0.Person.name:Heather = Heathers,2,126,count,1
3211,How many people have Harper friends who are related to someone with the last name Butler?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Harper"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Butler"")
RETURN COUNT(DISTINCT x0)","[Person] = Harper
[Person] = Butler
How many people have Harper friends who are related to someone with the last name Butler?",How many people have [x1.Person.surname:Harper] friends who are related to someone with the last name [x2.Person.surname:Butler]?,"x1.Person.surname:Harper = Harper
x2.Person.surname:Butler = Butler",3,24,count,1
2048,How many violent and sexual crimes happened at 106 Eastwell Road?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""106 Eastwell Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Location] = 106 Eastwell Road
How many violent and sexual crimes happened at 106 Eastwell Road?",How many [x0.Crime.type:Violence and sexual offences] happened at [x1.Location.address:106 Eastwell Road]?,"x0.Crime.type:Violence and sexual offences = violent and sexual crimes 
x1.Location.address:106 Eastwell Road = 106 Eastwell Road",2,276,count,1
1542,Can you name everyone who shares a hose with a person with surname Hernandez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0","[Person] = Hernandez
Can you name everyone who shares a hose with a person with surname Hernandez?",Can you name everyone who shares a hose with a person with surname [x1.Person.surname:Hernandez]?,x1.Person.surname:Hernandez = Hernandez,2,205,entity_set,3
2395,When did the first crime occur that involved a persona with last name Kelly and an LHS vehicle?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""LHS"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Kelly"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = LHS
[Person] = Kelly
When did the first crime occur that involved a persona with last name Kelly and an LHS vehicle?",When did the first crime occur that involved a persona with last name [x1.Person.surname:Kelly] and an [x2.Vehicle.model:LHS] vehicle?,"x1.Person.surname:Kelly = Kelly
x2.Vehicle.model:LHS = LHS",3,331,min,1
1192,"How many crimes on August 23, 2017, involve someone with last name Martinez?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
[Person] = Martinez
How many crimes on August 23, 2017, involve someone with last name Martinez?","How many crimes on [x0.Crime.date:23/08/2017], involve someone with last name [x1.Person.surname:Martinez]?","x0.Crime.date:23/08/2017 = August 23, 2017 
x1.Person.surname:Martinez = Martinez",2,159,count,1
149,"Which phone call, made to phones that called on 17/08/2017, has the earliest date?","MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""17/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 17/08/2017
Which phone call, made to phones that called on 17/08/2017, has the earliest date?","Which phone call, made to phones that called on [x2.PhoneCall.call_date:17/08/2017], has the earliest date?",x2.PhoneCall.call_date:17/08/2017 = 17/08/2017,3,17,min,1
3111,Which calls to a phone that got a call at 11:08 have the earliest date?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""11:08"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 11:08
Which calls to a phone that got a call at 11:08 have the earliest date?",Which calls to a phone that got a call at [x2.PhoneCall.call_time:11:08] have the earliest date?,x2.PhoneCall.call_time:11:08 = 11:08,3,10,min,1
633,Can you identify 2003 vehicles associated with vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2003"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = 2003
[Crime] = Vehicle crime
Can you identify 2003 vehicles associated with vehicle crimes?",Can you identify [x0.Vehicle.year:2003] vehicles associated with [x1.Crime.type:Vehicle crime]?,"x0.Vehicle.year:2003 = 2003
x1.Crime.type:Vehicle crime = vehicle crimes",2,83,entity_set,44
2360,"What are the areas with crime scenes from August 16, 2017?","MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""16/08/2017"")
RETURN x0","[Crime] = 16/08/2017
What are the areas with crime scenes from August 16, 2017?",What are the areas with crime scenes from [x2.Crime.date:16/08/2017]?,"x2.Crime.date:16/08/2017 = August 16, 2017",3,323,entity_set,918
2813,How many emails are associated with people named Carlos connected to a crime on 13/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Carlos"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""13/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Carlos
[Crime] = 13/08/2017
How many emails are associated with people named Carlos connected to a crime on 13/08/2017?",How many emails are associated with people named [x1.Person.name:Carlos] connected to a crime on [x2.Crime.date:13/08/2017]?,"x1.Person.name:Carlos = Carlos
x2.Crime.date:13/08/2017 = 13/08/2017",3,409,count,1
2984,What is the most recent crime linked to friends of those with surname Robinson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Robinson"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Robinson
What is the most recent crime linked to friends of those with surname Robinson?",What is the most recent crime linked to friends of those with surname [x2.Person.surname:Robinson]?,x2.Person.surname:Robinson = Robinson,3,432,max,1
675,What's the number of crimes reported at 130 Crompton Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""130 Crompton Street"")
RETURN COUNT(DISTINCT x0)","[Location] = 130 Crompton Street
What's the number of crimes reported at 130 Crompton Street?",What's the number of crimes reported at [x1.Location.address:130 Crompton Street]?,x1.Location.address:130 Crompton Street = 130 Crompton Street,2,89,count,1
254,What are the addresses of individuals with the surname Hall?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Hall"")
RETURN x0","[Person] = Hall
What are the addresses of individuals with the surname Hall?",What are the addresses of individuals with the surname [x1.Person.surname:Hall]?,x1.Person.surname:Hall = Hall,2,31,entity_set,2
2147,How many officers looked into crimes classified as Other theft?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Other theft"")
RETURN COUNT(DISTINCT x0)","[Crime] = Other theft
How many officers looked into crimes classified as Other theft?",How many officers looked into crimes classified as [x1.Crime.type:Other theft]?,x1.Crime.type:Other theft = Other theft,2,291,count,1
46,"How many officers with the name Margaret probed crimes that occured on August 30, 2017?","MATCH (x0:Officer WHERE x0.name = ""Margaret"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Margaret
[Crime] = 30/08/2017
How many officers with the name Margaret probed crimes that occured on August 30, 2017?",How many officers with the name [x0.Officer.name:Margaret] probed crimes that occured on [x1.Crime.date:30/08/2017]?,"x0.Officer.name:Margaret = Margaret
x1.Crime.date:30/08/2017 = August 30, 2017",2,6,count,1
1629,Which areas have locations with the postcode M20 4SU?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M20 4SU"")
RETURN x0","[Location] = M20 4SU
Which areas have locations with the postcode M20 4SU?",Which areas have locations with the postcode [x1.Location.postcode:M20 4SU]?,x1.Location.postcode:M20 4SU = M20 4SU,2,215,entity_set,1
2381,What area corresponds to the address 108 Milnthorpe Road?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""108 Milnthorpe Road"")
RETURN x0","[Location] = 108 Milnthorpe Road
What area corresponds to the address 108 Milnthorpe Road?",What area corresponds to the address [x1.Location.address:108 Milnthorpe Road]?,x1.Location.address:108 Milnthorpe Road = 108 Milnthorpe Road,2,328,entity_set,1
109,How many people called Amy know someone with the surname Weaver?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Weaver"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Weaver
How many people called Amy know someone with the surname Weaver?",How many people called [x0.Person.name:Amy] know someone with the surname [x1.Person.surname:Weaver]?,"x0.Person.name:Amy = Amy
x1.Person.surname:Weaver = Weaver",2,13,count,1
4374,What's the date of the last crime linked to an individual living with Pamela?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Pamela"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Pamela
What's the date of the last crime linked to an individual living with Pamela?",What's the date of the last crime linked to an individual living with [x2.Person.name:Pamela]?,x2.Person.name:Pamela = Pamela,3,0,argmax,1
334,Who resides at 63 Princess Avenue?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""63 Princess Avenue"")
RETURN x0","[Location] = 63 Princess Avenue
Who resides at 63 Princess Avenue?",Who resides at [x1.Location.address:63 Princess Avenue]?,x1.Location.address:63 Princess Avenue = 63 Princess Avenue,2,42,entity_set,1
2034,What was the longest duration of calls to phones that placed calls on 03/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""03/08/2017"")
RETURN x0.call_duration
ORDER BY x0.call_duration DESC
LIMIT 1","[PhoneCall] = 03/08/2017
What was the longest duration of calls to phones that placed calls on 03/08/2017?",What was the longest duration of calls to phones that placed calls on [x2.PhoneCall.call_date:03/08/2017]?,x2.PhoneCall.call_date:03/08/2017 = 03/08/2017,3,273,argmax,1
1558,How many cars from 1989 are tied to criminal activities?,"MATCH (x0:Vehicle WHERE x0.year = ""1989"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1989
How many cars from 1989 are tied to criminal activities?",How many cars from [x0.Vehicle.year:1989] are tied to criminal activities?,x0.Vehicle.year:1989 = 1989,2,207,count,1
2558,Which is the earliest crime involving a Coupe GT and someone surnamed Black?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Black"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Coupe GT"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Black
[Vehicle] = Coupe GT
Which is the earliest crime involving a Coupe GT and someone surnamed Black?",Which is the earliest crime involving a [x1.Vehicle.model:Coupe GT] and someone surnamed [x2.Person.surname:Black]?,"x1.Vehicle.model:Coupe GT = Coupe GT
x2.Person.surname:Black = Black",3,358,min,1
4370,When did the most recent crime occur involving a person living with someone named Jessica?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jessica"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Jessica
When did the most recent crime occur involving a person living with someone named Jessica?",When did the most recent crime occur involving a person living with someone named [x2.Person.name:Jessica]?,x2.Person.name:Jessica = Jessica,3,0,argmax,1
1113,Which emails belong to individuals familiar with last name named Robertson?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Robertson"")
RETURN x0","[Person] = Robertson
Which emails belong to individuals familiar with last name named Robertson?",Which emails belong to individuals familiar with last name named [x2.Person.surname:Robertson]?,x2.Person.surname:Robertson = Robertson,3,147,entity_set,18
2963,Could you list the email addresses of those who have familial ties to anyone with last name Phillips?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Phillips"")
RETURN x0","[Person] = Phillips
Could you list the email addresses of those who have familial ties to anyone with last name Phillips?",Could you list the email addresses of those who have familial ties to anyone with last name [x2.Person.surname:Phillips]?,x2.Person.surname:Phillips = Phillips,3,430,entity_set,3
4549,Which NHS numbers belong to people who know a family member of someone with the surname Nichols?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Nichols"")
RETURN x0.nhs_no","[Person] = Nichols
Which NHS numbers belong to people who know a family member of someone with the surname Nichols?",Which NHS numbers belong to people who know a family member of someone with the surname [x2.Person.surname:Nichols]?,x2.Person.surname:Nichols = Nichols,3,56,attribute_set,9
1801,How many Sergeants examined cases of violence and sexual offences?,"MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Crime] = Violence and sexual offences
How many Sergeants examined cases of violence and sexual offences?",How many [x0.Officer.rank:Sergeant] examined cases of [x1.Crime.type:Violence and sexual offences]?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,238,count,1
1543,Who are the individuals living with someone whose last name is Hernandez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN x0","[Person] = Hernandez
Who are the individuals living with someone whose last name is Hernandez?",Who are the individuals living with someone whose last name is [x1.Person.surname:Hernandez]?,x1.Person.surname:Hernandez = Hernandez,2,205,entity_set,3
1670,How many 21-second calls were made to 8-(689)151-8054?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""21"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(689)151-8054"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 21
[Phone] = 8-(689)151-8054
How many 21-second calls were made to 8-(689)151-8054?",How many [x0.PhoneCall.call_duration:21]-second calls were made to [x1.Phone.phoneNo:8-(689)151-8054]?,"x0.PhoneCall.call_duration:21 = 21
x1.Phone.phoneNo:8-(689)151-8054 = 8-(689)151-8054",2,220,count,1
3648,What is the number of crimes at residential locations?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person)
RETURN COUNT(DISTINCT x0)",What is the number of crimes at residential locations?,What is the number of crimes at residential locations?,,3,158,count,1
2049,What is the count of violence and sexual offences at 106 Eastwell Road?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""106 Eastwell Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Location] = 106 Eastwell Road
What is the count of violence and sexual offences at 106 Eastwell Road?",What is the count of [x0.Crime.type:Violence and sexual offences] at [x1.Location.address:106 Eastwell Road]?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x1.Location.address:106 Eastwell Road = 106 Eastwell Road",2,276,count,1
1046,What is the number of Amys residing with someone named Louis?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Louis"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
[Person] = Louis
What is the number of Amys residing with someone named Louis?",What is the number of [x0.Person.name:Amy] residing with someone named [x1.Person.name:Louis]?,"x0.Person.name:Amy = Amys
x1.Person.name:Louis = Louis",2,138,count,1
2986,What is the most recent crime linked to friends of someone with surname Alexander?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Alexander"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Alexander
What is the most recent crime linked to friends of someone with surname Alexander?",What is the most recent crime linked to friends of someone with surname [x2.Person.surname:Alexander]?,x2.Person.surname:Alexander = Alexander,3,432,max,1
969,How many individuals named Stephanie possess a friend?,"MATCH (x0:Person WHERE x0.name = ""Stephanie"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Stephanie
How many individuals named Stephanie possess a friend?",How many individuals named [x0.Person.name:Stephanie] possess a friend?,x0.Person.name:Stephanie = Stephanie,2,126,count,1
2612,How many cases do officers with surname Tzarkov investigate?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tzarkov"")
RETURN COUNT(DISTINCT x0)","[Officer] = Tzarkov
How many cases do officers with surname Tzarkov investigate?",How many cases do officers with surname [x1.Officer.surname:Tzarkov] investigate?,x1.Officer.surname:Tzarkov = Tzarkov,2,372,count,1
3092,How many criminal acts involve a Robertson who is friend with Howard?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Robertson"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Howard"")
RETURN COUNT(DISTINCT x0)","[Person] = Robertson
[Person] = Howard
How many criminal acts involve a Robertson who is friend with Howard?",How many criminal acts involve a [x1.Person.surname:Robertson] who is friend with [x2.Person.name:Howard]?,"x1.Person.surname:Robertson = Robertson
x2.Person.name:Howard = Howard",3,7,count,1
1193,"On 23rd August 2017, how many crimes involve a person with the surname Martinez?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
[Person] = Martinez
On 23rd August 2017, how many crimes involve a person with the surname Martinez?","On [x0.Crime.date:23/08/2017], how many crimes involve a person with the surname [x1.Person.surname:Martinez]?","x0.Crime.date:23/08/2017 = 23rd August 2017 
x1.Person.surname:Martinez = Martinez",2,159,count,1
145,Which is the first call to phones that made calls on 30/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""30/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 30/08/2017
Which is the first call to phones that made calls on 30/08/2017?",Which is the first call to phones that made calls on [x2.PhoneCall.call_date:30/08/2017]?,x2.PhoneCall.call_date:30/08/2017 = 30/08/2017,3,17,min,1
528,Which phone call to 8-(108)735-5670 had the greatest duration?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(108)735-5670"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 8-(108)735-5670
Which phone call to 8-(108)735-5670 had the greatest duration?",Which phone call to [x1.Phone.phoneNo:8-(108)735-5670] had the greatest duration?,x1.Phone.phoneNo:8-(108)735-5670 = 8-(108)735-5670,2,69,max,1
2468,What is the number of postcodes in any area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area)
RETURN COUNT(DISTINCT x0)",What is the number of postcodes in any area?,What is the number of postcodes in any area?,,2,342,count,1
1212,How many can be reached at 7-(263)287-1140?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""7-(263)287-1140"")
RETURN COUNT(DISTINCT x0)","[Phone] = 7-(263)287-1140
How many can be reached at 7-(263)287-1140?",How many can be reached at [x1.Phone.phoneNo:7-(263)287-1140]?,x1.Phone.phoneNo:7-(263)287-1140 = 7-(263)287-1140,2,162,count,1
1133,"On 23/08/2017, how many calls were made to 3-(687)257-9759?","MATCH (x0:PhoneCall WHERE x0.call_date = ""23/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""3-(687)257-9759"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 23/08/2017
[Phone] = 3-(687)257-9759
On 23/08/2017, how many calls were made to 3-(687)257-9759?","On [x0.PhoneCall.call_date:23/08/2017], how many calls were made to [x1.Phone.phoneNo:3-(687)257-9759]?","x0.PhoneCall.call_date:23/08/2017 = 23/08/2017
x1.Phone.phoneNo:3-(687)257-9759 = 3-(687)257-9759",2,150,count,1
4446,Can you provide the email addresses of an individual living with Phillip?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Phillip"")
RETURN x0.email_address","[Person] = Phillip
Can you provide the email addresses of an individual living with Phillip?",Can you provide the email addresses of an individual living with [x2.Person.name:Phillip]?,x2.Person.name:Phillip = Phillip,3,29,attribute_set,7
2098,What are the calls to 9-(721)729-4724 that have a duration of 43 seconds?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""43"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(721)729-4724"")
RETURN x0","[PhoneCall] = 43
[Phone] = 9-(721)729-4724
What are the calls to 9-(721)729-4724 that have a duration of 43 seconds?",What are the calls to [x1.Phone.phoneNo:9-(721)729-4724] that have a duration of [x0.PhoneCall.call_duration:43] seconds?,"x0.PhoneCall.call_duration:43 = 43
x1.Phone.phoneNo:9-(721)729-4724 = 9-(721)729-4724",2,283,entity_set,2
780,How many devices placed a call at 19:22?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_time = ""19:22"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 19:22
How many devices placed a call at 19:22?",How many devices placed a call at [x1.PhoneCall.call_time:19:22]?,x1.PhoneCall.call_time:19:22 = 19:22,2,102,count,1
2959,What is the date of the last crime involving a Sonata that officer 16-2620347 is investigating?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""16-2620347"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Sonata"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 16-2620347
[Vehicle] = Sonata
What is the date of the last crime involving a Sonata that officer 16-2620347 is investigating?",What is the date of the last crime involving a [x1.Vehicle.model:Sonata] that officer [x2.Officer.badge_no:16-2620347] is investigating?,"x1.Vehicle.model:Sonata = Sonata
x2.Officer.badge_no:16-2620347 = 16-2620347",3,429,argmax,1
3636,Can you identify individuals residing with someone acquainted with a Hamilton?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Hamilton"")
RETURN x0","[Person] = Hamilton
Can you identify individuals residing with someone acquainted with a Hamilton?",Can you identify individuals residing with someone acquainted with a [x2.Person.surname:Hamilton]?,x2.Person.surname:Hamilton = Hamilton,3,151,entity_set,6
1351,How many phones owned by people with surname Boyd made calls on 17/08/2017?,"MATCH (x0:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""17/08/2017"")
MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 17/08/2017
[Person] = Boyd
How many phones owned by people with surname Boyd made calls on 17/08/2017?",How many phones owned by people with surname [x1.Person.surname:Boyd] made calls on [x2.PhoneCall.call_date:17/08/2017]?,"x1.Person.surname:Boyd = Boyd
x2.PhoneCall.call_date:17/08/2017 = 17/08/2017",3,178,count,1
544,What's the number of Annes residing at 146 Gloucester Street?,"MATCH (x0:Person WHERE x0.name = ""Anne"")-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""146 Gloucester Street"")
RETURN COUNT(DISTINCT x0)","[Person] = Anne
[Location] = 146 Gloucester Street
What's the number of Annes residing at 146 Gloucester Street?",What's the number of [x0.Person.name:Anne] residing at [x1.Location.address:146 Gloucester Street]?,"x0.Person.name:Anne = Annes
x1.Location.address:146 Gloucester Street = 146 Gloucester Street",2,71,count,1
2388,What is the number of officers who examined cases labeled Unable to prosecute suspect?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
What is the number of officers who examined cases labeled Unable to prosecute suspect?",What is the number of officers who examined cases labeled [x1.Crime.last_outcome:Unable to prosecute suspect]?,x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,329,count,1
1626,What's the first crime date linked to F-Series models?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""F-Series"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = F-Series
What's the first crime date linked to F-Series models?",What's the first crime date linked to [x1.Vehicle.model:F-Series] models?,x1.Vehicle.model:F-Series = F-Series,2,214,min,1
1896,How many 1992 cars were connected to incidents on 10/08/2017?,"MATCH (x0:Vehicle WHERE x0.year = ""1992"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1992
[Crime] = 10/08/2017
How many 1992 cars were connected to incidents on 10/08/2017?",How many [x0.Vehicle.year:1992] cars were connected to incidents on [x1.Crime.date:10/08/2017]?,"x0.Vehicle.year:1992 = 1992
x1.Crime.date:10/08/2017 = 10/08/2017",2,253,count,1
723,Which places with the postcode M9 4NL were crime scenes on 20/08/2017?,"MATCH (x0:Location WHERE x0.postcode = ""M9 4NL"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""20/08/2017"")
RETURN x0","[Location] = M9 4NL
[Crime] = 20/08/2017
Which places with the postcode M9 4NL were crime scenes on 20/08/2017?",Which places with the postcode [x0.Location.postcode:M9 4NL] were crime scenes on [x1.Crime.date:20/08/2017]?,"x0.Location.postcode:M9 4NL = M9 4NL
x1.Crime.date:20/08/2017 = 20/08/2017",2,96,entity_set,1
3548,What are the dates of violence and sexual crimes in the M9 area?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M9"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = M9
What are the dates of violence and sexual crimes in the M9 area?",What are the dates of [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:M9] area?,"x0.Crime.type:Violence and sexual offences = violence and sexual crimes 
x2.Area.areaCode:M9 = M9",3,111,attribute_set,187
2701,What was the earliest crime at 60 Deakins Mill Way that involved someone?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""60 Deakins Mill Way"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 60 Deakins Mill Way
What was the earliest crime at 60 Deakins Mill Way that involved someone?",What was the earliest crime at [x1.Location.address:60 Deakins Mill Way] that involved someone?,x1.Location.address:60 Deakins Mill Way = 60 Deakins Mill Way,3,391,min,1
