id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1630,Can you identify areas with locations that have the postcode M20 4SU?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M20 4SU"")
RETURN x0","[Location] = M20 4SU
Can you identify areas with locations that have the postcode M20 4SU?",Can you identify areas with locations that have the postcode [x1.Location.postcode:M20 4SU]?,x1.Location.postcode:M20 4SU = M20 4SU,2,215,entity_set,1
1073,What is the number of phones owned by people named Richard?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Richard"")
RETURN COUNT(DISTINCT x0)","[Person] = Richard
What is the number of phones owned by people named Richard?",What is the number of phones owned by people named [x1.Person.name:Richard]?,x1.Person.name:Richard = Richard,2,142,count,1
962,What's the number of people called Brian who have a friend?,"MATCH (x0:Person WHERE x0.name = ""Brian"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Brian
What's the number of people called Brian who have a friend?",What's the number of people called [x0.Person.name:Brian] who have a friend?,x0.Person.name:Brian = Brian,2,126,count,1
150,What's the earliest call to phones that dialed on 17/08/2017?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""17/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 17/08/2017
What's the earliest call to phones that dialed on 17/08/2017?",What's the earliest call to phones that dialed on [x2.PhoneCall.call_date:17/08/2017]?,x2.PhoneCall.call_date:17/08/2017 = 17/08/2017,3,17,min,1
1889,Which phones made a 79-second call?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""79"")
RETURN x0","[PhoneCall] = 79
Which phones made a 79-second call?",Which phones made a [x1.PhoneCall.call_duration:79]-second call?,x1.PhoneCall.call_duration:79 = 79,2,252,entity_set,4
1984,Can you identify officers named Manuel working on ongoing investigations?,"MATCH (x0:Officer WHERE x0.name = ""Manuel"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Manuel
[Crime] = Under investigation
Can you identify officers named Manuel working on ongoing investigations?",Can you identify officers named [x0.Officer.name:Manuel] working on [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.name:Manuel = Manuel
x1.Crime.last_outcome:Under investigation = ongoing investigations",2,266,entity_set,5
459,Could you list the emails of individuals who share a home with a person whose last name is Gray?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Gray"")
RETURN x0","[Person] = Gray
Could you list the emails of individuals who share a home with a person whose last name is Gray?",Could you list the emails of individuals who share a home with a person whose last name is [x2.Person.surname:Gray]?,x2.Person.surname:Gray = Gray,3,60,entity_set,2
2809,How many emails from people named Phillip who were linked to a crime on 6/08/2017?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Phillip"")-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""6/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Phillip
[Crime] = 6/08/2017
How many emails from people named Phillip who were linked to a crime on 6/08/2017?",How many emails from people named [x1.Person.name:Phillip] who were linked to a crime on [x2.Crime.date:6/08/2017]?,"x1.Person.name:Phillip = Phillip
x2.Crime.date:6/08/2017 = 6/08/2017",3,409,count,1
1178,Which violent and sexual crimes are handled by the officer with badge number 76-8953443?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""76-8953443"")
RETURN x0","[Crime] = Violence and sexual offences
[Officer] = 76-8953443
Which violent and sexual crimes are handled by the officer with badge number 76-8953443?",Which [x0.Crime.type:Violence and sexual offences] are handled by the officer with badge number [x1.Officer.badge_no:76-8953443]?,"x0.Crime.type:Violence and sexual offences = violent and sexual crimes 
x1.Officer.badge_no:76-8953443 = 76-8953443",2,156,entity_set,9
2621,How many places are crime scenes?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)",How many places are crime scenes?,How many places are crime scenes?,,2,378,count,1
1786,"Which crimes, labeled ""Unable to prosecute suspect,"" took place in places in the OL8 4AZ postal zone?","MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL8 4AZ"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Location] = OL8 4AZ
Which crimes, labeled ""Unable to prosecute suspect,"" took place in places in the OL8 4AZ postal zone?","Which crimes, labeled ""[x0.Crime.last_outcome:Unable to prosecute suspect],"" took place in places in the [x1.Location.postcode:OL8 4AZ] postal zone?","x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.postcode:OL8 4AZ = OL8 4AZ",2,236,entity_set,2
55,Who does anyone named Judith know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Judith"")
RETURN x0","[Person] = Judith
Who does anyone named Judith know?",Who does anyone named [x1.Person.name:Judith] know?,x1.Person.name:Judith = Judith,2,7,entity_set,7
1180,What are the locations with postcode M7 1WG where crimes are pending court outcomes?,"MATCH (x0:Location WHERE x0.postcode = ""M7 1WG"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Awaiting court outcome"")
RETURN x0","[Location] = M7 1WG
[Crime] = Awaiting court outcome
What are the locations with postcode M7 1WG where crimes are pending court outcomes?",What are the locations with postcode [x0.Location.postcode:M7 1WG] where crimes are [x1.Crime.last_outcome:Awaiting court outcome]?,"x0.Location.postcode:M7 1WG = M7 1WG
x1.Crime.last_outcome:Awaiting court outcome = pending court outcomes",2,158,entity_set,2
4634,What's the first crime involving someone who knows Ann's phone number?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.name = ""Ann"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Ann
What's the first crime involving someone who knows Ann's phone number?",What's the first crime involving someone who knows [x2.Person.name:Ann]'s phone number?,x2.Person.name:Ann = Ann,3,89,min,1
3459,What time did a person with the surname Gordon get a call on 29th August 2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Gordon"")
RETURN x0.call_time","[PhoneCall] = 29/08/2017
[Person] = Gordon
What time did a person with the surname Gordon get a call on 29th August 2017?",What time did a person with the surname [x2.Person.surname:Gordon] get a call on [x0.PhoneCall.call_date:29/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = 29th August 2017 
x2.Person.surname:Gordon = Gordon",3,77,attribute_set,1
2065,Which people have connections to anyone bearing the surname Moreno?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Moreno"")
RETURN x0","[Person] = Moreno
Which people have connections to anyone bearing the surname Moreno?",Which people have connections to anyone bearing the surname [x1.Person.surname:Moreno]?,x1.Person.surname:Moreno = Moreno,2,277,entity_set,13
928,"How many crimes on August 23, 2017, involved a vehicle?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
How many crimes on August 23, 2017, involved a vehicle?","How many crimes on [x0.Crime.date:23/08/2017], involved a vehicle?","x0.Crime.date:23/08/2017 = August 23, 2017",2,121,count,1
1918,What phones logged a call of 32 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""32"")
RETURN x0","[PhoneCall] = 32
What phones logged a call of 32 seconds?",What phones logged a call of [x1.PhoneCall.call_duration:32] seconds?,x1.PhoneCall.call_duration:32 = 32,2,255,entity_set,4
3023,What is the date of the latest offense at locations of residence of individuals with the last name Matthews?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Matthews"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Matthews
What is the date of the latest offense at locations of residence of individuals with the last name Matthews?",What is the date of the latest offense at locations of residence of individuals with the last name [x2.Person.surname:Matthews]?,x2.Person.surname:Matthews = Matthews,3,439,argmax,1
1703,What are the locations at 98 Tatton Road North where someone with last name Fernandez lives?,"MATCH (x0:Location WHERE x0.address = ""98 Tatton Road North"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Location] = 98 Tatton Road North
[Person] = Fernandez
What are the locations at 98 Tatton Road North where someone with last name Fernandez lives?",What are the locations at [x0.Location.address:98 Tatton Road North] where someone with last name [x1.Person.surname:Fernandez] lives?,"x0.Location.address:98 Tatton Road North = 98 Tatton Road North
x1.Person.surname:Fernandez = Fernandez",2,224,entity_set,1
367,What are the places at 106 Roe Street with the postcode OL12 7DF?,"MATCH (x0:Location WHERE x0.address = ""106 Roe Street"")-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""OL12 7DF"")
RETURN x0","[Location] = 106 Roe Street
[PostCode] = OL12 7DF
What are the places at 106 Roe Street with the postcode OL12 7DF?",What are the places at [x0.Location.address:106 Roe Street] with the postcode [x1.PostCode.code:OL12 7DF]?,"x0.Location.address:106 Roe Street = 106 Roe Street
x1.PostCode.code:OL12 7DF = OL12 7DF",2,47,entity_set,1
1764,Which regions correspond to postcode OL9 8HD?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""OL9 8HD"")
RETURN x0","[PostCode] = OL9 8HD
Which regions correspond to postcode OL9 8HD?",Which regions correspond to postcode [x1.PostCode.code:OL9 8HD]?,x1.PostCode.code:OL9 8HD = OL9 8HD,2,234,entity_set,1
1917,Can you identify phones with a 32-second call?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""32"")
RETURN x0","[PhoneCall] = 32
Can you identify phones with a 32-second call?",Can you identify phones with a [x1.PhoneCall.call_duration:32]-second call?,x1.PhoneCall.call_duration:32 = 32,2,255,entity_set,4
2183,How many Maseratis are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Maserati"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Maserati
How many Maseratis are linked to crimes?",How many [x0.Vehicle.make:Maserati] are linked to crimes?,x0.Vehicle.make:Maserati = Maseratis,2,295,count,1
595,How old is the oldest person who knows someone with surname Brooks?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Brooks"")
RETURN x0.age
ORDER BY x0.age ASC
LIMIT 1","[Person] = Brooks
How old is the oldest person who knows someone with surname Brooks?",How old is the oldest person who knows someone with surname [x1.Person.surname:Brooks]?,x1.Person.surname:Brooks = Brooks,2,78,argmin,1
532,Which call lasted the longest to the number 1-(841)295-6536?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(841)295-6536"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 1-(841)295-6536
Which call lasted the longest to the number 1-(841)295-6536?",Which call lasted the longest to the number [x1.Phone.phoneNo:1-(841)295-6536]?,x1.Phone.phoneNo:1-(841)295-6536 = 1-(841)295-6536,2,69,max,1
655,What is the number of crimes reported at the location with the postal code M1 1NN?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M1 1NN"")
RETURN COUNT(DISTINCT x0)","[Location] = M1 1NN
What is the number of crimes reported at the location with the postal code M1 1NN?",What is the number of crimes reported at the location with the postal code [x1.Location.postcode:M1 1NN]?,x1.Location.postcode:M1 1NN = M1 1NN,2,87,count,1
417,Which locations correspond to the postcode M9 8DA?,"MATCH (x0:Location)-[:HAS_POSTCODE]-(x1:PostCode WHERE x1.code = ""M9 8DA"")
RETURN x0","[PostCode] = M9 8DA
Which locations correspond to the postcode M9 8DA?",Which locations correspond to the postcode [x1.PostCode.code:M9 8DA]?,x1.PostCode.code:M9 8DA = M9 8DA,2,54,entity_set,2
2235,"On 24th August 2017, how many criminal acts involve someone with the NHS number 335-71-7747?","MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""335-71-7747"")
RETURN COUNT(DISTINCT x0)","[Crime] = 24/08/2017
[Person] = 335-71-7747
On 24th August 2017, how many criminal acts involve someone with the NHS number 335-71-7747?","On [x0.Crime.date:24/08/2017], how many criminal acts involve someone with the NHS number [x1.Person.nhs_no:335-71-7747]?","x0.Crime.date:24/08/2017 = 24th August 2017 
x1.Person.nhs_no:335-71-7747 = 335-71-7747",2,301,count,1
3435,What was the length of the longest call that someone named Philip got?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Philip"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Philip
What was the length of the longest call that someone named Philip got?",What was the length of the longest call that someone named [x2.Person.name:Philip] got?,x2.Person.name:Philip = Philip,3,66,argmax,1
1937,What are the crime dates linked to individuals whose phone numbers are known by those with surname Duncan?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Duncan"")
RETURN x0.date","[Person] = Duncan
What are the crime dates linked to individuals whose phone numbers are known by those with surname Duncan?",What are the crime dates linked to individuals whose phone numbers are known by those with surname [x2.Person.surname:Duncan]?,x2.Person.surname:Duncan = Duncan,3,258,attribute_set,1
1412,What is the count of emails linked to individuals named Victor?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.name = ""Victor"")
RETURN COUNT(DISTINCT x0)","[Person] = Victor
What is the count of emails linked to individuals named Victor?",What is the count of emails linked to individuals named [x1.Person.name:Victor]?,x1.Person.name:Victor = Victor,2,187,count,1
665,Can you name everyone who is friends with someone with surname Washington?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Washington"")
RETURN x0","[Person] = Washington
Can you name everyone who is friends with someone with surname Washington?",Can you name everyone who is friends with someone with surname [x1.Person.surname:Washington]?,x1.Person.surname:Washington = Washington,2,88,entity_set,6
1973,How many calls were made to any phone at 22:48?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""22:48"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 22:48
How many calls were made to any phone at 22:48?",How many calls were made to any phone at [x0.PhoneCall.call_time:22:48]?,x0.PhoneCall.call_time:22:48 = 22:48,2,265,count,1
475,What are all the calls received by the number 1-(963)530-6466?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(963)530-6466"")
RETURN x0","[Phone] = 1-(963)530-6466
What are all the calls received by the number 1-(963)530-6466?",What are all the calls received by the number [x1.Phone.phoneNo:1-(963)530-6466]?,x1.Phone.phoneNo:1-(963)530-6466 = 1-(963)530-6466,2,62,entity_set,2
1939,Which crime dates involve individuals whose phone numbers are known by people with the surname Duncan?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Duncan"")
RETURN x0.date","[Person] = Duncan
Which crime dates involve individuals whose phone numbers are known by people with the surname Duncan?",Which crime dates involve individuals whose phone numbers are known by people with the surname [x2.Person.surname:Duncan]?,x2.Person.surname:Duncan = Duncan,3,258,attribute_set,1
1273,How many called Harold are friends with someone whose last name is Hernandez?,"MATCH (x0:Person WHERE x0.name = ""Harold"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN COUNT(DISTINCT x0)","[Person] = Harold
[Person] = Hernandez
How many called Harold are friends with someone whose last name is Hernandez?",How many called [x0.Person.name:Harold] are friends with someone whose last name is [x1.Person.surname:Hernandez]?,"x0.Person.name:Harold = Harold
x1.Person.surname:Hernandez = Hernandez",2,169,count,1
1599,Can you provide the post codes for crime sites on 15th August 2017?,"MATCH (x0:PostCode)-[:HAS_POSTCODE]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""15/08/2017"")
RETURN x0","[Crime] = 15/08/2017
Can you provide the post codes for crime sites on 15th August 2017?",Can you provide the post codes for crime sites on [x2.Crime.date:15/08/2017]?,x2.Crime.date:15/08/2017 = 15th August 2017,3,211,entity_set,922
15,How many ongoing investigations involve officers with the surname Yukhnevich?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Yukhnevich"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = Yukhnevich
How many ongoing investigations involve officers with the surname Yukhnevich?",How many [x0.Crime.last_outcome:Under investigation] involve officers with the surname [x1.Officer.surname:Yukhnevich]?,"x0.Crime.last_outcome:Under investigation = ongoing investigations 
x1.Officer.surname:Yukhnevich = Yukhnevich",2,2,count,1
343,What are the most recent crimes at 94 Ashworth Street?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""94 Ashworth Street"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Location] = 94 Ashworth Street
What are the most recent crimes at 94 Ashworth Street?",What are the most recent crimes at [x1.Location.address:94 Ashworth Street]?,x1.Location.address:94 Ashworth Street = 94 Ashworth Street,2,43,max,1
128,How many emails are associated with NHS number 274-72-8781?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""274-72-8781"")
RETURN COUNT(DISTINCT x0)","[Person] = 274-72-8781
How many emails are associated with NHS number 274-72-8781?",How many emails are associated with NHS number [x1.Person.nhs_no:274-72-8781]?,x1.Person.nhs_no:274-72-8781 = 274-72-8781,2,15,count,1
509,What is the count of crimes with the status Unable to prosecute suspect in locations with the SK3 8NP post code?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK3 8NP"")
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
[Location] = SK3 8NP
What is the count of crimes with the status Unable to prosecute suspect in locations with the SK3 8NP post code?",What is the count of crimes with the status [x0.Crime.last_outcome:Unable to prosecute suspect] in locations with the [x1.Location.postcode:SK3 8NP] post code?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.postcode:SK3 8NP = SK3 8NP",2,67,count,1
1476,Which is the oldest car associated to a crime where someone with last name Ward is also associated?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Ward"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Person] = Ward
Which is the oldest car associated to a crime where someone with last name Ward is also associated?",Which is the oldest car associated to a crime where someone with last name [x2.Person.surname:Ward] is also associated?,x2.Person.surname:Ward = Ward,3,196,max,1
985,How many crimes included vehicles of the Safari model?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Safari"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Safari
How many crimes included vehicles of the Safari model?",How many crimes included vehicles of the [x1.Vehicle.model:Safari] model?,x1.Vehicle.model:Safari = Safari,2,128,count,1
2563,What is the earliest crime that included a Rondo model and a person with last name Moore?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Moore"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Rondo"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Moore
[Vehicle] = Rondo
What is the earliest crime that included a Rondo model and a person with last name Moore?",What is the earliest crime that included a [x1.Vehicle.model:Rondo] model and a person with last name [x2.Person.surname:Moore]?,"x1.Vehicle.model:Rondo = Rondo
x2.Person.surname:Moore = Moore",3,358,min,1
3223,Can you provide the NHS numbers for those who got a call at 21:07?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)-[:CALLED]-(x2:PhoneCall WHERE x2.call_time = ""21:07"")
RETURN x0.nhs_no","[PhoneCall] = 21:07
Can you provide the NHS numbers for those who got a call at 21:07?",Can you provide the NHS numbers for those who got a call at [x2.PhoneCall.call_time:21:07]?,x2.PhoneCall.call_time:21:07 = 21:07,3,26,attribute_set,1
2594,When did an officer with last name Stutard first investigate a crime?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Stutard"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stutard
When did an officer with last name Stutard first investigate a crime?",When did an officer with last name [x1.Officer.surname:Stutard] first investigate a crime?,x1.Officer.surname:Stutard = Stutard,2,367,argmin,1
4562,How many public order offenses involve the person with the phone number 9-(494)467-2643?,"MATCH (x0:Crime WHERE x0.type = ""Public order"")-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""9-(494)467-2643"")
RETURN COUNT(DISTINCT x0)","[Crime] = Public order
[Phone] = 9-(494)467-2643
How many public order offenses involve the person with the phone number 9-(494)467-2643?",How many [x0.Crime.type:Public order] offenses involve the person with the phone number [x2.Phone.phoneNo:9-(494)467-2643]?,"x0.Crime.type:Public order = public order
x2.Phone.phoneNo:9-(494)467-2643 = 9-(494)467-2643",3,66,count,1
1835,What calls were received at 11:28 by the number 5-(583)536-4990?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""11:28"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""5-(583)536-4990"")
RETURN x0","[PhoneCall] = 11:28
[Phone] = 5-(583)536-4990
What calls were received at 11:28 by the number 5-(583)536-4990?",What calls were received at [x0.PhoneCall.call_time:11:28] by the number [x1.Phone.phoneNo:5-(583)536-4990]?,"x0.PhoneCall.call_time:11:28 = 11:28
x1.Phone.phoneNo:5-(583)536-4990 = 5-(583)536-4990",2,244,entity_set,1
888,Which emails correspond to the NHS number 859-40-9947?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.nhs_no = ""859-40-9947"")
RETURN x0","[Person] = 859-40-9947
Which emails correspond to the NHS number 859-40-9947?",Which emails correspond to the NHS number [x1.Person.nhs_no:859-40-9947]?,x1.Person.nhs_no:859-40-9947 = 859-40-9947,2,116,entity_set,1
336,Who are the residents of 63 Princess Avenue?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""63 Princess Avenue"")
RETURN x0","[Location] = 63 Princess Avenue
Who are the residents of 63 Princess Avenue?",Who are the residents of [x1.Location.address:63 Princess Avenue]?,x1.Location.address:63 Princess Avenue = 63 Princess Avenue,2,42,entity_set,1
228,What phones dialed the number 0-(711)302-8090?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall)-[:CALLED]-(x2:Phone WHERE x2.phoneNo = ""0-(711)302-8090"")
RETURN x0","[Phone] = 0-(711)302-8090
What phones dialed the number 0-(711)302-8090?",What phones dialed the number [x2.Phone.phoneNo:0-(711)302-8090]?,x2.Phone.phoneNo:0-(711)302-8090 = 0-(711)302-8090,3,28,entity_set,6
961,How many Brians have a friend?,"MATCH (x0:Person WHERE x0.name = ""Brian"")-[:KNOWS_SN]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Person] = Brian
How many Brians have a friend?",How many [x0.Person.name:Brian] have a friend?,x0.Person.name:Brian = Brians,2,126,count,1
1824,Who is the youngest person living with anyone who has the phone number of a person with surname Garza?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Garza"")
RETURN x0
ORDER BY x0.age ASC
LIMIT 1","[Person] = Garza
Who is the youngest person living with anyone who has the phone number of a person with surname Garza?",Who is the youngest person living with anyone who has the phone number of a person with surname [x2.Person.surname:Garza]?,x2.Person.surname:Garza = Garza,3,243,min,1
2800,What are the emails of residents at 63 Princess Avenue?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.address = ""63 Princess Avenue"")
RETURN x0","[Location] = 63 Princess Avenue
What are the emails of residents at 63 Princess Avenue?",What are the emails of residents at [x2.Location.address:63 Princess Avenue]?,x2.Location.address:63 Princess Avenue = 63 Princess Avenue,3,408,entity_set,1
473,Can you show me every call that came to 8-(657)218-7659?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""8-(657)218-7659"")
RETURN x0","[Phone] = 8-(657)218-7659
Can you show me every call that came to 8-(657)218-7659?",Can you show me every call that came to [x1.Phone.phoneNo:8-(657)218-7659]?,x1.Phone.phoneNo:8-(657)218-7659 = 8-(657)218-7659,2,62,entity_set,2
1023,When did the last crime occur at any address with the postcode BL6 4HY?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""BL6 4HY"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = BL6 4HY
When did the last crime occur at any address with the postcode BL6 4HY?",When did the last crime occur at any address with the postcode [x2.PostCode.code:BL6 4HY]?,x2.PostCode.code:BL6 4HY = BL6 4HY,3,135,argmax,1
4625,When did the first crime occur involving someone living at postcode WA14 5BH?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""WA14 5BH"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = WA14 5BH
When did the first crime occur involving someone living at postcode WA14 5BH?",When did the first crime occur involving someone living at postcode [x2.Location.postcode:WA14 5BH]?,x2.Location.postcode:WA14 5BH = WA14 5BH,3,86,argmin,1
3096,How many crimes are linked to someone surnamed Hughes who is friends with Bonnie?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Hughes"")-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Bonnie"")
RETURN COUNT(DISTINCT x0)","[Person] = Hughes
[Person] = Bonnie
How many crimes are linked to someone surnamed Hughes who is friends with Bonnie?",How many crimes are linked to someone surnamed [x1.Person.surname:Hughes] who is friends with [x2.Person.name:Bonnie]?,"x1.Person.surname:Hughes = Hughes
x2.Person.name:Bonnie = Bonnie",3,7,count,1
1259,Can you provide a list of crimes involving R32 vehicles on 28/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""28/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""R32"")
RETURN x0","[Crime] = 28/08/2017
[Vehicle] = R32
Can you provide a list of crimes involving R32 vehicles on 28/08/2017?",Can you provide a list of crimes involving [x1.Vehicle.model:R32] vehicles on [x0.Crime.date:28/08/2017]?,"x0.Crime.date:28/08/2017 = 28/08/2017
x1.Vehicle.model:R32 = R32",2,167,entity_set,1
4449,Can you provide the email addresses of a person who resides with Rachel?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Rachel"")
RETURN x0.email_address","[Person] = Rachel
Can you provide the email addresses of a person who resides with Rachel?",Can you provide the email addresses of a person who resides with [x2.Person.name:Rachel]?,x2.Person.name:Rachel = Rachel,3,29,attribute_set,4
858,How many Ernests were implicated in crimes on 7/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Ernest"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Ernest
[Crime] = 7/08/2017
How many Ernests were implicated in crimes on 7/08/2017?",How many [x0.Person.name:Ernest] were implicated in crimes on [x1.Crime.date:7/08/2017]?,"x0.Person.name:Ernest = Ernests
x1.Crime.date:7/08/2017 = 7/08/2017",2,113,count,1
35,Which Pontiac vehicles are linked to vehicle crimes?,"MATCH (x0:Vehicle WHERE x0.make = ""Pontiac"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Vehicle] = Pontiac
[Crime] = Vehicle crime
Which Pontiac vehicles are linked to vehicle crimes?",Which [x0.Vehicle.make:Pontiac] vehicles are linked to [x1.Crime.type:Vehicle crime]s?,"x0.Vehicle.make:Pontiac = Pontiac
x1.Crime.type:Vehicle crime = vehicle crime",2,5,entity_set,43
854,What is the count of people named Andrea connected to crimes on 30/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrea
[Crime] = 30/08/2017
What is the count of people named Andrea connected to crimes on 30/08/2017?",What is the count of people named [x0.Person.name:Andrea] connected to crimes on [x1.Crime.date:30/08/2017]?,"x0.Person.name:Andrea = Andrea
x1.Crime.date:30/08/2017 = 30/08/2017",2,113,count,1
2238,"On 23rd August 2017, how many criminal activities include someone with NHS number 397-28-4474?","MATCH (x0:Crime WHERE x0.date = ""23/08/2017"")-[:PARTY_TO]-(x1:Person WHERE x1.nhs_no = ""397-28-4474"")
RETURN COUNT(DISTINCT x0)","[Crime] = 23/08/2017
[Person] = 397-28-4474
On 23rd August 2017, how many criminal activities include someone with NHS number 397-28-4474?","On [x0.Crime.date:23/08/2017], how many criminal activities include someone with NHS number [x1.Person.nhs_no:397-28-4474]?","x0.Crime.date:23/08/2017 = 23rd August 2017 
x1.Person.nhs_no:397-28-4474 = 397-28-4474",2,301,count,1
2426,Which crime did officers with last name Jupp investigate first?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Jupp"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Jupp
Which crime did officers with last name Jupp investigate first?",Which crime did officers with last name [x1.Officer.surname:Jupp] investigate first?,x1.Officer.surname:Jupp = Jupp,2,334,min,1
2396,Which crimes involving a Coupe GT and someone with surname Black happened first?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Coupe GT"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Black"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Coupe GT
[Person] = Black
Which crimes involving a Coupe GT and someone with surname Black happened first?",Which crimes involving a [x2.Vehicle.model:Coupe GT] and someone with surname [x1.Person.surname:Black] happened first?,"x1.Person.surname:Black = Black
x2.Vehicle.model:Coupe GT = Coupe GT",3,331,min,1
465,Which offenses are associated with those who have the last name Peters?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Peters"")
RETURN x0","[Person] = Peters
Which offenses are associated with those who have the last name Peters?",Which offenses are associated with those who have the last name [x1.Person.surname:Peters]?,x1.Person.surname:Peters = Peters,2,61,entity_set,3
18,What is the number of locations with crim incidents with the postcode OL4 1AH?,"MATCH (x0:Location WHERE x0.postcode = ""OL4 1AH"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = OL4 1AH
What is the number of locations with crim incidents with the postcode OL4 1AH?",What is the number of locations with crim incidents with the postcode [x0.Location.postcode:OL4 1AH]?,x0.Location.postcode:OL4 1AH = OL4 1AH,2,3,count,1
