id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
926,"On 20/08/2017, how many crimes included a vehicle?","MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle)
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
On 20/08/2017, how many crimes included a vehicle?","On [x0.Crime.date:20/08/2017], how many crimes included a vehicle?",x0.Crime.date:20/08/2017 = 20/08/2017,2,121,count,1
355,How many offenses are linked to individuals with last name Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Murray"")
RETURN COUNT(DISTINCT x0)","[Person] = Murray
How many offenses are linked to individuals with last name Murray?",How many offenses are linked to individuals with last name [x1.Person.surname:Murray]?,x1.Person.surname:Murray = Murray,2,44,count,1
574,Where does someone with NHS number 520-74-1446 live if their postcode is M28 7FY?,"MATCH (x0:Location WHERE x0.postcode = ""M28 7FY"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""520-74-1446"")
RETURN x0","[Location] = M28 7FY
[Person] = 520-74-1446
Where does someone with NHS number 520-74-1446 live if their postcode is M28 7FY?",Where does someone with NHS number [x1.Person.nhs_no:520-74-1446] live if their postcode is [x0.Location.postcode:M28 7FY]?,"x0.Location.postcode:M28 7FY = M28 7FY
x1.Person.nhs_no:520-74-1446 = 520-74-1446",2,76,entity_set,1
1312,How many calls at 18:05 went to 6-(622)025-5648?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""18:05"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""6-(622)025-5648"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 18:05
[Phone] = 6-(622)025-5648
How many calls at 18:05 went to 6-(622)025-5648?",How many calls at [x0.PhoneCall.call_time:18:05] went to [x1.Phone.phoneNo:6-(622)025-5648]?,"x0.PhoneCall.call_time:18:05 = 18:05
x1.Phone.phoneNo:6-(622)025-5648 = 6-(622)025-5648",2,174,count,1
844,What crimes involved Daihatsu vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Daihatsu"")
RETURN x0","[Vehicle] = Daihatsu
What crimes involved Daihatsu vehicles?",What crimes involved [x1.Vehicle.make:Daihatsu] vehicles?,x1.Vehicle.make:Daihatsu = Daihatsu,2,112,entity_set,2
1987,What are the emails of individuals familiar with a Woods' phone number?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Woods"")
RETURN x0","[Person] = Woods
What are the emails of individuals familiar with a Woods' phone number?",What are the emails of individuals familiar with a [x2.Person.surname:Woods]' phone number?,x2.Person.surname:Woods = Woods,3,267,entity_set,2
4572,Which officer handled the investigation of the crime linked to the individual with NHS number 589-69-0106?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""589-69-0106"")
RETURN x0","[Person] = 589-69-0106
Which officer handled the investigation of the crime linked to the individual with NHS number 589-69-0106?",Which officer handled the investigation of the crime linked to the individual with NHS number [x2.Person.nhs_no:589-69-0106]?,x2.Person.nhs_no:589-69-0106 = 589-69-0106,3,67,entity_set,1
1274,How many individuals named Harold have a friend with the surname Hernandez?,"MATCH (x0:Person WHERE x0.name = ""Harold"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Hernandez"")
RETURN COUNT(DISTINCT x0)","[Person] = Harold
[Person] = Hernandez
How many individuals named Harold have a friend with the surname Hernandez?",How many individuals named [x0.Person.name:Harold] have a friend with the surname [x1.Person.surname:Hernandez]?,"x0.Person.name:Harold = Harold
x1.Person.surname:Hernandez = Hernandez",2,169,count,1
1430,How many crimes labeled Unable to prosecute suspect involve someone?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Crime] = Unable to prosecute suspect
How many crimes labeled Unable to prosecute suspect involve someone?",How many crimes labeled [x0.Crime.last_outcome:Unable to prosecute suspect] involve someone?,x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect,2,189,count,1
2110,Who holds the phone number 7-(469)440-8216?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""7-(469)440-8216"")
RETURN x0","[Phone] = 7-(469)440-8216
Who holds the phone number 7-(469)440-8216?",Who holds the phone number [x1.Phone.phoneNo:7-(469)440-8216]?,x1.Phone.phoneNo:7-(469)440-8216 = 7-(469)440-8216,2,285,entity_set,1
1318,How many calls at 20:36 went to 7-(492)933-2044?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""20:36"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(492)933-2044"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 20:36
[Phone] = 7-(492)933-2044
How many calls at 20:36 went to 7-(492)933-2044?",How many calls at [x0.PhoneCall.call_time:20:36] went to [x1.Phone.phoneNo:7-(492)933-2044]?,"x0.PhoneCall.call_time:20:36 = 20:36
x1.Phone.phoneNo:7-(492)933-2044 = 7-(492)933-2044",2,174,count,1
235,"What phone calls were made to 3-(285)553-8319 on August 18, 2017?","MATCH (x0:PhoneCall WHERE x0.call_date = ""18/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(285)553-8319"")
RETURN x0","[PhoneCall] = 18/08/2017
[Phone] = 3-(285)553-8319
What phone calls were made to 3-(285)553-8319 on August 18, 2017?",What phone calls were made to [x1.Phone.phoneNo:3-(285)553-8319] on [x0.PhoneCall.call_date:18/08/2017]?,"x0.PhoneCall.call_date:18/08/2017 = August 18, 2017 
x1.Phone.phoneNo:3-(285)553-8319 = 3-(285)553-8319",2,29,entity_set,1
151,"Which is the first call made to phones that called on August 17, 2017?","MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""17/08/2017"")
RETURN x0
ORDER BY x0.call_date ASC
LIMIT 1","[PhoneCall] = 17/08/2017
Which is the first call made to phones that called on August 17, 2017?",Which is the first call made to phones that called on [x2.PhoneCall.call_date:17/08/2017]?,"x2.PhoneCall.call_date:17/08/2017 = August 17, 2017",3,17,min,1
1066,How many phones does someone named Amy own?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Amy
How many phones does someone named Amy own?",How many phones does someone named [x1.Person.name:Amy] own?,x1.Person.name:Amy = Amy,2,142,count,1
3110,How many homes belong to individuals who have an email?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_EMAIL]-(x2:Email)
RETURN COUNT(DISTINCT x0)",How many homes belong to individuals who have an email?,How many homes belong to individuals who have an email?,,3,9,count,1
533,What was the longest call made to 1-(841)295-6536?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(841)295-6536"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 1-(841)295-6536
What was the longest call made to 1-(841)295-6536?",What was the longest call made to [x1.Phone.phoneNo:1-(841)295-6536]?,x1.Phone.phoneNo:1-(841)295-6536 = 1-(841)295-6536,2,69,max,1
2292,What is the most recent date of a crime at 129 Rock Terrace that involved someone with the last name Patterson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Patterson"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""129 Rock Terrace"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Patterson
[Location] = 129 Rock Terrace
What is the most recent date of a crime at 129 Rock Terrace that involved someone with the last name Patterson?",What is the most recent date of a crime at [x1.Location.address:129 Rock Terrace] that involved someone with the last name [x2.Person.surname:Patterson]?,"x1.Location.address:129 Rock Terrace = 129 Rock Terrace
x2.Person.surname:Patterson = Patterson",3,309,argmax,1
1278,How many individuals named Diane have someone with surname Bennett as a friend?,"MATCH (x0:Person WHERE x0.name = ""Diane"")-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Bennett"")
RETURN COUNT(DISTINCT x0)","[Person] = Diane
[Person] = Bennett
How many individuals named Diane have someone with surname Bennett as a friend?",How many individuals named [x0.Person.name:Diane] have someone with surname [x1.Person.surname:Bennett] as a friend?,"x0.Person.name:Diane = Diane
x1.Person.surname:Bennett = Bennett",2,169,count,1
1009,Who are the Chief Inspectors who have investigated vehicle crimes?,"MATCH (x0:Officer WHERE x0.rank = ""Chief Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Vehicle crime"")
RETURN x0","[Officer] = Chief Inspector
[Crime] = Vehicle crime
Who are the Chief Inspectors who have investigated vehicle crimes?",Who are the [x0.Officer.rank:Chief Inspector] who have investigated [x1.Crime.type:Vehicle crime]?,"x0.Officer.rank:Chief Inspector = Chief Inspectors
x1.Crime.type:Vehicle crime = vehicle crimes",2,133,entity_set,227
332,Can you name everyone living at 182 Elm Road?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location WHERE x1.address = ""182 Elm Road"")
RETURN x0","[Location] = 182 Elm Road
Can you name everyone living at 182 Elm Road?",Can you name everyone living at [x1.Location.address:182 Elm Road]?,x1.Location.address:182 Elm Road = 182 Elm Road,2,42,entity_set,1
1444,How many crimes on 21/08/2017 are probed by officers with badge number 21-0331808?,"MATCH (x0:Crime WHERE x0.date = ""21/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""21-0331808"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
[Officer] = 21-0331808
How many crimes on 21/08/2017 are probed by officers with badge number 21-0331808?",How many crimes on [x0.Crime.date:21/08/2017] are probed by officers with badge number [x1.Officer.badge_no:21-0331808]?,"x0.Crime.date:21/08/2017 = 21/08/2017
x1.Officer.badge_no:21-0331808 = 21-0331808",2,190,count,1
1702,Which homes at 57 Linden Avenue belong to people whose last name is Cooper?,"MATCH (x0:Location WHERE x0.address = ""57 Linden Avenue"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Cooper"")
RETURN x0","[Location] = 57 Linden Avenue
[Person] = Cooper
Which homes at 57 Linden Avenue belong to people whose last name is Cooper?",Which homes at [x0.Location.address:57 Linden Avenue] belong to people whose last name is [x1.Person.surname:Cooper]?,"x0.Location.address:57 Linden Avenue = 57 Linden Avenue
x1.Person.surname:Cooper = Cooper",2,224,entity_set,1
2520,Can you provide a list of places in the M30 area code?,"MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M30"")
RETURN x0","[Area] = M30
Can you provide a list of places in the M30 area code?",Can you provide a list of places in the [x1.Area.areaCode:M30] area code?,x1.Area.areaCode:M30 = M30,2,351,entity_set,210
1784,"What crimes with the status ""Unable to prosecute suspect"" happened in OL8 4AZ locations?","MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""OL8 4AZ"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Location] = OL8 4AZ
What crimes with the status ""Unable to prosecute suspect"" happened in OL8 4AZ locations?","What crimes with the status ""[x0.Crime.last_outcome:Unable to prosecute suspect]"" happened in [x1.Location.postcode:OL8 4AZ] locations?","x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.postcode:OL8 4AZ = OL8 4AZ",2,236,entity_set,2
1488,Would you list emails for everyone with last name Fernandez?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person WHERE x1.surname = ""Fernandez"")
RETURN x0","[Person] = Fernandez
Would you list emails for everyone with last name Fernandez?",Would you list emails for everyone with last name [x1.Person.surname:Fernandez]?,x1.Person.surname:Fernandez = Fernandez,2,198,entity_set,3
207,How many crimes from 4/08/2017 did officers investigate?,"MATCH (x0:Crime WHERE x0.date = ""4/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 4/08/2017
How many crimes from 4/08/2017 did officers investigate?",How many crimes from [x0.Crime.date:4/08/2017] did officers investigate?,x0.Crime.date:4/08/2017 = 4/08/2017,2,25,count,1
915,How many folks are acquainted with someone whose last name is Duncan?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Duncan"")
RETURN COUNT(DISTINCT x0)","[Person] = Duncan
How many folks are acquainted with someone whose last name is Duncan?",How many folks are acquainted with someone whose last name is [x1.Person.surname:Duncan]?,x1.Person.surname:Duncan = Duncan,2,119,count,1
526,Which call lasted the longest to the number 8-(108)735-5670?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(108)735-5670"")
RETURN x0
ORDER BY x0.call_duration DESC
LIMIT 1","[Phone] = 8-(108)735-5670
Which call lasted the longest to the number 8-(108)735-5670?",Which call lasted the longest to the number [x1.Phone.phoneNo:8-(108)735-5670]?,x1.Phone.phoneNo:8-(108)735-5670 = 8-(108)735-5670,2,69,max,1
855,How many Andreas were implicated in crimes on 30/08/2017?,"MATCH (x0:Person WHERE x0.name = ""Andrea"")-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrea
[Crime] = 30/08/2017
How many Andreas were implicated in crimes on 30/08/2017?",How many [x0.Person.name:Andrea] were implicated in crimes on [x1.Crime.date:30/08/2017]?,"x0.Person.name:Andrea = Andreas
x1.Crime.date:30/08/2017 = 30/08/2017",2,113,count,1
1696,Can you tell me the crime count for 46 Dunkery Road on 27/08/2017?,"MATCH (x0:Crime WHERE x0.date = ""27/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""46 Dunkery Road"")
RETURN COUNT(DISTINCT x0)","[Crime] = 27/08/2017
[Location] = 46 Dunkery Road
Can you tell me the crime count for 46 Dunkery Road on 27/08/2017?",Can you tell me the crime count for [x1.Location.address:46 Dunkery Road] on [x0.Crime.date:27/08/2017]?,"x0.Crime.date:27/08/2017 = 27/08/2017
x1.Location.address:46 Dunkery Road = 46 Dunkery Road",2,223,count,1
82,Which individuals named Henry have the email hjacobs91@virginia.edu?,"MATCH (x0:Person WHERE x0.name = ""Henry"")-[:HAS_EMAIL]-(x1:Email WHERE x1.email_address = ""hjacobs91@virginia.edu"")
RETURN x0","[Person] = Henry
[Email] = hjacobs91@virginia.edu
Which individuals named Henry have the email hjacobs91@virginia.edu?",Which individuals named [x0.Person.name:Henry] have the email [x1.Email.email_address:hjacobs91@virginia.edu]?,"x0.Person.name:Henry = Henry
x1.Email.email_address:hjacobs91@virginia.edu = hjacobs91@virginia.edu",2,10,entity_set,1
1757,How many crimes included vehicles from 2001?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2001"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
How many crimes included vehicles from 2001?",How many crimes included vehicles from [x1.Vehicle.year:2001]?,x1.Vehicle.year:2001 = 2001,2,233,count,1
390,What is the latest incident featuring vehicles of the Kizashi model?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Kizashi"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Kizashi
What is the latest incident featuring vehicles of the Kizashi model?",What is the latest incident featuring vehicles of the [x1.Vehicle.model:Kizashi] model?,x1.Vehicle.model:Kizashi = Kizashi,2,51,max,1
3022,What is the date of the most recent crime at residences of those with the surname Matthews?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Matthews"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = Matthews
What is the date of the most recent crime at residences of those with the surname Matthews?",What is the date of the most recent crime at residences of those with the surname [x2.Person.surname:Matthews]?,x2.Person.surname:Matthews = Matthews,3,439,argmax,1
292,What violent and sexual crimes happened at 183 Naylor Street?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Naylor Street"")
RETURN x0","[Crime] = Violence and sexual offences
[Location] = 183 Naylor Street
What violent and sexual crimes happened at 183 Naylor Street?",What [x0.Crime.type:Violence and sexual offences] happened at [x1.Location.address:183 Naylor Street]?,"x0.Crime.type:Violence and sexual offences = violent and sexual crimes 
x1.Location.address:183 Naylor Street = 183 Naylor Street",2,37,entity_set,1
1358,Can you identify all 1987 vehicles connected to a crime on 14th August 2017?,"MATCH (x0:Vehicle WHERE x0.year = ""1987"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""14/08/2017"")
RETURN x0","[Vehicle] = 1987
[Crime] = 14/08/2017
Can you identify all 1987 vehicles connected to a crime on 14th August 2017?",Can you identify all [x0.Vehicle.year:1987] vehicles connected to a crime on [x1.Crime.date:14/08/2017]?,"x0.Vehicle.year:1987 = 1987
x1.Crime.date:14/08/2017 = 14th August 2017",2,179,entity_set,1
679,In how many places does someone named Christine live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Christine"")
RETURN COUNT(DISTINCT x0)","[Person] = Christine
In how many places does someone named Christine live?",In how many places does someone named [x1.Person.name:Christine] live?,x1.Person.name:Christine = Christine,2,90,count,1
428,Who are the Inspectors working on ongoing investigations?,"MATCH (x0:Officer WHERE x0.rank = ""Inspector"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")
RETURN x0","[Officer] = Inspector
[Crime] = Under investigation
Who are the Inspectors working on ongoing investigations?",Who are the [x0.Officer.rank:Inspector] working on [x1.Crime.last_outcome:Under investigation]?,"x0.Officer.rank:Inspector = Inspectors
x1.Crime.last_outcome:Under investigation = ongoing investigations",2,57,entity_set,673
3174,What are the ranks of officers who investigated crimes with Vanquish S model vehicles?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Vanquish S"")
RETURN x0.rank","[Vehicle] = Vanquish S
What are the ranks of officers who investigated crimes with Vanquish S model vehicles?",What are the ranks of officers who investigated crimes with [x2.Vehicle.model:Vanquish S] model vehicles?,x2.Vehicle.model:Vanquish S = Vanquish S,3,19,attribute_set,1
1043,What's the number of Christophers residing with Amys?,"MATCH (x0:Person WHERE x0.name = ""Christopher"")-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Amy"")
RETURN COUNT(DISTINCT x0)","[Person] = Christopher
[Person] = Amy
What's the number of Christophers residing with Amys?",What's the number of [x0.Person.name:Christopher] residing with [x1.Person.name:Amy]?,"x0.Person.name:Christopher = Christophers
x1.Person.name:Amy = Amys",2,138,count,1
4397,What is the number of crimes that include both a vehicle and a person?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle)
MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person)
RETURN COUNT(DISTINCT x0)",What is the number of crimes that include both a vehicle and a person?,What is the number of crimes that include both a vehicle and a person?,,3,5,count,1
814,What is the number of individuals participating in crimes on 30/08/2017?,"MATCH (x0:Person)-[:PARTY_TO]-(x1:Crime WHERE x1.date = ""30/08/2017"")
RETURN COUNT(DISTINCT x0)","[Crime] = 30/08/2017
What is the number of individuals participating in crimes on 30/08/2017?",What is the number of individuals participating in crimes on [x1.Crime.date:30/08/2017]?,x1.Crime.date:30/08/2017 = 30/08/2017,2,108,count,1
2140,"On August 16, 2017, how many phones were contacted?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""16/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 16/08/2017
On August 16, 2017, how many phones were contacted?","On [x1.PhoneCall.call_date:16/08/2017], how many phones were contacted?","x1.PhoneCall.call_date:16/08/2017 = August 16, 2017",2,289,count,1
90,Can you provide the ages of those living with a person whose last name is Austin?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0.age","[Person] = Austin
Can you provide the ages of those living with a person whose last name is Austin?",Can you provide the ages of those living with a person whose last name is [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,11,attribute_set,4
3568,At which address did crimes occur that involved someone named Brian?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0.address","[Person] = Brian
At which address did crimes occur that involved someone named Brian?",At which address did crimes occur that involved someone named [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,115,attribute_set,4
1903,How many cars from 2001 were implicated in crimes on 21/08/2017?,"MATCH (x0:Vehicle WHERE x0.year = ""2001"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""21/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
[Crime] = 21/08/2017
How many cars from 2001 were implicated in crimes on 21/08/2017?",How many cars from [x0.Vehicle.year:2001] were implicated in crimes on [x1.Crime.date:21/08/2017]?,"x0.Vehicle.year:2001 = 2001
x1.Crime.date:21/08/2017 = 21/08/2017",2,253,count,1
3403,Can you provide the dates of offenses linked to someone living with a Murray?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""Murray"")
RETURN x0.date","[Person] = Murray
Can you provide the dates of offenses linked to someone living with a Murray?",Can you provide the dates of offenses linked to someone living with a [x2.Person.surname:Murray]?,x2.Person.surname:Murray = Murray,3,55,attribute_set,3
3608,"What locations in area code OL11 had crimes with the status ""Investigation complete; no suspect identified""?","MATCH (x0:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.last_outcome = ""Investigation complete; no suspect identified"")
MATCH (x0:Location)-[:LOCATION_IN_AREA]-(x1:Area WHERE x1.areaCode = ""OL11"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Area] = OL11
What locations in area code OL11 had crimes with the status ""Investigation complete; no suspect identified""?","What locations in area code [x1.Area.areaCode:OL11] had crimes with the status ""[x2.Crime.last_outcome:Investigation complete; no suspect identified]""?","x1.Area.areaCode:OL11 = OL11
x2.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified",3,144,entity_set,256
983,How often were Amanti model vehicles used in crimes?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Amanti"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Amanti
How often were Amanti model vehicles used in crimes?",How often were [x1.Vehicle.model:Amanti] model vehicles used in crimes?,x1.Vehicle.model:Amanti = Amanti,2,128,count,1
462,Could you list the emails of individuals who share a home with anyone with last name George?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.surname = ""George"")
RETURN x0","[Person] = George
Could you list the emails of individuals who share a home with anyone with last name George?",Could you list the emails of individuals who share a home with anyone with last name [x2.Person.surname:George]?,x2.Person.surname:George = George,3,60,entity_set,2
4379,What are the types of the crimes that occurred on 7/08/2017 involving a friend of the person with NHS number 804-54-6976?,"MATCH (x0:Crime WHERE x0.date = ""7/08/2017"")-[:PARTY_TO]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""804-54-6976"")
RETURN x0.type","[Crime] = 7/08/2017
[Person] = 804-54-6976
What are the types of the crimes that occurred on 7/08/2017 involving a friend of the person with NHS number 804-54-6976?",What are the types of the crimes that occurred on [x0.Crime.date:7/08/2017] involving a friend of the person with NHS number [x2.Person.nhs_no:804-54-6976]?,"x0.Crime.date:7/08/2017 = 7/08/2017
x2.Person.nhs_no:804-54-6976 = 804-54-6976",3,1,attribute_set,2
644,Who is the oldest relative of anyone acquainted with a Ford's contact number?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.surname = ""Ford"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Ford
Who is the oldest relative of anyone acquainted with a Ford's contact number?",Who is the oldest relative of anyone acquainted with a [x2.Person.surname:Ford]'s contact number?,x2.Person.surname:Ford = Ford,3,86,max,1
1780,"Which crimes, labeled as ""Investigation complete; no suspect identified,"" occurred at sites with the postcode M1 5DA?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M1 5DA"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Location] = M1 5DA
Which crimes, labeled as ""Investigation complete; no suspect identified,"" occurred at sites with the postcode M1 5DA?","Which crimes, labeled as ""[x0.Crime.last_outcome:Investigation complete; no suspect identified],"" occurred at sites with the postcode [x1.Location.postcode:M1 5DA]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:M1 5DA = M1 5DA",2,236,entity_set,16
206,How many crimes on 4/08/2017 were investigated by officers?,"MATCH (x0:Crime WHERE x0.date = ""4/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)","[Crime] = 4/08/2017
How many crimes on 4/08/2017 were investigated by officers?",How many crimes on [x0.Crime.date:4/08/2017] were investigated by officers?,x0.Crime.date:4/08/2017 = 4/08/2017,2,25,count,1
2691,Can you list the areas where individuals with the surname Franklin reside?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person WHERE x2.surname = ""Franklin"")
RETURN x0","[Person] = Franklin
Can you list the areas where individuals with the surname Franklin reside?",Can you list the areas where individuals with the surname [x2.Person.surname:Franklin] reside?,x2.Person.surname:Franklin = Franklin,3,389,entity_set,3
3577,Can you name the surnames of friends of Annie who is connected to a crime?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.name = ""Annie"")-[:PARTY_TO]-(x2:Crime)
RETURN x0.surname","[Person] = Annie
Can you name the surnames of friends of Annie who is connected to a crime?",Can you name the surnames of friends of [x1.Person.name:Annie] who is connected to a crime?,x1.Person.name:Annie = Annie,3,119,attribute_set,7
2496,How many individuals own a phone?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone)
RETURN COUNT(DISTINCT x0)",How many individuals own a phone?,How many individuals own a phone?,,2,346,count,1
2123,"How many Sergeants looked into crimes on August 3, 2017?","MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""3/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Crime] = 3/08/2017
How many Sergeants looked into crimes on August 3, 2017?",How many [x0.Officer.rank:Sergeant] looked into crimes on [x1.Crime.date:3/08/2017]?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.date:3/08/2017 = August 3, 2017",2,286,count,1
179,How many Andrews have the phone number of someone with the last name Johnston?,"MATCH (x0:Person WHERE x0.name = ""Andrew"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Johnston"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrew
[Person] = Johnston
How many Andrews have the phone number of someone with the last name Johnston?",How many [x0.Person.name:Andrew] have the phone number of someone with the last name [x1.Person.surname:Johnston]?,"x0.Person.name:Andrew = Andrews
x1.Person.surname:Johnston = Johnston",2,22,count,1
2289,What is the most recent date of a crime at 197 Mason Street that involved a person with surname George?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""George"")
MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""197 Mason Street"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Person] = George
[Location] = 197 Mason Street
What is the most recent date of a crime at 197 Mason Street that involved a person with surname George?",What is the most recent date of a crime at [x1.Location.address:197 Mason Street] that involved a person with surname [x2.Person.surname:George]?,"x1.Location.address:197 Mason Street = 197 Mason Street
x2.Person.surname:George = George",3,309,argmax,1
1957,How often are Commander model vehicles used in crimes?,"MATCH (x0:Vehicle WHERE x0.model = ""Commander"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = Commander
How often are Commander model vehicles used in crimes?",How often are [x0.Vehicle.model:Commander] model vehicles used in crimes?,x0.Vehicle.model:Commander = Commander,2,260,count,1
421,What are the residence of people with surname Butler in locations with BL9 6BE postcode?,"MATCH (x0:Location WHERE x0.postcode = ""BL9 6BE"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.surname = ""Butler"")
RETURN x0","[Location] = BL9 6BE
[Person] = Butler
What are the residence of people with surname Butler in locations with BL9 6BE postcode?",What are the residence of people with surname [x1.Person.surname:Butler] in locations with [x0.Location.postcode:BL9 6BE] postcode?,"x0.Location.postcode:BL9 6BE = BL9 6BE
x1.Person.surname:Butler = Butler",2,55,entity_set,1
891,Which people have family ties to those with the surname Austin?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Austin"")
RETURN x0","[Person] = Austin
Which people have family ties to those with the surname Austin?",Which people have family ties to those with the surname [x1.Person.surname:Austin]?,x1.Person.surname:Austin = Austin,2,117,entity_set,4
2559,When did the first crime occur that included a Coupe GT and a person with the surname Black?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Black"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Coupe GT"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Black
[Vehicle] = Coupe GT
When did the first crime occur that included a Coupe GT and a person with the surname Black?",When did the first crime occur that included a [x1.Vehicle.model:Coupe GT] and a person with the surname [x2.Person.surname:Black]?,"x1.Vehicle.model:Coupe GT = Coupe GT
x2.Person.surname:Black = Black",3,358,min,1
3632,Who are the individuals residing with someone acquainted with a person with last name Washington?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.surname = ""Washington"")
RETURN x0","[Person] = Washington
Who are the individuals residing with someone acquainted with a person with last name Washington?",Who are the individuals residing with someone acquainted with a person with last name [x2.Person.surname:Washington]?,x2.Person.surname:Washington = Washington,3,151,entity_set,2
1971,How many 01:39 calls went to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""01:39"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 01:39
How many 01:39 calls went to any phone?",How many [x0.PhoneCall.call_time:01:39] calls went to any phone?,x0.PhoneCall.call_time:01:39 = 01:39,2,265,count,1
4605,Can you provide the phones of those who are friends with Brian?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0","[Person] = Brian
Can you provide the phones of those who are friends with Brian?",Can you provide the phones of those who are friends with [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,71,entity_set,9
848,Can you provide a list of crimes associated with Kia cars?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Kia"")
RETURN x0","[Vehicle] = Kia
Can you provide a list of crimes associated with Kia cars?",Can you provide a list of crimes associated with [x1.Vehicle.make:Kia] cars?,x1.Vehicle.make:Kia = Kia,2,112,entity_set,17
