id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
1817,How many vehicle crimes involve individuals with last name Moore?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Moore"")
RETURN COUNT(DISTINCT x0)","[Crime] = Vehicle crime
[Person] = Moore
How many vehicle crimes involve individuals with last name Moore?",How many [x0.Crime.type:Vehicle crime] involve individuals with last name [x1.Person.surname:Moore]?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Person.surname:Moore = Moore",2,241,count,1
3649,How many offenses took place where people live?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:CURRENT_ADDRESS]-(x2:Person)
RETURN COUNT(DISTINCT x0)",How many offenses took place where people live?,How many offenses took place where people live?,,3,158,count,1
1559,How many 2001 vehicles are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""2001"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2001
How many 2001 vehicles are linked to crimes?",How many [x0.Vehicle.year:2001] vehicles are linked to crimes?,x0.Vehicle.year:2001 = 2001,2,207,count,1
3461,What is the first call received by a person named Stephen?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Stephen"")
RETURN x0
ORDER BY x0.call_time ASC
LIMIT 1","[Person] = Stephen
What is the first call received by a person named Stephen?",What is the first call received by a person named [x2.Person.name:Stephen]?,x2.Person.name:Stephen = Stephen,3,82,min,1
2399,What is the earliest crime involving a Williamson and a Continental Mark VII?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x2:Vehicle WHERE x2.model = ""Continental Mark VII"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Vehicle] = Continental Mark VII
[Person] = Williamson
What is the earliest crime involving a Williamson and a Continental Mark VII?",What is the earliest crime involving a [x1.Person.surname:Williamson] and a [x2.Vehicle.model:Continental Mark VII]?,"x1.Person.surname:Williamson = Williamson
x2.Vehicle.model:Continental Mark VII = Continental Mark VII",3,331,min,1
22,How many sites with the postal code M7 2GE were crime scenes?,"MATCH (x0:Location WHERE x0.postcode = ""M7 2GE"")-[:OCCURRED_AT]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Location] = M7 2GE
How many sites with the postal code M7 2GE were crime scenes?",How many sites with the postal code [x0.Location.postcode:M7 2GE] were crime scenes?,x0.Location.postcode:M7 2GE = M7 2GE,2,3,count,1
1888,What phones completed a call of 34 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""34"")
RETURN x0","[PhoneCall] = 34
What phones completed a call of 34 seconds?",What phones completed a call of [x1.PhoneCall.call_duration:34] seconds?,x1.PhoneCall.call_duration:34 = 34,2,252,entity_set,10
3122,How long were the calls on 06/08/2017 for phones that placed calls on 23/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""06/08/2017"")-[:CALLED]-(x1:Phone)-[:CALLER]-(x2:PhoneCall WHERE x2.call_date = ""23/08/2017"")
RETURN x0.call_duration","[PhoneCall] = 06/08/2017
[PhoneCall] = 23/08/2017
How long were the calls on 06/08/2017 for phones that placed calls on 23/08/2017?",How long were the calls on [x0.PhoneCall.call_date:06/08/2017] for phones that placed calls on [x2.PhoneCall.call_date:23/08/2017]?,"x0.PhoneCall.call_date:06/08/2017 = 06/08/2017
x2.PhoneCall.call_date:23/08/2017 = 23/08/2017",3,11,attribute_set,2
1768,Can you name the areas related to postcode M45 8SG?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""M45 8SG"")
RETURN x0","[PostCode] = M45 8SG
Can you name the areas related to postcode M45 8SG?",Can you name the areas related to postcode [x1.PostCode.code:M45 8SG]?,x1.PostCode.code:M45 8SG = M45 8SG,2,234,entity_set,1
3387,Which vehicle brands were linked to a crime at the address with postcode M3 1SQ?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""M3 1SQ"")
RETURN x0.make","[Location] = M3 1SQ
Which vehicle brands were linked to a crime at the address with postcode M3 1SQ?",Which vehicle brands were linked to a crime at the address with postcode [x2.Location.postcode:M3 1SQ]?,x2.Location.postcode:M3 1SQ = M3 1SQ,3,54,attribute_set,3
1022,What is the most recent date a crime happened at an address with BL6 4HY?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""BL6 4HY"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = BL6 4HY
What is the most recent date a crime happened at an address with BL6 4HY?",What is the most recent date a crime happened at an address with [x2.PostCode.code:BL6 4HY]?,x2.PostCode.code:BL6 4HY = BL6 4HY,3,135,argmax,1
1962,What is the number of phones owned by the individual with NHS number 450-68-4090?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.nhs_no = ""450-68-4090"")
RETURN COUNT(DISTINCT x0)","[Person] = 450-68-4090
What is the number of phones owned by the individual with NHS number 450-68-4090?",What is the number of phones owned by the individual with NHS number [x1.Person.nhs_no:450-68-4090]?,x1.Person.nhs_no:450-68-4090 = 450-68-4090,2,263,count,1
2453,How many individuals reside with someone with last name Martinez?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.surname = ""Martinez"")
RETURN COUNT(DISTINCT x0)","[Person] = Martinez
How many individuals reside with someone with last name Martinez?",How many individuals reside with someone with last name [x1.Person.surname:Martinez]?,x1.Person.surname:Martinez = Martinez,2,338,count,1
3351,Can you provide the email addresses for residents of the OL2 5RB postcode?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""OL2 5RB"")
RETURN x0.email_address","[Location] = OL2 5RB
Can you provide the email addresses for residents of the OL2 5RB postcode?",Can you provide the email addresses for residents of the [x2.Location.postcode:OL2 5RB] postcode?,x2.Location.postcode:OL2 5RB = OL2 5RB,3,45,attribute_set,1
515,What is the count of crimes with the status 'Investigation complete; no suspect identified' at places with post code M2 4JQ?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""M2 4JQ"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Location] = M2 4JQ
What is the count of crimes with the status 'Investigation complete; no suspect identified' at places with post code M2 4JQ?",What is the count of crimes with the status '[x0.Crime.last_outcome:Investigation complete; no suspect identified]' at places with post code [x1.Location.postcode:M2 4JQ]?,"x0.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x1.Location.postcode:M2 4JQ = M2 4JQ",2,67,count,1
294,Can you provide a list of violent and sexual offences at 183 Naylor Street?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""183 Naylor Street"")
RETURN x0","[Crime] = Violence and sexual offences
[Location] = 183 Naylor Street
Can you provide a list of violent and sexual offences at 183 Naylor Street?",Can you provide a list of [x0.Crime.type:Violence and sexual offences] at [x1.Location.address:183 Naylor Street]?,"x0.Crime.type:Violence and sexual offences = violent and sexual offences 
x1.Location.address:183 Naylor Street = 183 Naylor Street",2,37,entity_set,1
58,Who does anyone named Bonnie know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.name = ""Bonnie"")
RETURN x0","[Person] = Bonnie
Who does anyone named Bonnie know?",Who does anyone named [x1.Person.name:Bonnie] know?,x1.Person.name:Bonnie = Bonnie,2,7,entity_set,14
2977,What is the date of the first offense linked to the email npayneau@craigslist.org?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_EMAIL]-(x2:Email WHERE x2.email_address = ""npayneau@craigslist.org"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Email] = npayneau@craigslist.org
What is the date of the first offense linked to the email npayneau@craigslist.org?",What is the date of the first offense linked to the email [x2.Email.email_address:npayneau@craigslist.org]?,x2.Email.email_address:npayneau@craigslist.org = npayneau@craigslist.org,3,431,argmin,1
2122,How many Police Constables were involved in investigating crimes on 31/08/2017?,"MATCH (x0:Officer WHERE x0.rank = ""Police Constable"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""31/08/2017"")
RETURN COUNT(DISTINCT x0)","[Officer] = Police Constable
[Crime] = 31/08/2017
How many Police Constables were involved in investigating crimes on 31/08/2017?",How many [x0.Officer.rank:Police Constable] were involved in investigating crimes on [x1.Crime.date:31/08/2017]?,"x0.Officer.rank:Police Constable = Police Constables
x1.Crime.date:31/08/2017 = 31/08/2017",2,286,count,1
113,How many Lillians know someone with the last name Cunningham?,"MATCH (x0:Person WHERE x0.name = ""Lillian"")-[:KNOWS]-(x1:Person WHERE x1.surname = ""Cunningham"")
RETURN COUNT(DISTINCT x0)","[Person] = Lillian
[Person] = Cunningham
How many Lillians know someone with the last name Cunningham?",How many [x0.Person.name:Lillian] know someone with the last name [x1.Person.surname:Cunningham]?,"x0.Person.name:Lillian = Lillians
x1.Person.surname:Cunningham = Cunningham",2,13,count,1
1188,Which areas with the postcode OL3 5HP are associated with crimes that concluded with no suspect identified?,"MATCH (x0:Location WHERE x0.postcode = ""OL3 5HP"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")
RETURN x0","[Location] = OL3 5HP
[Crime] = Investigation complete; no suspect identified
Which areas with the postcode OL3 5HP are associated with crimes that concluded with no suspect identified?",Which areas with the postcode [x0.Location.postcode:OL3 5HP] are associated with crimes that [x1.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Location.postcode:OL3 5HP = OL3 5HP
x1.Crime.last_outcome:Investigation complete; no suspect identified = concluded with no suspect identified",2,158,entity_set,1
1098,Can you tell me the call count for 3-(965)714-5374?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""3-(965)714-5374"")
RETURN COUNT(DISTINCT x0)","[Phone] = 3-(965)714-5374
Can you tell me the call count for 3-(965)714-5374?",Can you tell me the call count for [x1.Phone.phoneNo:3-(965)714-5374]?,x1.Phone.phoneNo:3-(965)714-5374 = 3-(965)714-5374,2,145,count,1
3047,What is the latest incident involving offenders from 17/08/2017?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:PARTY_TO]-(x2:Crime WHERE x2.date = ""17/08/2017"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Crime] = 17/08/2017
What is the latest incident involving offenders from 17/08/2017?",What is the latest incident involving offenders from [x2.Crime.date:17/08/2017]?,x2.Crime.date:17/08/2017 = 17/08/2017,3,444,max,1
1683,Which offenses linked to the B-Series model have been closed with no suspect found?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""B-Series"")
RETURN x0","[Crime] = Investigation complete; no suspect identified
[Vehicle] = B-Series
Which offenses linked to the B-Series model have been closed with no suspect found?",Which offenses linked to the [x1.Vehicle.model:B-Series] model have been [x0.Crime.last_outcome:Investigation complete; no suspect identified]?,"x0.Crime.last_outcome:Investigation complete; no suspect identified = closed with no suspect found 
x1.Vehicle.model:B-Series = B-Series",2,221,entity_set,3
2866,How many cases involving a person surnamed Williamson are handled by Sergeants?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.rank = ""Sergeant"")
MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN COUNT(DISTINCT x0)","[Officer] = Sergeant
[Person] = Williamson
How many cases involving a person surnamed Williamson are handled by Sergeants?",How many cases involving a person surnamed [x1.Person.surname:Williamson] are handled by [x2.Officer.rank:Sergeant]?,"x1.Person.surname:Williamson = Williamson
x2.Officer.rank:Sergeant = Sergeants",3,416,count,1
1103,Can you provide a list of places in M40 1RY linked to violence and sexual offences?,"MATCH (x0:Location WHERE x0.postcode = ""M40 1RY"")-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")
RETURN x0","[Location] = M40 1RY
[Crime] = Violence and sexual offences
Can you provide a list of places in M40 1RY linked to violence and sexual offences?",Can you provide a list of places in [x0.Location.postcode:M40 1RY] linked to [x1.Crime.type:Violence and sexual offences]?,"x0.Location.postcode:M40 1RY = M40 1RY
x1.Crime.type:Violence and sexual offences = violence and sexual offences",2,146,entity_set,2
2852,"How many offenses, closed with no suspect identified, involve individuals related to someone with surname Martin?","MATCH (x0:Crime WHERE x0.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Martin"")
RETURN COUNT(DISTINCT x0)","[Crime] = Investigation complete; no suspect identified
[Person] = Martin
How many offenses, closed with no suspect identified, involve individuals related to someone with surname Martin?","How many offenses, [x0.Crime.last_outcome:Investigation complete; no suspect identified], involve individuals related to someone with surname [x2.Person.surname:Martin]?","x0.Crime.last_outcome:Investigation complete; no suspect identified = closed with no suspect identified 
x2.Person.surname:Martin = Martin",3,415,count,1
3545,What are the dates of violence and sexual offences in the M14 area?,"MATCH (x0:Crime WHERE x0.type = ""Violence and sexual offences"")-[:OCCURRED_AT]-(x1:Location)-[:LOCATION_IN_AREA]-(x2:Area WHERE x2.areaCode = ""M14"")
RETURN x0.date","[Crime] = Violence and sexual offences
[Area] = M14
What are the dates of violence and sexual offences in the M14 area?",What are the dates of [x0.Crime.type:Violence and sexual offences] in the [x2.Area.areaCode:M14] area?,"x0.Crime.type:Violence and sexual offences = violence and sexual offences
x2.Area.areaCode:M14 = M14",3,111,attribute_set,144
749,Can you provide the places with the postcode OL10 2JL where a person named Raymond resides?,"MATCH (x0:Location WHERE x0.postcode = ""OL10 2JL"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.name = ""Raymond"")
RETURN x0","[Location] = OL10 2JL
[Person] = Raymond
Can you provide the places with the postcode OL10 2JL where a person named Raymond resides?",Can you provide the places with the postcode [x0.Location.postcode:OL10 2JL] where a person named [x1.Person.name:Raymond] resides?,"x0.Location.postcode:OL10 2JL = OL10 2JL
x1.Person.name:Raymond = Raymond",2,99,entity_set,1
3272,What is the phone number of a friend of the person with the NHS number 306-99-5229?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.nhs_no = ""306-99-5229"")
RETURN x0.phoneNo","[Person] = 306-99-5229
What is the phone number of a friend of the person with the NHS number 306-99-5229?",What is the phone number of a friend of the person with the NHS number [x2.Person.nhs_no:306-99-5229]?,x2.Person.nhs_no:306-99-5229 = 306-99-5229,3,35,attribute_set,1
1866,What is the number of phones owned by individuals with the surname Oliver?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Oliver"")
RETURN COUNT(DISTINCT x0)","[Person] = Oliver
What is the number of phones owned by individuals with the surname Oliver?",What is the number of phones owned by individuals with the surname [x1.Person.surname:Oliver]?,x1.Person.surname:Oliver = Oliver,2,249,count,1
2556,What is the first crime involving an F150 and a person with the surname Kelly?,"MATCH (x0:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Kelly"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""F150"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Kelly
[Vehicle] = F150
What is the first crime involving an F150 and a person with the surname Kelly?",What is the first crime involving an [x1.Vehicle.model:F150] and a person with the surname [x2.Person.surname:Kelly]?,"x1.Vehicle.model:F150 = F150
x2.Person.surname:Kelly = Kelly",3,358,min,1
4423,In which address does the person with the phone number 7-(727)924-9245 live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""7-(727)924-9245"")
RETURN x0.address","[Phone] = 7-(727)924-9245
In which address does the person with the phone number 7-(727)924-9245 live?",In which address does the person with the phone number [x2.Phone.phoneNo:7-(727)924-9245] live?,x2.Phone.phoneNo:7-(727)924-9245 = 7-(727)924-9245,3,16,attribute_set,1
3084,What vehicles are linked to crimes involving individuals with NHS number 879-22-8665?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""879-22-8665"")
RETURN x0","[Person] = 879-22-8665
What vehicles are linked to crimes involving individuals with NHS number 879-22-8665?",What vehicles are linked to crimes involving individuals with NHS number [x2.Person.nhs_no:879-22-8665]?,x2.Person.nhs_no:879-22-8665 = 879-22-8665,3,6,entity_set,1
1753,What number of crimes involved vehicles from 2002?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.year = ""2002"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2002
What number of crimes involved vehicles from 2002?",What number of crimes involved vehicles from [x1.Vehicle.year:2002]?,x1.Vehicle.year:2002 = 2002,2,233,count,1
865,How many individuals does someone with last name George know?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""George"")
RETURN COUNT(DISTINCT x0)","[Person] = George
How many individuals does someone with last name George know?",How many individuals does someone with last name [x1.Person.surname:George] know?,x1.Person.surname:George = George,2,114,count,1
796,What is the number of crimes on 24/08/2017 in places with post code SK14 4DP?,"MATCH (x0:Crime WHERE x0.date = ""24/08/2017"")-[:OCCURRED_AT]-(x1:Location WHERE x1.postcode = ""SK14 4DP"")
RETURN COUNT(DISTINCT x0)","[Crime] = 24/08/2017
[Location] = SK14 4DP
What is the number of crimes on 24/08/2017 in places with post code SK14 4DP?",What is the number of crimes on [x0.Crime.date:24/08/2017] in places with post code [x1.Location.postcode:SK14 4DP]?,"x0.Crime.date:24/08/2017 = 24/08/2017
x1.Location.postcode:SK14 4DP = SK14 4DP",2,104,count,1
3083,Can you identify the vehicles tied to crimes involving the individual with NHS number 247-72-6304?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
Can you identify the vehicles tied to crimes involving the individual with NHS number 247-72-6304?",Can you identify the vehicles tied to crimes involving the individual with NHS number [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,6,entity_set,1
2752,Where can I find the emails of people who know someone with NHS number 247-72-6304?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""247-72-6304"")
RETURN x0","[Person] = 247-72-6304
Where can I find the emails of people who know someone with NHS number 247-72-6304?",Where can I find the emails of people who know someone with NHS number [x2.Person.nhs_no:247-72-6304]?,x2.Person.nhs_no:247-72-6304 = 247-72-6304,3,398,entity_set,4
297,Which criminal damage and arson crimes took place at 47 Raynham Street?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""47 Raynham Street"")
RETURN x0","[Crime] = Criminal damage and arson
[Location] = 47 Raynham Street
Which criminal damage and arson crimes took place at 47 Raynham Street?",Which [x0.Crime.type:Criminal damage and arson] crimes took place at [x1.Location.address:47 Raynham Street]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Location.address:47 Raynham Street = 47 Raynham Street",2,37,entity_set,1
4532,What is the first crime involving a family member of someone named Henry?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.name = ""Henry"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Person] = Henry
What is the first crime involving a family member of someone named Henry?",What is the first crime involving a family member of someone named [x2.Person.name:Henry]?,x2.Person.name:Henry = Henry,3,51,max,1
3432,What's the length of the longest call Diane received?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.name = ""Diane"")
RETURN x0.call_time
ORDER BY x0.call_time DESC
LIMIT 1","[Person] = Diane
What's the length of the longest call Diane received?",What's the length of the longest call [x2.Person.name:Diane] received?,x2.Person.name:Diane = Diane,3,66,argmax,1
1124,What date marks the initial crime at the Petrol Station?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Location] = Petrol Station
What date marks the initial crime at the Petrol Station?",What date marks the initial crime at the [x1.Location.address:Petrol Station]?,x1.Location.address:Petrol Station = Petrol Station,2,149,argmin,1
2736,Who is the oldest relative of a person who is friends with someone with the last name Duncan?,"MATCH (x0:Person)-[:FAMILY_REL]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.surname = ""Duncan"")
RETURN x0
ORDER BY x0.age DESC
LIMIT 1","[Person] = Duncan
Who is the oldest relative of a person who is friends with someone with the last name Duncan?",Who is the oldest relative of a person who is friends with someone with the last name [x2.Person.surname:Duncan]?,x2.Person.surname:Duncan = Duncan,3,396,max,1
3363,In how many places with violent or sexual offenses were people named Andrea involved?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.type = ""Violence and sexual offences"")-[:PARTY_TO]-(x2:Person WHERE x2.name = ""Andrea"")
RETURN COUNT(DISTINCT x0)","[Crime] = Violence and sexual offences
[Person] = Andrea
In how many places with violent or sexual offenses were people named Andrea involved?",In how many places with [x1.Crime.type:Violence and sexual offences] were people named [x2.Person.name:Andrea] involved?,"x1.Crime.type:Violence and sexual offences = violent or sexual offenses 
x2.Person.name:Andrea = Andrea",3,47,count,1
2054,How many thefts from individuals happened at 36 Sackville Street?,"MATCH (x0:Crime WHERE x0.type = ""Theft from the person"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""36 Sackville Street"")
RETURN COUNT(DISTINCT x0)","[Crime] = Theft from the person
[Location] = 36 Sackville Street
How many thefts from individuals happened at 36 Sackville Street?",How many [x0.Crime.type:Theft from the person] happened at [x1.Location.address:36 Sackville Street]?,"x0.Crime.type:Theft from the person = thefts from individuals 
x1.Location.address:36 Sackville Street = 36 Sackville Street",2,276,count,1
4598,What are the phones of Brenda's friends?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:KNOWS_SN]-(x2:Person WHERE x2.name = ""Brenda"")
RETURN x0","[Person] = Brenda
What are the phones of Brenda's friends?",What are the phones of [x2.Person.name:Brenda]'s friends?,x2.Person.name:Brenda = Brenda,3,71,entity_set,8
1215,How many owns the phone number 5-(711)674-4929?,"MATCH (x0:Person)-[:HAS_PHONE]-(x1:Phone WHERE x1.phoneNo = ""5-(711)674-4929"")
RETURN COUNT(DISTINCT x0)","[Phone] = 5-(711)674-4929
How many owns the phone number 5-(711)674-4929?",How many owns the phone number [x1.Phone.phoneNo:5-(711)674-4929]?,x1.Phone.phoneNo:5-(711)674-4929 = 5-(711)674-4929,2,162,count,1
180,How many individuals named Andrew possess the contact number of a Johnston?,"MATCH (x0:Person WHERE x0.name = ""Andrew"")-[:KNOWS_PHONE]-(x1:Person WHERE x1.surname = ""Johnston"")
RETURN COUNT(DISTINCT x0)","[Person] = Andrew
[Person] = Johnston
How many individuals named Andrew possess the contact number of a Johnston?",How many individuals named [x0.Person.name:Andrew] possess the contact number of a [x1.Person.surname:Johnston]?,"x0.Person.name:Andrew = Andrew
x1.Person.surname:Johnston = Johnston",2,22,count,1
2023,Which post codes fall under the M41 area code?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M41"")
RETURN x0","[Area] = M41
Which post codes fall under the M41 area code?",Which post codes fall under the [x1.Area.areaCode:M41] area code?,x1.Area.areaCode:M41 = M41,2,272,entity_set,154
476,Can you show me the calls that came in to 1-(963)530-6466?,"MATCH (x0:PhoneCall)-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(963)530-6466"")
RETURN x0","[Phone] = 1-(963)530-6466
Can you show me the calls that came in to 1-(963)530-6466?",Can you show me the calls that came in to [x1.Phone.phoneNo:1-(963)530-6466]?,x1.Phone.phoneNo:1-(963)530-6466 = 1-(963)530-6466,2,62,entity_set,2
88,Which Roses can be reached via rcrawford3y@wunderground.com?,"MATCH (x0:Person WHERE x0.name = ""Rose"")-[:HAS_EMAIL]-(x1:Email WHERE x1.email_address = ""rcrawford3y@wunderground.com"")
RETURN x0","[Person] = Rose
[Email] = rcrawford3y@wunderground.com
Which Roses can be reached via rcrawford3y@wunderground.com?",Which [x0.Person.name:Rose] can be reached via [x1.Email.email_address:rcrawford3y@wunderground.com]?,"x0.Person.name:Rose = Roses
x1.Email.email_address:rcrawford3y@wunderground.com = rcrawford3y@wunderground.com",2,10,entity_set,1
1127,"On 08/08/2017, how many calls were made to 1-(651)511-7559?","MATCH (x0:PhoneCall WHERE x0.call_date = ""08/08/2017"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""1-(651)511-7559"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 08/08/2017
[Phone] = 1-(651)511-7559
On 08/08/2017, how many calls were made to 1-(651)511-7559?","On [x0.PhoneCall.call_date:08/08/2017], how many calls were made to [x1.Phone.phoneNo:1-(651)511-7559]?","x0.PhoneCall.call_date:08/08/2017 = 08/08/2017
x1.Phone.phoneNo:1-(651)511-7559 = 1-(651)511-7559",2,150,count,1
1562,How many 1996 vehicles are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""1996"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1996
How many 1996 vehicles are linked to crimes?",How many [x0.Vehicle.year:1996] vehicles are linked to crimes?,x0.Vehicle.year:1996 = 1996,2,207,count,1
3357,Can you provide the email addresses for residents of the WN1 1SE postcode?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:CURRENT_ADDRESS]-(x2:Location WHERE x2.postcode = ""WN1 1SE"")
RETURN x0.email_address","[Location] = WN1 1SE
Can you provide the email addresses for residents of the WN1 1SE postcode?",Can you provide the email addresses for residents of the [x2.Location.postcode:WN1 1SE] postcode?,x2.Location.postcode:WN1 1SE = WN1 1SE,3,45,attribute_set,1
1086,How many phones had a call duration of 66 seconds?,"MATCH (x0:Phone)-[:CALLER]-(x1:PhoneCall WHERE x1.call_duration = ""66"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 66
How many phones had a call duration of 66 seconds?",How many phones had a call duration of [x1.PhoneCall.call_duration:66] seconds?,x1.PhoneCall.call_duration:66 = 66,2,144,count,1
1863,What is the number of phones owned by individuals with the surname Frazier?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Frazier"")
RETURN COUNT(DISTINCT x0)","[Person] = Frazier
What is the number of phones owned by individuals with the surname Frazier?",What is the number of phones owned by individuals with the surname [x1.Person.surname:Frazier]?,x1.Person.surname:Frazier = Frazier,2,249,count,1
2138,"What is the number of phones that got a call on August 16, 2017?","MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""16/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 16/08/2017
What is the number of phones that got a call on August 16, 2017?",What is the number of phones that got a call on [x1.PhoneCall.call_date:16/08/2017]?,"x1.PhoneCall.call_date:16/08/2017 = August 16, 2017",2,289,count,1
3317,What are the surnames of individuals residing in areas where criminal damage and arson have taken place?,"MATCH (x0:Person)-[:CURRENT_ADDRESS]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.type = ""Criminal damage and arson"")
RETURN x0.surname","[Crime] = Criminal damage and arson
What are the surnames of individuals residing in areas where criminal damage and arson have taken place?",What are the surnames of individuals residing in areas where [x2.Crime.type:Criminal damage and arson] have taken place?,x2.Crime.type:Criminal damage and arson = criminal damage and arson,3,41,attribute_set,102
1556,How many 1989 vehicles are linked to crimes?,"MATCH (x0:Vehicle WHERE x0.year = ""1989"")-[:INVOLVED_IN]-(x1:Crime)
RETURN COUNT(DISTINCT x0)","[Vehicle] = 1989
How many 1989 vehicles are linked to crimes?",How many [x0.Vehicle.year:1989] vehicles are linked to crimes?,x0.Vehicle.year:1989 = 1989,2,207,count,1
3500,What most recent crime happened at postcode M6 7RB?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location)-[:HAS_POSTCODE]-(x2:PostCode WHERE x2.code = ""M6 7RB"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[PostCode] = M6 7RB
What most recent crime happened at postcode M6 7RB?",What most recent crime happened at postcode [x2.PostCode.code:M6 7RB]?,x2.PostCode.code:M6 7RB = M6 7RB,3,103,max,1
3389,What brands of vehicles were involved in a crime at the location with postcode BL6 5RW?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime)-[:OCCURRED_AT]-(x2:Location WHERE x2.postcode = ""BL6 5RW"")
RETURN x0.make","[Location] = BL6 5RW
What brands of vehicles were involved in a crime at the location with postcode BL6 5RW?",What brands of vehicles were involved in a crime at the location with postcode [x2.Location.postcode:BL6 5RW]?,x2.Location.postcode:BL6 5RW = BL6 5RW,3,54,attribute_set,4
2617,How many cases does an officer handle?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer)
RETURN COUNT(DISTINCT x0)",How many cases does an officer handle?,How many cases does an officer handle?,,2,375,count,1
2843,What is the newest crime connected to someone with phone 1-(111)459-3206?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""1-(111)459-3206"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Phone] = 1-(111)459-3206
What is the newest crime connected to someone with phone 1-(111)459-3206?",What is the newest crime connected to someone with phone [x2.Phone.phoneNo:1-(111)459-3206]?,x2.Phone.phoneNo:1-(111)459-3206 = 1-(111)459-3206,3,414,max,1
2219,Which ES model vehicles were linked to crimes on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""ES"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN x0","[Vehicle] = ES
[Crime] = 11/08/2017
Which ES model vehicles were linked to crimes on 11/08/2017?",Which [x0.Vehicle.model:ES] model vehicles were linked to crimes on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.model:ES = ES
x1.Crime.date:11/08/2017 = 11/08/2017",2,299,entity_set,1
2139,How many devices were called on 16th August 2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""16/08/2017"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 16/08/2017
How many devices were called on 16th August 2017?",How many devices were called on [x1.PhoneCall.call_date:16/08/2017]?,x1.PhoneCall.call_date:16/08/2017 = 16th August 2017,2,289,count,1
