id,nl,mr,nl_gold_linked,nl_bracketed,entities,num_nodes,template_id,type,return_count
2061,Can you identify everyone familiar with a person whose last name is Boyd?,"MATCH (x0:Person)-[:KNOWS]-(x1:Person WHERE x1.surname = ""Boyd"")
RETURN x0","[Person] = Boyd
Can you identify everyone familiar with a person whose last name is Boyd?",Can you identify everyone familiar with a person whose last name is [x1.Person.surname:Boyd]?,x1.Person.surname:Boyd = Boyd,2,277,entity_set,10
2378,What area corresponds to the address Petrol Station?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.address = ""Petrol Station"")
RETURN x0","[Location] = Petrol Station
What area corresponds to the address Petrol Station?",What area corresponds to the address [x1.Location.address:Petrol Station]?,x1.Location.address:Petrol Station = Petrol Station,2,328,entity_set,124
2596,When was the initial crime investigation conducted by an officer with the surname Stutard?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Stutard"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Stutard
When was the initial crime investigation conducted by an officer with the surname Stutard?",When was the initial crime investigation conducted by an officer with the surname [x1.Officer.surname:Stutard]?,x1.Officer.surname:Stutard = Stutard,2,367,argmin,1
2943,What vehicle crimes happened at 129 George Street involving Escalade models?,"MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:OCCURRED_AT]-(x2:Location WHERE x2.address = ""129 George Street"")
MATCH (x0:Crime WHERE x0.type = ""Vehicle crime"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Escalade"")
RETURN x0","[Crime] = Vehicle crime
[Location] = 129 George Street
[Vehicle] = Escalade
What vehicle crimes happened at 129 George Street involving Escalade models?",What [x0.Crime.type:Vehicle crime] happened at [x2.Location.address:129 George Street] involving [x1.Vehicle.model:Escalade] models?,"x0.Crime.type:Vehicle crime = vehicle crimes
x1.Vehicle.model:Escalade = Escalade
x2.Location.address:129 George Street = 129 George Street",3,428,entity_set,1
2217,Can you identify E-Class cars connected to incidents on 7/08/2017?,"MATCH (x0:Vehicle WHERE x0.model = ""E-Class"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""7/08/2017"")
RETURN x0","[Vehicle] = E-Class
[Crime] = 7/08/2017
Can you identify E-Class cars connected to incidents on 7/08/2017?",Can you identify [x0.Vehicle.model:E-Class] cars connected to incidents on [x1.Crime.date:7/08/2017]?,"x0.Vehicle.model:E-Class = E-Class
x1.Crime.date:7/08/2017 = 7/08/2017",2,299,entity_set,1
260,"On 20/08/2017, how many crimes included a 2500 Club Coupe?","MATCH (x0:Crime WHERE x0.date = ""20/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""2500 Club Coupe"")
RETURN COUNT(DISTINCT x0)","[Crime] = 20/08/2017
[Vehicle] = 2500 Club Coupe
On 20/08/2017, how many crimes included a 2500 Club Coupe?","On [x0.Crime.date:20/08/2017], how many crimes included a [x1.Vehicle.model:2500 Club Coupe]?","x0.Crime.date:20/08/2017 = 20/08/2017
x1.Vehicle.model:2500 Club Coupe = 2500 Club Coupe",2,32,count,1
3472,What are the surnames of those whose phone numbers are linked to acquaintances of a person with NHS number 773-64-9939?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""773-64-9939"")
RETURN x0.surname","[Person] = 773-64-9939
What are the surnames of those whose phone numbers are linked to acquaintances of a person with NHS number 773-64-9939?",What are the surnames of those whose phone numbers are linked to acquaintances of a person with NHS number [x2.Person.nhs_no:773-64-9939]?,x2.Person.nhs_no:773-64-9939 = 773-64-9939,3,83,attribute_set,4
433,Which Sergeants investigated crimes marked as Unable to prosecute suspect?,"MATCH (x0:Officer WHERE x0.rank = ""Sergeant"")-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.last_outcome = ""Unable to prosecute suspect"")
RETURN x0","[Officer] = Sergeant
[Crime] = Unable to prosecute suspect
Which Sergeants investigated crimes marked as Unable to prosecute suspect?",Which [x0.Officer.rank:Sergeant] investigated crimes marked as [x1.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Officer.rank:Sergeant = Sergeants
x1.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect",2,57,entity_set,1752
1507,Which is the earliest crime involving individuals with surname Harper?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Harper"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Harper
Which is the earliest crime involving individuals with surname Harper?",Which is the earliest crime involving individuals with surname [x1.Person.surname:Harper]?,x1.Person.surname:Harper = Harper,2,200,min,1
3471,Can you identify the last names of individuals connected to phone numbers of people acquainted with someone holding NHS number 773-64-9939?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS]-(x2:Person WHERE x2.nhs_no = ""773-64-9939"")
RETURN x0.surname","[Person] = 773-64-9939
Can you identify the last names of individuals connected to phone numbers of people acquainted with someone holding NHS number 773-64-9939?",Can you identify the last names of individuals connected to phone numbers of people acquainted with someone holding NHS number [x2.Person.nhs_no:773-64-9939]?,x2.Person.nhs_no:773-64-9939 = 773-64-9939,3,83,attribute_set,4
4451,What are the email addresses of a person living with Brian?,"MATCH (x0:Email)-[:HAS_EMAIL]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Brian"")
RETURN x0.email_address","[Person] = Brian
What are the email addresses of a person living with Brian?",What are the email addresses of a person living with [x2.Person.name:Brian]?,x2.Person.name:Brian = Brian,3,29,attribute_set,4
3069,What phones are owned by individuals linked to a crime?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person)-[:PARTY_TO]-(x2:Crime)
RETURN x0",What phones are owned by individuals linked to a crime?,What phones are owned by individuals linked to a crime?,,3,4,entity_set,53
2361,"Which areas experienced crimes on August 16, 2017?","MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location)-[:OCCURRED_AT]-(x2:Crime WHERE x2.date = ""16/08/2017"")
RETURN x0","[Crime] = 16/08/2017
Which areas experienced crimes on August 16, 2017?",Which areas experienced crimes on [x2.Crime.date:16/08/2017]?,"x2.Crime.date:16/08/2017 = August 16, 2017",3,323,entity_set,918
4426,In which address does the person with the phone number 7-(469)440-8216 live?,"MATCH (x0:Location)-[:CURRENT_ADDRESS]-(x1:Person)-[:HAS_PHONE]-(x2:Phone WHERE x2.phoneNo = ""7-(469)440-8216"")
RETURN x0.address","[Phone] = 7-(469)440-8216
In which address does the person with the phone number 7-(469)440-8216 live?",In which address does the person with the phone number [x2.Phone.phoneNo:7-(469)440-8216] live?,x2.Phone.phoneNo:7-(469)440-8216 = 7-(469)440-8216,3,16,attribute_set,1
2958,"When did the most recent Sonata-related crime, investigated by officer badge 16-2620347, occur?","MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.badge_no = ""16-2620347"")
MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Sonata"")
RETURN x0.date
ORDER BY x0.date DESC
LIMIT 1","[Officer] = 16-2620347
[Vehicle] = Sonata
When did the most recent Sonata-related crime, investigated by officer badge 16-2620347, occur?","When did the most recent [x1.Vehicle.model:Sonata]-related crime, investigated by officer badge [x2.Officer.badge_no:16-2620347], occur?","x1.Vehicle.model:Sonata = Sonata
x2.Officer.badge_no:16-2620347 = 16-2620347",3,429,argmax,1
1144,Which crimes classified as Other theft are being investigated by officers with last name Almeida?,"MATCH (x0:Crime WHERE x0.type = ""Other theft"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Almeida"")
RETURN x0","[Crime] = Other theft
[Officer] = Almeida
Which crimes classified as Other theft are being investigated by officers with last name Almeida?",Which crimes classified as [x0.Crime.type:Other theft] are being investigated by officers with last name [x1.Officer.surname:Almeida]?,"x0.Crime.type:Other theft = Other theft
x1.Officer.surname:Almeida = Almeida",2,152,entity_set,2
3456,What time did a call come in to a person with the last name Myers on 29/08/2017?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""29/08/2017"")-[:CALLED]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.surname = ""Myers"")
RETURN x0.call_time","[PhoneCall] = 29/08/2017
[Person] = Myers
What time did a call come in to a person with the last name Myers on 29/08/2017?",What time did a call come in to a person with the last name [x2.Person.surname:Myers] on [x0.PhoneCall.call_date:29/08/2017]?,"x0.PhoneCall.call_date:29/08/2017 = 29/08/2017
x2.Person.surname:Myers = Myers",3,77,attribute_set,1
2028,Can you provide the post codes for the M34 area?,"MATCH (x0:PostCode)-[:POSTCODE_IN_AREA]-(x1:Area WHERE x1.areaCode = ""M34"")
RETURN x0","[Area] = M34
Can you provide the post codes for the M34 area?",Can you provide the post codes for the [x1.Area.areaCode:M34] area?,x1.Area.areaCode:M34 = M34,2,272,entity_set,203
535,How many crimes included Honda vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.make = ""Honda"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Honda
How many crimes included Honda vehicles?",How many crimes included [x1.Vehicle.make:Honda] vehicles?,x1.Vehicle.make:Honda = Honda,2,70,count,1
1676,How many 11-second calls were made to 9-(879)321-8806?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(879)321-8806"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
[Phone] = 9-(879)321-8806
How many 11-second calls were made to 9-(879)321-8806?",How many [x0.PhoneCall.call_duration:11]-second calls were made to [x1.Phone.phoneNo:9-(879)321-8806]?,"x0.PhoneCall.call_duration:11 = 11
x1.Phone.phoneNo:9-(879)321-8806 = 9-(879)321-8806",2,220,count,1
2780,When did a crime first occur involving relatives of someone with last name Brooks?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Brooks"")
RETURN x0.date
ORDER BY x0.date ASC
LIMIT 1","[Person] = Brooks
When did a crime first occur involving relatives of someone with last name Brooks?",When did a crime first occur involving relatives of someone with last name [x2.Person.surname:Brooks]?,x2.Person.surname:Brooks = Brooks,3,405,argmin,1
499,Who are the officers that investigated public order crimes?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.type = ""Public order"")
RETURN x0","[Crime] = Public order
Who are the officers that investigated public order crimes?",Who are the officers that investigated [x1.Crime.type:Public order] crimes?,x1.Crime.type:Public order = public order,2,65,entity_set,4839
483,What vehicles have been associated with crimes from 8/08/2017 onward?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""8/08/2017"")
RETURN x0","[Crime] = 8/08/2017
What vehicles have been associated with crimes from 8/08/2017 onward?",What vehicles have been associated with crimes from [x1.Crime.date:8/08/2017] onward?,x1.Crime.date:8/08/2017 = 8/08/2017,2,63,entity_set,31
105,What is the number of Ford cars connected to crimes on 23rd August 2017?,"MATCH (x0:Vehicle WHERE x0.make = ""Ford"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""23/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = Ford
[Crime] = 23/08/2017
What is the number of Ford cars connected to crimes on 23rd August 2017?",What is the number of [x0.Vehicle.make:Ford] cars connected to crimes on [x1.Crime.date:23/08/2017]?,"x0.Vehicle.make:Ford = Ford
x1.Crime.date:23/08/2017 = 23rd August 2017",2,12,count,1
1628,What areas contain locations with the postcode M20 4SU?,"MATCH (x0:Area)-[:LOCATION_IN_AREA]-(x1:Location WHERE x1.postcode = ""M20 4SU"")
RETURN x0","[Location] = M20 4SU
What areas contain locations with the postcode M20 4SU?",What areas contain locations with the postcode [x1.Location.postcode:M20 4SU]?,x1.Location.postcode:M20 4SU = M20 4SU,2,215,entity_set,1
1032,How many people live at places with the postcode M22 5EZ?,"MATCH (x0:Location WHERE x0.postcode = ""M22 5EZ"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = M22 5EZ
How many people live at places with the postcode M22 5EZ?",How many people live at places with the postcode [x0.Location.postcode:M22 5EZ]?,x0.Location.postcode:M22 5EZ = M22 5EZ,2,136,count,1
2253,"What are the crime locations from August 16, 2017?","MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime WHERE x1.date = ""16/08/2017"")
RETURN x0","[Crime] = 16/08/2017
What are the crime locations from August 16, 2017?",What are the crime locations from [x1.Crime.date:16/08/2017]?,"x1.Crime.date:16/08/2017 = August 16, 2017",2,304,entity_set,918
248,What phones were called on 28/08/2017?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_date = ""28/08/2017"")
RETURN x0","[PhoneCall] = 28/08/2017
What phones were called on 28/08/2017?",What phones were called on [x1.PhoneCall.call_date:28/08/2017]?,x1.PhoneCall.call_date:28/08/2017 = 28/08/2017,2,30,entity_set,19
4455,How is the status of the investigation of the first crime where the suspect has the phone number of the individual with NHS number 576-99-9244?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)-[:KNOWS_PHONE]-(x2:Person WHERE x2.nhs_no = ""576-99-9244"")
RETURN x0.last_outcome
ORDER BY x0.date ASC
LIMIT 1","[Person] = 576-99-9244
How is the status of the investigation of the first crime where the suspect has the phone number of the individual with NHS number 576-99-9244?",How is the status of the investigation of the first crime where the suspect has the phone number of the individual with NHS number [x2.Person.nhs_no:576-99-9244]?,x2.Person.nhs_no:576-99-9244 = 576-99-9244,3,32,argmin,1
1898,What is the count of 2009 vehicles linked to crimes on 11/08/2017?,"MATCH (x0:Vehicle WHERE x0.year = ""2009"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""11/08/2017"")
RETURN COUNT(DISTINCT x0)","[Vehicle] = 2009
[Crime] = 11/08/2017
What is the count of 2009 vehicles linked to crimes on 11/08/2017?",What is the count of [x0.Vehicle.year:2009] vehicles linked to crimes on [x1.Crime.date:11/08/2017]?,"x0.Vehicle.year:2009 = 2009
x1.Crime.date:11/08/2017 = 11/08/2017",2,253,count,1
4637,What are the crime scene addresses linked to Officer Duny's investigations?,"MATCH (x0:Location)-[:OCCURRED_AT]-(x1:Crime)-[:INVESTIGATED_BY]-(x2:Officer WHERE x2.surname = ""Duny"")
RETURN x0.address","[Officer] = Duny
What are the crime scene addresses linked to Officer Duny's investigations?",What are the crime scene addresses linked to Officer [x2.Officer.surname:Duny]'s investigations?,x2.Officer.surname:Duny = Duny,3,93,attribute_set,33
784,Which is the oldest vehicle linked to a crime under investigation involving someone with surname Moore?,"MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Under investigation"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Moore"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Under investigation
[Person] = Moore
Which is the oldest vehicle linked to a crime under investigation involving someone with surname Moore?",Which is the oldest vehicle linked to a crime [x1.Crime.last_outcome:Under investigation] involving someone with surname [x2.Person.surname:Moore]?,"x1.Crime.last_outcome:Under investigation = under investigation
x2.Person.surname:Moore = Moore",3,103,max,1
1173,What are the criminal damage and arson incidents assigned to officers with badge number 87-5149886?,"MATCH (x0:Crime WHERE x0.type = ""Criminal damage and arson"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""87-5149886"")
RETURN x0","[Crime] = Criminal damage and arson
[Officer] = 87-5149886
What are the criminal damage and arson incidents assigned to officers with badge number 87-5149886?",What are the [x0.Crime.type:Criminal damage and arson] incidents assigned to officers with badge number [x1.Officer.badge_no:87-5149886]?,"x0.Crime.type:Criminal damage and arson = criminal damage and arson
x1.Officer.badge_no:87-5149886 = 87-5149886",2,156,entity_set,4
1762,Can you name the areas connected to postcode WN2 1YL?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WN2 1YL"")
RETURN x0","[PostCode] = WN2 1YL
Can you name the areas connected to postcode WN2 1YL?",Can you name the areas connected to postcode [x1.PostCode.code:WN2 1YL]?,x1.PostCode.code:WN2 1YL = WN2 1YL,2,234,entity_set,1
1359,What 1987 vehicles were implicated in a crime on 14/08/2017?,"MATCH (x0:Vehicle WHERE x0.year = ""1987"")-[:INVOLVED_IN]-(x1:Crime WHERE x1.date = ""14/08/2017"")
RETURN x0","[Vehicle] = 1987
[Crime] = 14/08/2017
What 1987 vehicles were implicated in a crime on 14/08/2017?",What [x0.Vehicle.year:1987] vehicles were implicated in a crime on [x1.Crime.date:14/08/2017]?,"x0.Vehicle.year:1987 = 1987
x1.Crime.date:14/08/2017 = 14/08/2017",2,179,entity_set,1
266,"On 21/08/2017, how many crimes included C-Class cars?","MATCH (x0:Crime WHERE x0.date = ""21/08/2017"")-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""C-Class"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
[Vehicle] = C-Class
On 21/08/2017, how many crimes included C-Class cars?","On [x0.Crime.date:21/08/2017], how many crimes included [x1.Vehicle.model:C-Class] cars?","x0.Crime.date:21/08/2017 = 21/08/2017
x1.Vehicle.model:C-Class = C-Class",2,32,count,1
1035,How many properties with the postcode M22 9ND are occupied?,"MATCH (x0:Location WHERE x0.postcode = ""M22 9ND"")-[:CURRENT_ADDRESS]-(x1:Person)
RETURN COUNT(DISTINCT x0)","[Location] = M22 9ND
How many properties with the postcode M22 9ND are occupied?",How many properties with the postcode [x0.Location.postcode:M22 9ND] are occupied?,x0.Location.postcode:M22 9ND = M22 9ND,2,136,count,1
781,"What is the oldest vehicle linked to a crime with the status ""Investigation complete; no suspect identified"" involving someone with last name Peters?","MATCH (x0:Vehicle)-[:INVOLVED_IN]-(x1:Crime WHERE x1.last_outcome = ""Investigation complete; no suspect identified"")-[:PARTY_TO]-(x2:Person WHERE x2.surname = ""Peters"")
RETURN x0
ORDER BY x0.year DESC
LIMIT 1","[Crime] = Investigation complete; no suspect identified
[Person] = Peters
What is the oldest vehicle linked to a crime with the status ""Investigation complete; no suspect identified"" involving someone with last name Peters?","What is the oldest vehicle linked to a crime with the status ""[x1.Crime.last_outcome:Investigation complete; no suspect identified]"" involving someone with last name [x2.Person.surname:Peters]?","x1.Crime.last_outcome:Investigation complete; no suspect identified = Investigation complete; no suspect identified
x2.Person.surname:Peters = Peters",3,103,max,1
189,What is the count of 11-second phone calls made?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""11"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 11
What is the count of 11-second phone calls made?",What is the count of [x0.PhoneCall.call_duration:11]-second phone calls made?,x0.PhoneCall.call_duration:11 = 11,2,23,count,1
281,How many burglaries do police constables investigate?,"MATCH (x0:Crime WHERE x0.type = ""Burglary"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.rank = ""Police Constable"")
RETURN COUNT(DISTINCT x0)","[Crime] = Burglary
[Officer] = Police Constable
How many burglaries do police constables investigate?",How many [x0.Crime.type:Burglary] do [x1.Officer.rank:Police Constable] investigate?,"x0.Crime.type:Burglary = burglaries
x1.Officer.rank:Police Constable = police constables",2,34,count,1
1867,How many phones are owned by people whose last name is Oliver?,"MATCH (x0:Phone)-[:HAS_PHONE]-(x1:Person WHERE x1.surname = ""Oliver"")
RETURN COUNT(DISTINCT x0)","[Person] = Oliver
How many phones are owned by people whose last name is Oliver?",How many phones are owned by people whose last name is [x1.Person.surname:Oliver]?,x1.Person.surname:Oliver = Oliver,2,249,count,1
1065,Can you provide a list of crimes at 124 Wapping Street with the status Unable to prosecute suspect?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Unable to prosecute suspect"")-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""124 Wapping Street"")
RETURN x0","[Crime] = Unable to prosecute suspect
[Location] = 124 Wapping Street
Can you provide a list of crimes at 124 Wapping Street with the status Unable to prosecute suspect?",Can you provide a list of crimes at [x1.Location.address:124 Wapping Street] with the status [x0.Crime.last_outcome:Unable to prosecute suspect]?,"x0.Crime.last_outcome:Unable to prosecute suspect = Unable to prosecute suspect
x1.Location.address:124 Wapping Street = 124 Wapping Street",2,140,entity_set,2
3661,Can you identify the surnames of individuals who have the phone number of a person residing with Jonathan?,"MATCH (x0:Person)-[:KNOWS_PHONE]-(x1:Person)-[:KNOWS_LW]-(x2:Person WHERE x2.name = ""Jonathan"")
RETURN x0.surname","[Person] = Jonathan
Can you identify the surnames of individuals who have the phone number of a person residing with Jonathan?",Can you identify the surnames of individuals who have the phone number of a person residing with [x2.Person.name:Jonathan]?,x2.Person.name:Jonathan = Jonathan,3,166,attribute_set,4
756,What is the first recorded crime at 170 Thorn Lea?,"MATCH (x0:Crime)-[:OCCURRED_AT]-(x1:Location WHERE x1.address = ""170 Thorn Lea"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Location] = 170 Thorn Lea
What is the first recorded crime at 170 Thorn Lea?",What is the first recorded crime at [x1.Location.address:170 Thorn Lea]?,x1.Location.address:170 Thorn Lea = 170 Thorn Lea,2,100,min,1
3207,How many individuals have friends with last name Taylor who are also related to someone with last name Fisher?,"MATCH (x0:Person)-[:KNOWS_SN]-(x1:Person WHERE x1.surname = ""Taylor"")-[:FAMILY_REL]-(x2:Person WHERE x2.surname = ""Fisher"")
RETURN COUNT(DISTINCT x0)","[Person] = Taylor
[Person] = Fisher
How many individuals have friends with last name Taylor who are also related to someone with last name Fisher?",How many individuals have friends with last name [x1.Person.surname:Taylor] who are also related to someone with last name [x2.Person.surname:Fisher]?,"x1.Person.surname:Taylor = Taylor
x2.Person.surname:Fisher = Fisher",3,24,count,1
803,Can you provide the badge numbers of officers involved in investigations on 10/08/2017?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime WHERE x1.date = ""10/08/2017"")
RETURN x0.badge_no","[Crime] = 10/08/2017
Can you provide the badge numbers of officers involved in investigations on 10/08/2017?",Can you provide the badge numbers of officers involved in investigations on [x1.Crime.date:10/08/2017]?,x1.Crime.date:10/08/2017 = 10/08/2017,2,106,attribute_set,972
2283,What is the count of crimes under investigation by officer 31-2542986?,"MATCH (x0:Crime WHERE x0.last_outcome = ""Under investigation"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""31-2542986"")
RETURN COUNT(DISTINCT x0)","[Crime] = Under investigation
[Officer] = 31-2542986
What is the count of crimes under investigation by officer 31-2542986?",What is the count of crimes [x0.Crime.last_outcome:Under investigation] by officer [x1.Officer.badge_no:31-2542986]?,"x0.Crime.last_outcome:Under investigation = under investigation
x1.Officer.badge_no:31-2542986 = 31-2542986",2,307,count,1
1652,What are the 20-second calls received at 7-(277)735-5232?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""20"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""7-(277)735-5232"")
RETURN x0","[PhoneCall] = 20
[Phone] = 7-(277)735-5232
What are the 20-second calls received at 7-(277)735-5232?",What are the [x0.PhoneCall.call_duration:20]-second calls received at [x1.Phone.phoneNo:7-(277)735-5232]?,"x0.PhoneCall.call_duration:20 = 20
x1.Phone.phoneNo:7-(277)735-5232 = 7-(277)735-5232",2,217,entity_set,2
1970,How many calls at 01:39 were to any phone?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""01:39"")-[:CALLER]-(x1:Phone)
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 01:39
How many calls at 01:39 were to any phone?",How many calls at [x0.PhoneCall.call_time:01:39] were to any phone?,x0.PhoneCall.call_time:01:39 = 01:39,2,265,count,1
234,Which calls on 07/08/2017 were directed to 9-(033)345-4193?,"MATCH (x0:PhoneCall WHERE x0.call_date = ""07/08/2017"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""9-(033)345-4193"")
RETURN x0","[PhoneCall] = 07/08/2017
[Phone] = 9-(033)345-4193
Which calls on 07/08/2017 were directed to 9-(033)345-4193?",Which calls on [x0.PhoneCall.call_date:07/08/2017] were directed to [x1.Phone.phoneNo:9-(033)345-4193]?,"x0.PhoneCall.call_date:07/08/2017 = 07/08/2017
x1.Phone.phoneNo:9-(033)345-4193 = 9-(033)345-4193",2,29,entity_set,1
1885,Which individuals named Amy have a family relation to individuals bearing the last name Wood?,"MATCH (x0:Person WHERE x0.name = ""Amy"")-[:FAMILY_REL]-(x1:Person WHERE x1.surname = ""Wood"")
RETURN x0","[Person] = Amy
[Person] = Wood
Which individuals named Amy have a family relation to individuals bearing the last name Wood?",Which individuals named [x0.Person.name:Amy] have a family relation to individuals bearing the last name [x1.Person.surname:Wood]?,"x0.Person.name:Amy = Amy
x1.Person.surname:Wood = Wood",2,251,entity_set,1
3281,Which call was last made to the phone associated with NHS number 218-31-0921?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""218-31-0921"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 218-31-0921
Which call was last made to the phone associated with NHS number 218-31-0921?",Which call was last made to the phone associated with NHS number [x2.Person.nhs_no:218-31-0921]?,x2.Person.nhs_no:218-31-0921 = 218-31-0921,3,36,max,1
1591,How many districts contain the postcode WA14 1ND?,"MATCH (x0:Area)-[:POSTCODE_IN_AREA]-(x1:PostCode WHERE x1.code = ""WA14 1ND"")
RETURN COUNT(DISTINCT x0)","[PostCode] = WA14 1ND
How many districts contain the postcode WA14 1ND?",How many districts contain the postcode [x1.PostCode.code:WA14 1ND]?,x1.PostCode.code:WA14 1ND = WA14 1ND,2,210,count,1
2553,How often do crimes involve individuals?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person)
RETURN COUNT(DISTINCT x0)",How often do crimes involve individuals?,How often do crimes involve individuals?,,2,357,count,1
1446,How many incidents from 21/08/2017 are examined by officers with badge number 21-0331808?,"MATCH (x0:Crime WHERE x0.date = ""21/08/2017"")-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.badge_no = ""21-0331808"")
RETURN COUNT(DISTINCT x0)","[Crime] = 21/08/2017
[Officer] = 21-0331808
How many incidents from 21/08/2017 are examined by officers with badge number 21-0331808?",How many incidents from [x0.Crime.date:21/08/2017] are examined by officers with badge number [x1.Officer.badge_no:21-0331808]?,"x0.Crime.date:21/08/2017 = 21/08/2017
x1.Officer.badge_no:21-0331808 = 21-0331808",2,190,count,1
4573,Who investigated the crime related to the person with NHS number 589-69-0106?,"MATCH (x0:Officer)-[:INVESTIGATED_BY]-(x1:Crime)-[:PARTY_TO]-(x2:Person WHERE x2.nhs_no = ""589-69-0106"")
RETURN x0","[Person] = 589-69-0106
Who investigated the crime related to the person with NHS number 589-69-0106?",Who investigated the crime related to the person with NHS number [x2.Person.nhs_no:589-69-0106]?,x2.Person.nhs_no:589-69-0106 = 589-69-0106,3,67,entity_set,1
2425,Which crime was first looked into by officers with the last name Tarquini?,"MATCH (x0:Crime)-[:INVESTIGATED_BY]-(x1:Officer WHERE x1.surname = ""Tarquini"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Officer] = Tarquini
Which crime was first looked into by officers with the last name Tarquini?",Which crime was first looked into by officers with the last name [x1.Officer.surname:Tarquini]?,x1.Officer.surname:Tarquini = Tarquini,2,334,min,1
573,What are the residences linked to NHS number 888-09-8856 that have the postcode OL10 1AU?,"MATCH (x0:Location WHERE x0.postcode = ""OL10 1AU"")-[:CURRENT_ADDRESS]-(x1:Person WHERE x1.nhs_no = ""888-09-8856"")
RETURN x0","[Location] = OL10 1AU
[Person] = 888-09-8856
What are the residences linked to NHS number 888-09-8856 that have the postcode OL10 1AU?",What are the residences linked to NHS number [x1.Person.nhs_no:888-09-8856] that have the postcode [x0.Location.postcode:OL10 1AU]?,"x0.Location.postcode:OL10 1AU = OL10 1AU
x1.Person.nhs_no:888-09-8856 = 888-09-8856",2,76,entity_set,1
3279,What is the latest call made to the phone of the person with NHS number 218-31-0921?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone)-[:HAS_PHONE]-(x2:Person WHERE x2.nhs_no = ""218-31-0921"")
RETURN x0
ORDER BY x0.call_date DESC
LIMIT 1","[Person] = 218-31-0921
What is the latest call made to the phone of the person with NHS number 218-31-0921?",What is the latest call made to the phone of the person with NHS number [x2.Person.nhs_no:218-31-0921]?,x2.Person.nhs_no:218-31-0921 = 218-31-0921,3,36,max,1
584,Can you provide the times of calls to 1-(463)289-5744?,"MATCH (x0:PhoneCall)-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""1-(463)289-5744"")
RETURN x0.call_time","[Phone] = 1-(463)289-5744
Can you provide the times of calls to 1-(463)289-5744?",Can you provide the times of calls to [x1.Phone.phoneNo:1-(463)289-5744]?,x1.Phone.phoneNo:1-(463)289-5744 = 1-(463)289-5744,2,77,attribute_set,2
1609,How many phones took a call for 24 seconds?,"MATCH (x0:Phone)-[:CALLED]-(x1:PhoneCall WHERE x1.call_duration = ""24"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 24
How many phones took a call for 24 seconds?",How many phones took a call for [x1.PhoneCall.call_duration:24] seconds?,x1.PhoneCall.call_duration:24 = 24,2,212,count,1
1512,What is the first crime linked to those with the surname Williamson?,"MATCH (x0:Crime)-[:PARTY_TO]-(x1:Person WHERE x1.surname = ""Williamson"")
RETURN x0
ORDER BY x0.date ASC
LIMIT 1","[Person] = Williamson
What is the first crime linked to those with the surname Williamson?",What is the first crime linked to those with the surname [x1.Person.surname:Williamson]?,x1.Person.surname:Williamson = Williamson,2,200,min,1
1672,How often were 21-second calls placed to 8-(689)151-8054?,"MATCH (x0:PhoneCall WHERE x0.call_duration = ""21"")-[:CALLER]-(x1:Phone WHERE x1.phoneNo = ""8-(689)151-8054"")
RETURN COUNT(DISTINCT x0)","[PhoneCall] = 21
[Phone] = 8-(689)151-8054
How often were 21-second calls placed to 8-(689)151-8054?",How often were [x0.PhoneCall.call_duration:21]-second calls placed to [x1.Phone.phoneNo:8-(689)151-8054]?,"x0.PhoneCall.call_duration:21 = 21
x1.Phone.phoneNo:8-(689)151-8054 = 8-(689)151-8054",2,220,count,1
385,What is the most recent crime involving Bonneville model vehicles?,"MATCH (x0:Crime)-[:INVOLVED_IN]-(x1:Vehicle WHERE x1.model = ""Bonneville"")
RETURN x0
ORDER BY x0.date DESC
LIMIT 1","[Vehicle] = Bonneville
What is the most recent crime involving Bonneville model vehicles?",What is the most recent crime involving [x1.Vehicle.model:Bonneville] model vehicles?,x1.Vehicle.model:Bonneville = Bonneville,2,51,max,1
1839,Which phone calls at 19:49 reached 0-(990)661-7067?,"MATCH (x0:PhoneCall WHERE x0.call_time = ""19:49"")-[:CALLED]-(x1:Phone WHERE x1.phoneNo = ""0-(990)661-7067"")
RETURN x0","[PhoneCall] = 19:49
[Phone] = 0-(990)661-7067
Which phone calls at 19:49 reached 0-(990)661-7067?",Which phone calls at [x0.PhoneCall.call_time:19:49] reached [x1.Phone.phoneNo:0-(990)661-7067]?,"x0.PhoneCall.call_time:19:49 = 19:49
x1.Phone.phoneNo:0-(990)661-7067 = 0-(990)661-7067",2,244,entity_set,1
2267,How many individuals reside with someone named Anne?,"MATCH (x0:Person)-[:KNOWS_LW]-(x1:Person WHERE x1.name = ""Anne"")
RETURN COUNT(DISTINCT x0)","[Person] = Anne
How many individuals reside with someone named Anne?",How many individuals reside with someone named [x1.Person.name:Anne]?,x1.Person.name:Anne = Anne,2,306,count,1
